{"recipe": [{"ingred": ["1 (9 inch) unbaked 9 inch pie crust", "1 pound broccoli, chopped", "1 tablespoon olive oil", "1 onion, finely chopped", "4 cloves garlic, minced", "1 pound firm tofu, drained", "1/2 cup soy milk", "1/4 teaspoon Dijon mustard", "3/4 teaspoon salt", "1/4 teaspoon ground nutmeg", "1/2 teaspoon ground red pepper", "black pepper to taste", "1 tablespoon dried parsley", "1/8 cup Parmesan flavor soy cheese"], "time": 65, "instr": "Preheat oven to 400 degrees F (200 degrees C). Bake pie crust in preheated oven for 10 to 12 minutes.\nPlace broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nHeat oil in a large skillet over medium-high heat. Saute onion and garlic until golden. Stir in the cooked broccoli and heat through.\nIn a blender, combine tofu, soy milk, mustard, salt, nutmeg, ground red pepper, black pepper, parsley and Parmesan soy cheese; process until smooth. In a large bowl combine tofu mixture with broccoli mixture. Pour into pie crust.\nBake in preheated oven until quiche is set, 35 to 40 minutes. Allow to stand for at least 5 minutes before cutting.\n", "title": "Tofu Quiche with Broccoli", "urlnum": "25320"}, {"ingred": ["3 eggplant, peeled and thinly sliced", "2 eggs, beaten", "4 cups Italian seasoned bread crumbs", "6 cups spaghetti sauce, divided", "1 (16 ounce) package mozzarella cheese, shredded and divided", "1/2 cup grated Parmesan cheese, divided", "1/2 teaspoon dried basil"], "time": 60, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nDip eggplant slices in egg, then in bread crumbs. Place in a single layer on a baking sheet. Bake in preheated oven for 5 minutes on each side.\nIn a 9x13 inch baking dish spread spaghetti sauce to cover the bottom. Place a layer of eggplant slices in the sauce. Sprinkle with mozzarella and Parmesan cheeses. Repeat with remaining ingredients, ending with the cheeses. Sprinkle basil on top.\nBake in preheated oven for 35 minutes, or until golden brown.\n", "title": "Eggplant Parmesan II", "urlnum": "25321"}, {"ingred": ["1/2 cup seashell pasta", "1 cup tomato sauce", "1/2 cup mushrooms, diced", "1/4 cup crumbled firm silken tofu", "1/4 cup shredded mozzarella cheese", "2 tablespoons grated Parmesan cheese"], "time": 40, "instr": "Bring a pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nPreheat oven to 400 degrees F (200 degrees C).\nIn a medium bowl combine tomato sauce, mushrooms and tofu. Stir in cooked pasta. In a separate, small bowl combine mozzarella and Parmesan cheeses.\nIn a small casserole dish layer pasta mixture and cheeses.\nBake in preheated oven for 30 minutes, or until lightly browned.\n", "title": "Baked Shells in Sauce", "urlnum": "25322"}, {"ingred": ["1 pound fresh asparagus, trimmed and cut into 2 inch pieces", "2 tablespoons butter", "1 clove garlic, minced", "1 pint light cream", "1 pound linguine pasta", "1 lemon, juiced"], "time": 30, "instr": "Bring a pot of water to a boil. Boil asparagus for 3 to 4 minutes; drain.\nIn a large saucepan melt butter over medium heat. Saute garlic and asparagus for 3 to 4 minutes. Stir in the cream and simmer for 10 minutes.\nMeanwhile, bring a large pot of water to a boil. Add linguine and cook for 8 to 10 minutes or until al dente; drain and transfer to a serving dish.\nStir lemon juice into asparagus mixture; pour mixture over pasta.\n", "title": "Creamy Asparagus Pasta", "urlnum": "25323"}, {"ingred": ["2 large potatoes, peeled and chopped", "1 cup self-rising flour", "1 egg", "8 large seasoned croutons"], "time": 50, "instr": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender, about 15 minutes. Drain and mash.\nIn a medium bowl combine 2 cups mashed potatoes with flour and egg. Using about 1/4 to 1/2 cup of mixture each, shape into dumplings. Press a crouton into the center of each and seal dough around it.\nDrop dumplings into simmering soup or broth, cover and cook 20 minutes. Do not remove lid while dumplings are cooking.\n", "title": "Potato Dumplings", "urlnum": "25324"}, {"ingred": ["4 English muffins, split and toasted", "1 avocado, mashed", "1 cup alfalfa sprouts", "1 small tomato, chopped", "1 small sweet onion, chopped", "4 tablespoons Ranch-style salad dressing", "4 tablespoons toasted sesame seeds", "1 cup shredded smoked Cheddar cheese"], "time": 25, "instr": "Preheat oven to broil.\nPlace each muffin open-faced on a cookie sheet. Spread each half with mashed avocado; place halves close together. Distributing ingredients evenly, cover each half with sprouts, tomatoes, onion, dressing, sesame seeds and cheese.\nPlace under broiler for about 5 minutes, or until cheese is melted and bubbly.\n", "title": "The Best Veggie Sandwich", "urlnum": "25325"}, {"ingred": ["6 eggs, beaten", "1 1/4 cups Italian-style dry bread crumbs", "1 tablespoon grated Parmesan cheese", "2 teaspoons dried parsley", "1 clove garlic, minced", "1/4 teaspoon pepper", "1/4 teaspoon salt"], "time": 40, "instr": "Preheat oven to 325 degrees F (165 degrees C).\nIn a medium bowl combine eggs, bread crumbs, Parmesan cheese, parsley, garlic, salt and pepper. Mixture should be moist and sticky, but should hold together when formed into balls.\nBake in preheated oven for 30 minutes.\n", "title": "Faux Meat Balls", "urlnum": "25326"}, {"ingred": ["2 tablespoons cornstarch", "1 cup soy milk", "1 cup soy creamer", "1/2 cup white sugar", "3 tablespoons egg replacer (dry)", "3 ounces semisweet chocolate, chopped", "2 teaspoons vanilla extract"], "time": 210, "instr": "In a medium saucepan combine cornstarch, soy milk and soy creamer; stir to dissolve cornstarch. Place on medium heat and stir in sugar. Cook, whisking frequently, until mixture comes to a low boil; remove from heat.\nIn a small bowl whisk egg replacer with 1/4 cup of hot milk mixture; return to pan with remaining milk mixture. Cook over medium heat for 3 to 4 minutes, until thick, but not boiling.\nPlace the chocolate in a medium bowl and pour in the hot milk mixture. Let stand for 30 seconds, then stir until melted and smooth. Cool for 10 to 15 minutes, then stir in vanilla.\nPour into ramekins or custard cups. Cover with plastic wrap and let cool at room temperature. Refrigerate for 3 hours, or overnight before serving.\n", "title": "Yummy Vegan Chocolate Pudding", "urlnum": "25327"}, {"ingred": ["1 cup Basmati rice", "3 2/3 cups water, divided", "2 tablespoons soy margarine", "2 tablespoons nutritional yeast", "1/2 teaspoon garlic powder", "1 1/2 teaspoons dried basil", "salt to taste"], "time": 30, "instr": "In a saucepan bring 3 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes, or until rice is cooked and all liquid is absorbed.\nMelt margarine in a large saucepan over medium heat. Stir in remaining 2/3 cup water, nutritional yeast, garlic powder, basil and salt; heat for 5 minutes. Stir in cooked rice and cook until heated through, about 2 minutes.\n", "title": "Seasoned Rice", "urlnum": "25328"}, {"ingred": ["2 pounds potatoes, peeled", "1 pound broccoli, chopped", "2/3 cup shredded Monterey Jack cheese", "1/2 lemon, juiced", "2 teaspoons minced garlic", "1 tablespoon chopped fresh basil", "3/4 teaspoon dried oregano", "1/2 tablespoon dried parsley", "salt and pepper to taste", "2 (10 ounce) packages refrigerated pizza crust doughs", "1 (14 ounce) jar pizza sauce"], "time": 45, "instr": "Preheat oven to 400 degrees F (200 degrees C).\nBring a pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes; drain. When cool enough to handle, slice potatoes.\nMeanwhile, place broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes; drain.\nIn a large bowl combine potatoes, broccoli, cheese, lemon juice, garlic, basil, oregano and parsley. On a pizza pan or baking sheet, roll out 1 pizza dough. Top with potato mixture; season with salt and pepper. Cover with second pizza dough; with moistened fingers, seal edges of dough together.\nBake in preheated oven for 20 minutes, or until golden brown. Serve with warmed pizza sauce.\n", "title": "Broccoli Pizza Pie", "urlnum": "25329"}, {"ingred": ["1 (12 ounce) package vegetarian burger crumbles", "1 (15 ounce) can tomato sauce", "1 cup water", "1 small onion, chopped", "3 cloves garlic, minced", "1 tablespoon vegetarian Worcestershire sauce", "1 teaspoon liquid smoke flavoring", "2 teaspoons chili powder", "1/8 teaspoon black pepper", "1 teaspoon dry mustard", "1 teaspoon salt", "1/8 teaspoon red pepper flakes"], "time": 40, "instr": "In a large pot combine crumbles, tomato sauce, water, onion, garlic, Worcestershire sauce, liquid smoke, chili powder, black pepper, mustard, salt and pepper flakes. Cook on low heat for 30 minutes, or until heated through.\n", "title": "Vegan Chili", "urlnum": "25330"}, {"ingred": ["1 tablespoon olive oil", "1 (15 ounce) can kidney beans", "1 1/2 cups tomato sauce", "4 1/2 cups water, divided", "1/2 teaspoon dried oregano", "1/2 teaspoon dried basil", "1 pinch dried thyme", "salt and pepper to taste", "5 teaspoons adobo seasoning, divided", "2 cups uncooked white rice"], "time": 35, "instr": "In a large saucepan combine olive oil, kidney beans, tomato sauce, 1/2 cup water, oregano, basil, thyme, salt, pepper and 2 teaspoons adobo. Simmer on low heat.\nMeanwhile, bring 4 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes, or until rice is cooked and all liquid is absorbed. Stir in remaining 3 teaspoons adobo. Serve beans over the rice.\n", "title": "American-Style Red Beans and Rice", "urlnum": "25331"}, {"ingred": ["1 (16 ounce) package penne pasta", "2 cups chopped broccoli", "1 cup sliced mushrooms", "1 cup chopped green bell pepper", "1 tablespoon butter", "1 onion, chopped", "1 clove garlic, minced", "1/4 cup all-purpose flour", "4 cups nonfat milk", "1/2 cup grated Parmesan cheese", "salt and pepper to taste", "5 tablespoons chopped fresh basil, divided", "1/3 cup dry bread crumbs", "2 tablespoons grated Parmesan cheese", "1 butter flavored cooking spray"], "time": 55, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes. Stir in broccoli, mushrooms and green pepper, and cook 6 to 8 minutes more, or until pasta is al dente; drain.\nMeanwhile, melt butter in a medium saucepan over medium-high heat. Saute onions and garlic for 1 to 2 minutes. Stir in flour and milk; cook 5 minutes, or until mixture coats the back of a spoon. Remove from heat and stir in 1/2 cup Parmesan cheese, salt and pepper.\nIn a 9x13 inch baking dish combine pasta, vegetables, milk mixture and 4 tablespoons basil. Sprinkle with bread crumbs, 2 tablespoons Parmesan cheese, and remaining 1 tablespoon basil. Coat with butter flavored cooking spray.\nBake in preheated oven for 30 minutes, or until golden brown.\n", "title": "Vegetable Pasta Casserole", "urlnum": "25332"}, {"ingred": ["1 tablespoon olive oil", "1 large onion, chopped", "1 stalk celery, chopped", "2 carrots, chopped", "4 cloves garlic, chopped", "2 tablespoons chili powder", "1 tablespoon ground cumin", "1 pinch black pepper", "4 cups vegetable broth", "4 (15 ounce) cans black beans", "1 (15 ounce) can whole kernel corn", "1 (14.5 ounce) can crushed tomatoes"], "time": 45, "instr": "Heat oil in a large pot over medium-high heat. Saute onion, celery, carrots and garlic for 5 minutes. Season with chili powder, cumin, and black pepper; cook for 1 minute. Stir in vegetable broth, 2 cans of beans, and corn. Bring to a boil.\nMeanwhile, in a food processor or blender, process remaining 2 cans beans and tomatoes until smooth. Stir into boiling soup mixture, reduce heat to medium, and simmer for 15 minutes.\n", "title": "Vegan Black Bean Soup", "urlnum": "25333"}, {"ingred": ["2 (8 ounce) packages cream cheese, softened", "1 (16 ounce) package small curd cottage cheese", "1 (1 ounce) package taco seasoning mix", "1 teaspoon lemon juice", "2 bunches green onions, chopped", "1 (2 ounce) can diced black olives, drained", "1 tomato, chopped", "2 cups shredded lettuce", "2 cups shredded Cheddar cheese"], "time": 15, "instr": "In a medium bowl combine cream cheese, cottage cheese, taco seasoning and lemon juice.\nIn a glass bowl or on a serving platter, layer cheese mixture, green onions, black olives, tomatoes, lettuce and cheese.\n", "title": "Layered Taco Dip", "urlnum": "25334"}, {"ingred": ["1/4 cup olive oil", "1/4 cup red wine vinegar", "1 teaspoon dried oregano", "1 teaspoon chili powder", "garlic salt to taste", "salt and pepper to taste", "1 teaspoon white sugar", "2 small zucchini, julienned", "2 medium small yellow squash, julienned", "1 large onion, sliced", "1 green bell pepper, cut into thin strips", "1 red bell pepper, cut into thin strips", "2 tablespoons olive oil", "1 (8.75 ounce) can whole kernel corn, drained", "1 (15 ounce) can black beans, drained"], "time": 70, "instr": "In a large bowl combine olive oil, vinegar, oregano, chili powder, garlic salt, salt, pepper and sugar. To the marinade add the zucchini, yellow squash, onion, green pepper and red pepper. Marinate vegetables in the refrigerator for at least 30 minutes, but not more than 24 hours.\nHeat oil in a large skillet over medium-high heat. Drain the vegetables and saute until tender, about 10 to 15 minutes. Stir in the corn and beans; increase the heat to high for 5 minutes, to brown vegetables.\n", "title": "Vegan Fajitas", "urlnum": "25335"}, {"ingred": ["1 pound fresh fettuccine pasta", "5 ripe tomatoes, chopped", "1/2 small red onion, chopped", "1 cup chopped fresh basil", "1/2 cup pitted kalamata olives, chopped", "freshly ground black pepper to taste", "2 tablespoons extra virgin olive oil", "1 cup crumbled feta cheese"], "time": 20, "instr": "Bring a large pot of lightly salted water to a boil. Add fettuccini and cook for 8 to 10 minutes or until al dente; drain.\nIn a medium bowl combine tomatoes, onion, basil, olives and black pepper.\nToss the fettuccini with olive oil. Serve pasta topped with tomato mixture and feta cheese.\n", "title": "Fettuccini with Salsa Cruda and Feta", "urlnum": "25336"}, {"ingred": ["4 large baking potatoes", "1 small head broccoli, cut into florets", "salt and pepper to taste", "3 tablespoons roasted garlic and parmesan cheese sauce (such as Ragu®)"], "time": 55, "instr": "Wash potatoes and pierce with a fork. Microwave on high for 15 minutes, or until done.\nPlace broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nPreheat oven to 350 degrees F (175 degrees C).\nSlice the tops off of the potatoes, and scoop the flesh into a large bowl with the broccoli. Season with salt and pepper to taste. Stir in cheese sauce and mash mixture until desired consistency is reached, adding more sauce if desired. Spoon mixture back into the skins, and place on a baking sheet.\nBake in preheated oven for 30 minutes.\n", "title": "Parmesan and Broccoli Stuffed Potatoes", "urlnum": "25337"}, {"ingred": ["1 (12 ounce) package extra firm tofu", "3 tablespoons cornstarch", "oil for frying", "2 green onions, chopped", "2 tablespoons hoisin sauce"], "time": 15, "instr": "Cut tofu into 12 cubes. Place cornstarch on a plate or in a shallow bowl and dredge tofu in it, coating thoroughly.\nHeat enough oil so that tofu will be half-way submerged. Fry tofu in hot oil for 3 to 5 minutes on each side, or until crispy. Drain on paper towels.\nSprinkle green onions over tofu and drizzle with hoisin sauce. Serve immediately.\n", "title": "Agedashi-esque Tofu", "urlnum": "25338"}, {"ingred": ["1 (12 ounce) package vegetarian burger crumbles", "3 (15.25 ounce) cans kidney beans", "1 large red onion, chopped", "4 stalks celery, diced", "2 red bell peppers, chopped", "4 bay leaves", "2 tablespoons hot chili powder", "3 tablespoons molasses", "1 cube vegetable bouillon", "1 tablespoon chopped fresh cilantro", "1 teaspoon hot pepper sauce", "salt and pepper to taste", "1 cup water", "3 tablespoons all-purpose flour", "1 cup hot water"], "time": 260, "instr": "In a slow cooker combine vegetarian crumbles, kidney beans, onion, celery, bell pepper, bay leaves, chili powder, molasses, bouillon, cilantro, hot sauce, salt, pepper and 1 cup water. Cook on high for 3 hours.\nDissolve flour in 1 cup hot water. Pour into chili and cook 1 more hour.\n", "title": "Bold Vegan Chili", "urlnum": "25339"}, {"ingred": ["1 cup Basmati rice", "1 1/4 tablespoons vegetable oil", "1/2 teaspoon cumin seeds", "1/2 teaspoon whole cloves", "1 onion, chopped", "3 cups water", "1 1/2 teaspoons salt, or to taste", "2 tablespoons garam masala", "chili powder to taste", "1 cup frozen mixed vegetables", "1 tablespoon butter"], "time": 30, "instr": "Rinse and soak rice for 30 minutes; drain.\nHeat oil in a large saucepan over medium heat. Saute cumin seeds and cloves for less than 1 minute. Saute the onion, stirring constantly, until brown. Stir in rice and fry for about 1 minute, stirring. Stir in the water, salt, garam masala, chili powder and vegetables. Bring to a boil, then reduce heat, cover and simmer for 20 minutes, or until all water is absorbed. Fluff with a fork and stir in butter before serving.\n", "title": "Vegetable Biryani", "urlnum": "25340"}, {"ingred": ["12 Yukon Gold potatoes, peeled and quartered", "3 eggs", "3 tablespoons cream cheese, divided", "3 teaspoons milk, divided", "2 cups all-purpose flour, divided", "2 1/2 (8 ounce) containers cottage cheese", "salt to taste", "2 tablespoons butter", "oil for frying"], "time": 90, "instr": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain and cool.\nMeanwhile, prepare dough by combining 1 egg, 1 tablespoon cream cheese, 1 teaspoon milk and 1/2 cup flour. Once all the flour has been worked in, add another 1/2 cup flour, 1 tablespoon cream cheese and 1 teaspoon milk. When the dough is well blended, add 1 egg, 1 tablespoon cream cheese and another 1/2 cup flour; mix well. Finally, add the remaining egg, 1 teaspoon milk and 1/2 cup flour. If dough is too dry, add a little more milk; if too wet, add more flour.\nOn a well floured surface, roll out 1/4 of the dough to 1/4 inch thickness. Using a glass, muffin cutter, or any rounded surface, cut out circles of dough. Flour both sides of the circle and set aside in a single layer on wax paper. Repeat process with remaining dough.\nMash the potatoes with the cottage cheese, salt and butter. Place a spoonful of the filling slightly below the center of a circle of dough. Fold the dough over and seal edges with fingertips. Use enough filling so that you have to stretch the dough over it, but not so much that it squeezes out when sealed.\nBring a large pot of salted water to a boil. Drop in pierogis, a few at a time. Cook for 1 to 2 minutes, or until they float to the top; drain.\nHeat oil in a large skillet over medium-high heat. Fry boiled pierogis in hot oil until crispy.\n", "title": "Babaci's Potato Pierogi", "urlnum": "25341"}, {"ingred": ["2 tablespoons green peppercorns, drained", "1 cup coarsely chopped cilantro", "1 tablespoon olive oil", "1 pound Chinese yardlong beans", "4 cloves garlic, finely chopped", "2 teaspoons brown sugar", "1 small red chile pepper, seeded and chopped fine", "2 tablespoons water"], "time": 13, "instr": "In a small bowl, using the bottom of a glass or jar, crush the peppercorns into a coarse pulp. Stir in the cilantro.\nHeat oil in a large wok or skillet over medium-high heat. Stir in beans, garlic, brown sugar, chile pepper, peppercorns and cilantro. Stir-fry for 45 seconds. Pour in the water and cover to steam for about 2 minutes. Serve immediately.\n", "title": "Chinese Peppered Green Beans", "urlnum": "25342"}, {"ingred": ["1 1/4 cups dry kidney beans", "1 cup coconut milk", "1 sprig fresh thyme", "1 teaspoon minced garlic", "1/8 cup chopped green onions", "1 hot red chile pepper, sliced", "2 1/4 cups uncooked brown rice"], "time": 155, "instr": "Combine beans and coconut milk in a large saucepan; cook for 2 hours on low heat.\nStir in thyme, garlic, onions and 3 slices chile pepper; simmer for 7 minutes. Stir in rice and bring to a boil. Reduce heat, cover and simmer for 25 minutes, or until all liquid is absorbed and rice is tender.\n", "title": "Jamaican Beans and Rice Dish", "urlnum": "25343"}, {"ingred": ["1 cup olive oil, divided", "1 1/2 pounds onions, chopped", "1 3/4 cups uncooked white rice", "2 lemons, juiced", "2 tablespoons chopped fresh dill", "1/2 cup chopped fresh parsley", "2 tablespoons pine nuts", "1 (8 ounce) jar grape leaves, drained and rinsed"], "time": 90, "instr": "Preheat oven to 375 degrees F (190 degrees C).\nHeat 2 tablespoons oil in a large saucepan over medium heat. Saute onions until tender. Stir in rice and brown slightly. Add 3 1/2 cups water, and half of the lemon juice. Reduce heat, cover and simmer for 20 minutes, or until all liquid is absorbed and rice is tender. Stir in dill, parsley and pine nuts.\nRemove stems from grape leaves and place 1 tablespoon of rice mixture in the center. Fold in the sides and roll tightly. Place, folded side down, in a baking dish and cover with remaining olive oil, lemon juice and enough water to cover 1/2 of the dolmathas.\nCover with aluminum foil and bake in preheated oven for 45 minutes.\n", "title": "Dolmathes", "urlnum": "25344"}, {"ingred": ["1/2 (12 ounce) package uncooked lasagna noodles", "1 (12 ounce) package firm tofu, crumbled", "2 eggs", "1/4 teaspoon salt", "1/4 teaspoon black pepper", "1/4 teaspoon ground nutmeg", "2 tablespoons milk", "1 cup spaghetti sauce", "1 tablespoon dried parsley", "2 cups shredded mozzarella cheese, divided", "1/2 cup grated Parmesan cheese"], "time": 55, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add lasagna and cook for 8 to 10 minutes or until al dente; drain.\nIn a medium bowl combine tofu, eggs, salt, pepper, nutmeg, milk, spaghetti sauce, parsley and 1 cup of mozzarella cheese. Spread a layer in the bottom of a 9x13 inch baking dish.\nLayer lasagna noodles with the sauce mixture, ending with sauce. Sprinkle with remaining mozzarella and Parmesan cheese.\nBake in preheated oven for 25 to 35 minutes.\n", "title": "Tofu Lasagna", "urlnum": "25345"}, {"ingred": ["2 1/2 cups Basmati rice", "4 (10 ounce) cans coconut milk", "1 pinch salt"], "time": 30, "instr": "In a large saucepan over high heat, combine rice, coconut milk and salt; bring to a boil.\nReduce heat, cover and simmer for 20 to 25 minutes, or until liquid is absorbed and rice is tender.\n", "title": "Coconut Rice", "urlnum": "25346"}, {"ingred": ["1 eggplant, cut into 1 inch cubes", "1/4 cup olive oil", "1 cup chopped onion", "5 cloves garlic, chopped", "1/2 cup Basmati rice", "1 zucchini, cut into large chunks", "1 large red bell pepper, chopped", "3 fresh tomatoes, diced", "1 cup Marsala wine", "1 1/2 cups water", "1/2 teaspoon salt, or to taste", "1/4 teaspoon red pepper flakes", "1/4 cup chopped fresh basil", "1/4 cup chopped fresh parsley", "1 sprig fresh rosemary, chopped"], "time": 80, "instr": "Place eggplant in a colander and sprinkle with salt.\nHeat olive oil in a Dutch oven or large pot. Rinse eggplant and pat dry. Saute until slightly browned. Stir in onion and saute until transparent. Stir in garlic and saute for 2 to 3 minutes.\nStir in rice, zucchini, red bell pepper, tomatoes, wine, water, salt and red pepper flakes. Cook over medium-high heat until mixture reaches a low boil. Reduce heat and simmer for 45 minutes, or until vegetables are tender.\nRemove from heat and stir in basil, parsley and rosemary.\n", "title": "Eggplant, Zucchini and Sweet Red Pepper Stew", "urlnum": "25347"}, {"ingred": ["1/2 cup olive oil", "1/4 cup white sugar", "1 tablespoon salt", "2 cups boiling water", "2 (.25 ounce) packages active dry yeast", "1/3 cup warm water (110 degrees F/45 degrees C)", "2 eggs", "2 cups whole wheat flour", "4 cups bread flour"], "time": 80, "instr": "In a small bowl, combine olive oil, white sugar and salt. Add boiling water and stir to dissolve sugar; let cool to lukewarm.\nIn a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nWhen sugar and water mixture has cooled, add yeast mixture, eggs, whole wheat flour and 2 cups bread flour. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\nDivide the dough into twenty four equal size pieces and form into rounds. Place the rounds on lightly greased baking sheets. Cover the rolls with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until golden brown, about 15 to 20 minutes.\n", "title": "Italian Wheat Rolls", "urlnum": "25348"}, {"ingred": ["2/3 cup cornmeal", "3/4 cup all-purpose flour", "1 tablespoon baking powder", "1 teaspoon salt", "1 egg, beaten", "1 cup milk", "2 tablespoons molasses"], "time": 30, "instr": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 8x8 inch baking pan.\nIn a large bowl, stir together cornmeal, flour, baking powder and salt. In a separate bowl, stir together egg, milk and molasses. Stir egg mixture into flour mixture; mix until blended. Pour batter into prepared pan.\nBake in preheated oven for 15 to 20 minutes, until golden brown and a toothpick inserted into center of pan comes out clean.\n", "title": "Molasses Mistake Cornbread", "urlnum": "25349"}, {"ingred": ["1 pound kielbasa sausage, cut into 1 inch pieces", "1 tablespoon butter", "1 (14 ounce) can beef broth", "1 (10.75 ounce) can tomato soup", "1 1/2 cups water", "3 cups shredded cabbage", "1 onion, chopped", "1/2 cup diced green bell pepper", "1 1/2 teaspoons salt", "1/2 teaspoon ground black pepper", "1/4 cup sour cream"], "time": 60, "instr": "In a large saucepan over medium heat, cook sausage in butter until brown. Pour broth, tomato soup and water into pan with sausage. Stir in cabbage, onion and bell pepper and season with salt and pepper. Bring to a boil, then reduce heat and simmer 45 minutes, or until flavors are well blended. Stir in sour cream and heat through before serving.\n", "title": "Kielbasa Stew", "urlnum": "25677"}, {"ingred": ["2 pounds cubed beef stew meat", "3 tablespoons vegetable oil", "4 cubes beef bouillon, crumbled", "4 cups water", "1 teaspoon dried rosemary", "1 teaspoon dried parsley", "1/2 teaspoon ground black pepper", "3 large potatoes, peeled and cubed", "4 carrots, cut into 1 inch pieces", "4 stalks celery, cut into 1 inch pieces", "1 large onion, chopped", "2 teaspoons cornstarch", "2 teaspoons cold water"], "time": 140, "instr": "In a large pot or dutch oven, cook beef in oil over medium heat until brown. Dissolve bouillon in water and pour into pot. Stir in rosemary, parsley and pepper. Bring to a boil, then reduce heat, cover and simmer 1 hour.\nStir potatoes, carrots, celery, and onion into the pot. Dissolve cornstarch in 2 teaspoons cold water and stir into stew. Cover and simmer 1 hour more.\n", "title": "Beef Stew VI", "urlnum": "25678"}, {"ingred": ["1 pound cubed beef stew meat", "1 small onion, chopped", "1 pinch salt", "1/4 teaspoon ground black pepper", "3 cloves garlic, crushed", "2 (14 ounce) cans beef broth", "3 1/2 cups water", "1 cup peeled and diced tomatoes with juice", "1 potato, cubed", "2 carrots, chopped", "1/4 medium head cabbage, shredded", "1/3 cup quick-cooking barley", "1 (14.5 ounce) can great Northern beans, rinsed and drained", "1/4 teaspoon dried oregano", "1/4 teaspoon dried basil", "1/4 teaspoon dried rosemary", "1/4 teaspoon caraway seeds"], "time": 50, "instr": "Coat a large pot or Dutch oven with cooking spray. Place over medium heat and cook beef until brown. Stir in onion and cook until translucent. Drain fat. Stir in salt, pepper and garlic and cook 1 minute. Pour in beef broth, water and tomatoes. Stir in potato, carrots, cabbage, barley and beans. And season with oregano, basil, rosemary and caraway. Bring to a boil, then reduce heat and simmer 20 minutes.\n", "title": "Beef, Bean and Barley Stew", "urlnum": "25679"}, {"ingred": ["2 quarts water", "8 cubes beef bouillon, crumbled", "2 large onions, quartered and sliced", "1 teaspoon salt", "1 teaspoon coarsely ground black pepper", "3/4 cup all-purpose flour", "1/2 cup cold water", "1 cup heavy cream", "1 1/2 cups shredded Colby-Monterey Jack cheese"], "time": 120, "instr": "In a large, heavy pot over medium heat, bring 2 quarts water to a boil. Stir in bouillon cubes and let boil 10 minutes, until dissolved. Place onions in boiling water, reduce heat and simmer 30 minutes.\nStir in salt and pepper and simmer 30 minutes more.\nStir the flour into 1/2 cup cold water to make a paste. Gently whisk this mixture into the simmering soup, being careful not to break the onions. Simmer 30 minutes more.\nStir in cream and cheese until cheese is melted and mixture is thoroughly heated. Thin with water if necessary. Serve hot, garnished with croutons, if desired.\n", "title": "Outback Onion Soup", "urlnum": "25700"}, {"ingred": ["3 pounds skinless, boneless chicken breast halves", "1 cup Italian-style salad dressing", "1 (12 fluid ounce) can beer"], "time": 0, "instr": "Place chicken in a nonporous glass dish or bowl. Pour dressing over chicken and turn to coat. Cover dish and refrigerate to marinate for 3 hours.\nPreheat oven to Grill/Broil. Remove chicken from marinade and grill for about 4 minutes each side to brown.\nPlace chicken in a deep dish and pour beer over the top. Cover and refrigerate overnight (8 hours).\nUse preferred method to cook chicken on low heat.\n", "title": "Italian Beer Marinated Chicken", "urlnum": "25701"}, {"ingred": ["2 cups cauliflower florets", "1 tablespoon margarine", "1/2 cup chopped onion", "1 clove garlic, minced", "1 teaspoon Worcestershire sauce", "1 (12 fluid ounce) can or bottle beer", "1 (14.5 ounce) can chicken broth", "3 tablespoons cornstarch", "3 tablespoons water", "2 cups half-and-half cream", "2 cups shredded Cheddar cheese"], "time": 30, "instr": "In a small saucepan over medium heat, cook cauliflower in water to cover until just tender, 5 to 10 minutes. Drain and set aside.\nIn a large pot over medium heat, melt margarine. Stir in onion, garlic and Worcestershire and cook until onion is translucent. Pour in beer and bring to a boil. Pour in chicken broth and return to a boil. Then reduce heat, stir in cauliflower, and heat through.\nIn a small bowl, combine cornstarch and 3 tablespoons water, stirring to dissolve. Set aside. Stir half-and-half and Cheddar into the soup until the cheese melts. Stir in cornstarch mixture and continue to cook and stir until soup thickens. Serve at once.\n", "title": "Beer Cheese Soup IV", "urlnum": "25702"}, {"ingred": ["3/4 cup butter", "1/2 cup diced celery", "1/2 cup diced carrots", "1/2 cup diced onion", "3/4 cup all-purpose flour", "1/2 teaspoon ground dry mustard", "1 (14.5 ounce) can chicken broth", "5 ounces shredded Cheddar cheese", "5 ounces shredded Monterey Jack cheese", "1/2 cup grated Parmesan cheese", "1 (12 fluid ounce) can or bottle beer"], "time": 45, "instr": "In a large saucepan over medium high heat, melt butter. Cook celery, carrots and onion in butter until onion is translucent. Stir in flour and mustard to coat vegetables. Pour in chicken broth and simmer until slightly thickened. Puree mixture in a blender or food processor or using an immersion blender. Return to pot.\nWhen pureed mixture is hot, begin to stir in Cheddar, Monterey Jack and Parmesan, a little at a time, alternately with the beer, until all is fully incorporated and melted. Serve at once.\n", "title": "Beer Cheese Soup V", "urlnum": "25703"}, {"ingred": ["2 tablespoons butter", "1 cup chopped celery", "1 cup chopped carrots", "1 cup chopped onion", "3 (14.5 ounce) cans chicken broth", "8 ounces shredded Cheddar cheese", "1/2 cup all-purpose flour", "1/2 teaspoon prepared Dijon-style mustard", "1 (12 fluid ounce) can or bottle beer"], "time": 80, "instr": "In a medium pot over medium heat, melt butter. Cook celery, carrots and onion in butter 5 minutes. Pour in chicken broth and bring to a boil; reduce heat and simmer 20 minutes. Puree mixture in a blender or food processor or using an immersion blender. Return to pot over medium heat.\nToss Cheddar with flour and stir, a little at a time, into the pot, until fully incorporated and melted. Season with mustard. Stir in beer to achieve desired thickness just before serving.\n", "title": "Beer Cheese Soup VI", "urlnum": "25704"}, {"ingred": ["2 pounds cubed beef stew meat", "3 tablespoons all-purpose flour", "4 carrots, sliced", "2 stalks celery, sliced", "2 onions, sliced", "1 teaspoon salt", "1 teaspoon dried thyme", "1 teaspoon ground dry mustard", "1/4 teaspoon ground black pepper", "3 cubes beef bouillon, crumbled", "1 cup water", "1 cup Burgundy wine"], "time": 255, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nCook the beef on the stove over medium heat in a large, ovenproof pot or roaster until brown. Remove from heat and stir in flour until cubes are coated. Stir in carrots, celery and onions. Season with salt, thyme, mustard, pepper and bouillon. Finally, pour in water and wine. Cover.\nBake in preheated oven 4 hours. Serve hot.\n", "title": "Oven Stew with Burgundy Wine", "urlnum": "25705"}, {"ingred": ["1 pound cubed turkey breast", "1 cup minced onion", "1 tablespoon minced garlic", "2 teaspoons chili powder", "1/2 teaspoon ground cumin", "1/8 teaspoon ground cinnamon", "1 (14.5 ounce) can peeled and diced tomatoes", "1 (14 ounce) can chicken broth", "1 (15 ounce) can kidney beans", "1 (15 ounce) can pinto beans", "1 (10 ounce) package frozen corn kernels"], "time": 45, "instr": "In a large pot over medium heat, cook turkey until browned. Stir in onions, cover and cook 5 minutes.\nStir in garlic, chili powder, cumin and cinnamon and cook until fragrant, about a minute. Pour in tomatoes and bring to a boil. Stir in broth, kidney beans, pinto beans and corn and bring to a boil again. Then reduce heat and simmer 10 minutes, or until thoroughly heated.\n", "title": "Jill's Vegetable Chili", "urlnum": "25706"}, {"ingred": ["1 pound dried baby lima beans", "4 1/2 cups water", "salt and pepper to taste", "1 (15 ounce) can whole kernel corn", "1 (14.5 ounce) can peeled and diced tomatoes", "8 large potatoes, peeled and cubed", "3 cups shredded cabbage", "1 (16 ounce) container sour cream"], "time": 160, "instr": "Wash and pick through beans. Place them in a large pot with the water. Season with salt and pepper. Bring to a boil, then reduce heat and simmer, covered, 1 1/2 to 2 hours, until just tender.\nStir in undrained corn and tomatoes, potatoes and cabbage. Simmer until potatoes are tender, about 20 minutes. At the table, stir sour cream to taste into individual servings.\n", "title": "Sour Cream Vegetable Soup", "urlnum": "25707"}, {"ingred": ["1 cup butter", "2 leeks, sliced", "salt and pepper to taste", "1 quart chicken broth", "1 tablespoon cornstarch", "4 cups Yukon Gold potatoes, peeled and diced", "2 cups heavy cream"], "time": 75, "instr": "In a large pot over medium heat, melt butter. Cook leeks in butter with salt and pepper until tender, stirring frequently, about 15 minutes.\nStir cornstarch into broth and pour broth into pot. Add the potatoes and bring to a boil. Season with salt and pepper. Pour in the cream, reduce heat and simmer at least 30 minutes, until potatoes are tender. Season with salt and pepper before serving.\n", "title": "Potato Leek Soup III", "urlnum": "25708"}, {"ingred": ["1/2 cup crushed garlic", "2 tablespoons butter", "6 cups water", "1 tablespoon chicken bouillon granules", "1/4 cup chopped fresh tomato", "3 eggs, beaten", "salt and pepper to taste"], "time": 30, "instr": "In a large pot over medium heat, cook garlic in butter until brown. Pour in water and bring to a boil. Stir in bouillon granules, reduce heat and simmer a minimum of 20 minutes. Stir in tomatoes, whisk in eggs and season with salt and pepper just before serving.\n", "title": "Garlic Soup", "urlnum": "25709"}, {"ingred": ["4 skinless, boneless chicken breast halves", "1/2 teaspoon salt", "1/2 teaspoon ground black pepper", "1/2 teaspoon seasoned salt", "3 tablespoons all-purpose flour", "3 tablespoons water", "1 cup white wine", "1 cup chicken broth", "2 teaspoons chopped Italian herbs"], "time": 45, "instr": "Season chicken breasts with salt, pepper and seasoned salt. In a small bowl, combine flour and water and mix until no lumps remain and the mixture is completely smooth.\nHeat 1 tablespoon oil in a large skillet over high heat. Add chicken and brown for 3 to 4 minutes each side. Remove chicken to a plate or platter.\nDeglaze skillet with wine and broth and bring to simmer over medium low heat. When simmering, add herbs; whisk in flour mixture. Return to simmer, reduce heat to low and return chicken to skillet with juices.\nCover skillet and simmer gently for 20 to 30 minutes, or until chicken is cooked through (no longer pink inside), turning frequently.\n", "title": "Pan Sauce Chicken", "urlnum": "25710"}, {"ingred": ["4 tablespoons vegetable oil, divided", "2 onions, chopped", "4 cloves garlic, minced", "1 pound ground beef", "3/4 pound spicy Italian sausage, casing removed", "1 (14.5 ounce) can peeled and diced tomatoes with juice", "1 (12 fluid ounce) can or bottle dark beer", "1 cup strong brewed coffee", "2 (6 ounce) cans tomato paste", "1 (14 ounce) can beef broth", "1/4 cup chili powder", "1 tablespoon ground cumin", "1/4 cup brown sugar", "1 teaspoon dried oregano", "1 teaspoon cayenne pepper", "1 teaspoon ground coriander", "1 teaspoon salt", "1 tablespoon wasabi paste", "3 (15 ounce) cans kidney beans", "2 Anaheim chile peppers, chopped", "1 serrano pepper, chopped", "1 habanero pepper, sliced"], "time": 200, "instr": "Place 2 tablespoons of oil in a large pot and place the pot over medium heat. Cook and stir the onions, garlic, beef and sausage until meats are browned. Pour in the tomatoes, beer, coffee, tomato paste and broth. Season with chili powder, cumin, sugar, oregano, cayenne, coriander, salt and wasabi. Stir in one can of beans, bring to a boil, then reduce heat, cover and simmer.\nIn a large skillet over medium heat, heat remaining oil. Cook Anaheim, serrano and habanero peppers in oil until just tender, 5 to 10 minutes. Stir into the pot and simmer 2 hours.\nStir in remaining 2 cans of beans and cook 45 minutes more.\n", "title": "Washabinaros Chili", "urlnum": "25711"}, {"ingred": ["2 slices focaccia bread", "1 tablespoon herb mayonnaise", "1/8 cup shredded lettuce", "2 slices ripe tomato", "1/4 pound grilled chicken breast", "3 slices bacon", "2 tablespoons guacamole"], "time": 10, "instr": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nToast focaccia. Spread mayonnaise on one side of one slice, then top with lettuce, tomato, chicken, bacon and guacamole. Top with second slice of focaccia.\n", "title": "Pig Burger", "urlnum": "25712"}, {"ingred": ["1 1/2 pounds sweet Italian sausage", "2 cloves garlic, minced", "2 small onions, chopped", "2 (16 ounce) cans whole peeled tomatoes", "1 1/4 cups dry red wine", "5 cups beef broth", "1/2 teaspoon dried basil", "1/2 teaspoon dried oregano", "2 zucchini, sliced", "1 green bell pepper, chopped", "3 tablespoons chopped fresh parsley", "1 (16 ounce) package spinach fettuccine pasta", "salt and pepper to taste"], "time": 390, "instr": "In a large pot, cook sausage over medium heat until brown. Remove with a slotted spoon, and drain on paper towels. Drain fat from pan, reserving 3 tablespoons.\nCook garlic and onion in reserved fat for 2 to 3 minutes. Stir in tomatoes, wine, broth, basil, and oregano. Transfer to a slow cooker, and stir in sausage, zucchini, bell pepper, and parsley.\nCover, and cook on Low for 4 to 6 hours.\nBring a pot of lightly salted water to a boil. Cook pasta in boiling water until al dente, about 7 minutes. Drain water, and add pasta to the slow cooker. Simmer for a few minutes, and season with salt and pepper before serving.\n", "title": "Best Italian Sausage Soup", "urlnum": "25713"}, {"ingred": ["4 pounds chicken wings", "4 tablespoons Cajun seasoning", "1 (5 ounce) bottle hot sauce"], "time": 210, "instr": "Rinse wings in cold water and place on baking sheets. Generously sprinkle Cajun seasoning on both sides of chicken, then dash all with hot sauce (enough to cover wings, without leaking off baking sheets). Refrigerate for 3 hours.\nPreheat oven to 400 degrees F (200 degrees C).\nBake chicken in preheated oven for 20 minutes. Turn and bake for another 10 minutes, or until chicken is cooked through (juices run clear). Serve with blue cheese or ranch salad dressing, if desired.\n", "title": "Deidra's Hot Wings", "urlnum": "25714"}, {"ingred": ["1/8 cup ground almonds", "1/2 cup toasted bread crumbs", "5 cloves garlic", "sea salt to taste", "2 tablespoons olive oil", "1 tablespoon white wine vinegar", "2 cups water", "6 cubes ice", "1 pound seedless green grapes, skinned"], "time": 60, "instr": "Pound almonds, bread crumbs, garlic and salt together in a mortar to form a paste. Gradually mix in oil. Stir in vinegar. Place mixture in a soup tureen. Stir in water, ice and grapes. Let rest in a cool place 30 minutes before serving.\n", "title": "Ajo Blanco con Uvas", "urlnum": "25715"}, {"ingred": ["1/2 cup whipping cream", "1/2 cup smoked almonds", "4 grilled skinless, boneless chicken breast halves", "1/2 cup mayonnaise", "1 tablespoon minced fresh tarragon", "salt and pepper to taste"], "time": 30, "instr": "Whip cream to soft peaks. Chop almonds in food processor. Shred chicken or chop finely.\nIn a large bowl combine the cream, almonds, chicken, mayonnaise, tarragon, salt and pepper. Mix well and serve.\n", "title": "Creamy Chicken Salad", "urlnum": "25716"}, {"ingred": ["3 pounds bone-in beef shank", "2 tablespoons vegetable oil", "1 onion, chopped", "6 cups water", "1/2 pound carrots, cut into 1 inch pieces", "2 stalks celery, cut into 1 inch pieces", "1/3 medium head cabbage, shredded", "1 pound beets, peeled and shredded", "1 cup tomato juice", "1 tablespoon lemon juice", "2 teaspoons white sugar", "2 teaspoons salt", "1/8 teaspoon ground black pepper"], "time": 180, "instr": "In a large pot over medium heat, brown beef in oil. Stir in onion and water, reduce heat and simmer, covered, 2 hours, until meat is tender.\nRemove meat from broth and set aside to cool slightly. Stir carrots, celery, cabbage, beets, tomato juice, lemon juice, sugar, salt and pepper into broth. When meat is cool enough to handle, cut meat from bone and into bite-size pieces and return to soup. Simmer until vegetables are tender, 20 to 30 minutes.\n", "title": "Borscht II", "urlnum": "25717"}, {"ingred": ["3 tablespoons butter", "1 green bell pepper, finely chopped", "1/2 cup chopped celery", "1 (4.5 ounce) can mushrooms, drained", "1 small onion, chopped", "3 tablespoons all-purpose flour", "2 cups milk, divided", "2 egg yolks, beaten", "2 cups diced, cooked chicken breast meat", "1 tablespoon lemon juice", "1 tablespoon sherry", "1 teaspoon paprika", "salt and pepper to taste", "1 (8 ounce) can peas, drained", "1 (4 ounce) jar diced pimento peppers, drained"], "time": 30, "instr": "Melt butter in a large skillet over medium heat. Saute bell pepper, celery and mushrooms until soft, about 5 minutes. Stir in onion; mix flour and 1/2 cup of milk in a small bowl and stir mixture into skillet. Beat egg yolks into remaining 1 1/2 cups milk and pour into skillet. Cook, stirring, until thickened.\nAdd chicken and cook for 3 to 5 minutes, stirring constantly. Stir in lemon juice, sherry, paprika, salt and pepper. Finally, stir in peas and pimento peppers. Heat through and serve.\n", "title": "Homemade Chicken A La King", "urlnum": "25718"}, {"ingred": ["1 2/3 pounds sugar pumpkin -- peeled, seeded and cubed", "2 carrots, coarsely chopped", "2 onions, cut into wedges", "2 1/2 tablespoons vegetable oil", "1 large potato, sliced", "1 quart water", "3 cubes chicken bouillon, crumbled", "1 cup heavy cream", "1 1/4 tablespoons ground nutmeg", "1 teaspoon ground black pepper", "salt to taste"], "time": 60, "instr": "Preheat oven to 425 degrees F (220 degrees C).\nPlace pumpkin, carrots and onions in a baking dish or roasting pan. Drizzle with vegetable oil.\nBake in preheated oven 40 minutes, until soft but not blackened.\nIn a large pot over medium heat, bring water and bouillon to a boil. Cook potato in simmering water until soft, about 20 minutes.\nCombine potato and water with roasted vegetables and puree in a blender or food processor or using an immersion blender until smooth. Return to pot over low heat, and stir in cream, nutmeg, pepper and salt. Heat gently; serve.\n", "title": "Pumpkin Soup", "urlnum": "25719"}, {"ingred": ["1 tablespoon coriander seeds", "2 teaspoons cumin seeds", "2 teaspoons dried oregano", "1 tablespoon fennel seeds", "1/2 teaspoon crushed red pepper", "1/2 teaspoon salt", "1/2 teaspoon whole black peppercorns", "1 clove garlic", "2 tablespoons olive oil, divided", "1 medium sugar pumpkin", "4 orange-fleshed sweet potatoes", "1 large onion, chopped", "1 1/2 quarts chicken broth"], "time": 60, "instr": "Preheat oven to 400 degrees F (200 degrees C).\nIn a mortar or spice grinder, grind coriander, cumin, oregano, fennel, red pepper, salt and peppercorns into a coarse powder. Blend in garlic and 1 tablespoon olive oil to form a paste.\nWash pumpkin, and cut into 2-inch wide wedges, scraping away seeds. Peel potatoes and cut each potato lengthwise into 6 wedges. Smear the pumpkin and the potatoes with the spice paste and place in a baking dish.\nRoast in preheated oven 30 to 40 minutes, until tender and just beginning to blacken at the thinnest points.\nMeanwhile, in a large pot over medium heat, cook the onion in the remaining 1 tablespoon olive oil until translucent.\nChop pumpkin and potatoes into smaller chunks and puree in a blender or food processor with some of the chicken broth until smooth. Be sure to scrape the roasted spice paste off the baking dish and include it in the puree. It may be necessary to deglaze the dish with a little chicken broth.\nPour the pureed vegetables into the pot with the onions, and stir in as much additional chicken stock as needed to achieve the desired consistency. Heat through.\n", "title": "Spicy Pumpkin and Sweet Potato Soup", "urlnum": "25720"}, {"ingred": ["1/4 pound chicken gizzards, rinsed", "1/2 pound chicken livers, rinsed and trimmed", "1 tablespoon vegetable oil", "1 onion, finely chopped", "3 cloves garlic, minced", "2 cups uncooked white rice", "4 cups chicken broth", "salt to taste", "1/2 teaspoon ground black pepper", "1/4 teaspoon cayenne pepper", "1 cup thinly sliced green onions"], "time": 45, "instr": "Pulse gizzards in food processor, then pulse livers.\nHeat oil in a large saucepan. Saute onion and gizzards over medium heat, stirring constantly, until meat begins to brown (about 5 minutes). Add livers and garlic and cook, stirring constantly, until brown (about 3 minutes).\nAdd rice and stir until coated with oil. Add broth, salt, pepper and cayenne pepper. Bring to a boil, then reduce heat to simmer. Cover and cook about 20 minutes, until rice has absorbed liquid. Sprinkle with green onion and serve.\n", "title": "Southern Dirty Rice", "urlnum": "25721"}, {"ingred": ["2 pounds ground beef", "1 large onion, diced", "1 green bell pepper, diced", "2 (15 ounce) cans kidney beans, drained", "1 (46 fluid ounce) can tomato juice", "1 (28 ounce) can peeled and diced tomatoes with juice", "1/2 cup canned pumpkin puree", "1 tablespoon pumpkin pie spice", "1 tablespoon chili powder", "1/4 cup white sugar"], "time": 80, "instr": "In a large pot over medium heat, cook beef until brown; drain. Stir in onion and bell pepper and cook 5 minutes. Stir in beans, tomato juice, diced tomatoes and pumpkin puree. Season with pumpkin pie spice, chili powder and sugar. Simmer 1 hour.\n", "title": "Pumpkin Chili", "urlnum": "25722"}, {"ingred": ["1 1/2 cups uncooked white rice", "18 slices bacon", "1 (10.75 ounce) can condensed cream of mushroom soup", "1 (16 ounce) container sour cream", "1 (12 ounce) can mushrooms, drained", "6 skinless, boneless chicken breast halves"], "time": 75, "instr": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain and set aside.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace chicken in a 9x13 inch baking dish and cover each breast with 3 strips bacon. In a large bowl combine the soup, sour cream and mushrooms. Mix together and pour over chicken; spread out evenly.\nCover baking dish with aluminum foil and bake in preheated oven for 60 minutes.\n20 minutes before chicken is ready, bring 3 cups water to boil in a medium saucepan. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. When chicken is ready, serve over hot cooked rice.\n", "title": "Deluxe Sour Cream Chicken", "urlnum": "25723"}, {"ingred": ["2 tablespoons butter", "1 onion, diced", "2/3 cup red lentils", "1/2 cup orange juice", "1 stalk celery, chopped", "1/2 carrot, shredded", "1 bay leaf", "1/2 teaspoon dried thyme", "ground black pepper to taste", "3 cups chicken broth, divided"], "time": 75, "instr": "In a pot over medium heat, cook onions in butter until softened. Stir in lentils, orange juice, celery, carrot, bay leaf, thyme, pepper and half the chicken broth and simmer 40 minutes, until lentils are tender.\nPuree in a blender or food processor, or using an immersion blender. Return to the pot, stir in remaining chicken broth and heat through.\n", "title": "Orange and Lentil Soup", "urlnum": "25724"}, {"ingred": ["3 (16 ounce) cans whole peeled tomatoes", "2 tablespoons vegetable oil", "2 zucchini, cubed", "2 large onions, chopped", "2 cups sliced fresh mushrooms", "2 teaspoons salt, or to taste", "3 bay leaves", "1/2 teaspoon dried thyme", "2 teaspoons dried basil", "1/2 teaspoon ground white pepper"], "time": 45, "instr": "In a blender or food processor, puree whole tomatoes until smooth.\nIn a large pot over medium heat, cook zucchini, onions and mushrooms in oil until tender. Pour in pureed tomatoes. Season with salt, bay leaves, thyme, basil and white pepper. Bring to a boil, then reduce heat and simmer 15 minutes. Remove bay leaves before serving.\n", "title": "Garden Tomato Soup", "urlnum": "25725"}, {"ingred": ["2 pounds skinless, boneless chicken breast halves - cut into strips", "2 eggs, beaten", "1/2 cup milk", "1 (12 ounce) package tortilla chips, crushed"], "time": 30, "instr": "Preheat oven to 400 degrees F (200 degrees C).\nMix egg beat and milk in a shallow dish or bowl; place crushed chips in a separate shallow dish or bowl. Dip chicken first in egg mixture, then in crushed chips to coat. Place coated chicken on an ungreased cookie sheet.\nBake in preheated oven for 10 minutes; turn sides and bake for another 10 minutes.\n", "title": "Crunchy Chicken Fingers", "urlnum": "25726"}, {"ingred": ["2 tablespoons butter", "1 tablespoon vegetable oil", "2 onions, chopped", "1 cup water", "1 (15 ounce) can baked beans", "1 (16 ounce) can whole peeled tomatoes", "1 dash hot pepper sauce", "1 teaspoon ketchup", "salt and pepper to taste"], "time": 12, "instr": "In a small skillet over medium heat, cook onions in butter and oil until tender.\nMeanwhile, in a medium saucepan, bring water to a boil Pour beans and tomatoes into water. Stir cooked onions into mixture and simmer 5 minutes. Puree with the pepper sauce and ketchup in a blender or food processor, or using an immersion blender. Return to heat, season with salt and pepper, and heat through.\n", "title": "Tomato and Bean Soup", "urlnum": "25727"}, {"ingred": ["7 cups water", "9 cubes chicken bouillon, crumbled", "6 potatoes, cubed", "2 cloves garlic, minced", "1 large white onion, chopped", "1 bunch celery, chopped", "3 cups chopped carrots", "2 (15 ounce) cans whole kernel corn", "2 (15 ounce) cans peas", "2 cups chopped fresh green beans", "1/2 cup butter", "1/2 cup all-purpose flour", "3 cups milk", "1 pound processed cheese, cubed"], "time": 45, "instr": "In a large pot over medium heat, combine water, bouillon, potatoes and garlic. Bring to a boil, then stir in onion, celery and carrots. Reduce heat and simmer 15 minutes.\nStir in corn, peas and green beans and continue to cook on low heat.\nMeanwhile, in a medium saucepan over medium heat, melt butter. Whisk in flour all at once to form a roux and let cook 10 seconds. Whisk in milk, a little at a time, and cook, stirring, until mixture is thick and bubbly. Stir in cheese until melted. Pour this mixture into the large soup pot, stir well and heat through.\n", "title": "Cheesy Vegetable Chowder ", "urlnum": "25728"}, {"ingred": ["2 quarts chicken broth", "4 heads broccoli, chopped", "1 small onion, chopped", "2 carrots, chopped", "1 bay leaf", "1 (8 ounce) package processed cheese, cubed", "1 pint half-and-half cream"], "time": 60, "instr": "In a large pot over medium heat, combine broth, broccoli, onion, carrots and bay leaf. Bring to a boil, then reduce heat and simmer until vegetables are tender. Remove bay leaf. (At this point, you may remove the broccoli stalks, carrots and onion and puree in a food processor, then return them to the pot, if desired.)\nStir in the cheese until melted. Adjust seasonings. Stir in half-and-half and heat through.\n", "title": "Cream of Broccoli Cheese Soup II", "urlnum": "25729"}, {"ingred": ["1/2 cup butter", "1/4 cup diced celery", "1 teaspoon onion powder", "7 cups chicken broth", "4 cups chopped cauliflower", "1/2 cup chopped carrots", "1/2 cup fresh green beans, cut into 1 inch pieces", "1 pound processed cheese, cubed", "1/2 cup cooking sherry", "2 cups milk", "1 tablespoon garlic powder", "1 teaspoon salt", "2 pinches ground nutmeg", "2/3 cup cornstarch", "1 cup water"], "time": 40, "instr": "In a large pot over medium heat, melt butter. Stir in celery and onion powder and cook 5 minutes. Pour in chicken broth and stir in cauliflower, carrots and green beans. Simmer until tender, about 10 to 15 minutes.\nStir in cheese until melted. Stir in sherry, milk, garlic powder, salt, and nutmeg. Combine cornstarch and water in a bowl until cornstarch is dissolved. Stir into soup. Cook, stirring, until thickened and heated through.\n", "title": "Garden Veggie Cheese Soup", "urlnum": "25730"}, {"ingred": ["3 potatoes, peeled and cubed", "1/2 stalk celery, minced", "1 tablespoon minced onion", "1/4 carrot, grated", "2 cups chicken broth", "2 teaspoons vinegar", "1 teaspoon salt", "1 1/2 cups milk", "2 tablespoons all-purpose flour", "1 tablespoon shredded Cheddar cheese", "1 tablespoon shredded Monterey Jack cheese", "2 slices crisply cooked bacon, crumbled"], "time": 40, "instr": "In a medium saucepan over medium heat, combine potatoes, celery, onion, carrot, chicken broth, vinegar and salt. Bring to a boil, then reduce heat, cover and simmer 20 minutes.\nWhisk together milk and flour and stir into pot. Simmer uncovered until thickened, 5 to 10 minutes. Pour into 2 bowls and top with Cheddar, Monterey Jack and bacon.\n", "title": "Potato Soup XI", "urlnum": "25731"}, {"ingred": ["2 tablespoons butter", "1 cup diced onion", "2 1/2 cups peeled and diced potatoes", "3 cups chicken broth", "1 cup heavy cream", "1 3/4 cups shredded sharp Cheddar cheese", "1/4 teaspoon dried dill weed", "1/4 teaspoon ground black pepper", "1/4 teaspoon salt", "1/8 teaspoon ground cayenne pepper"], "time": 45, "instr": "In a large saucepan over medium heat, melt butter. Cook onion in butter until softened. Stir in potatoes and broth, bring to a boil, then cover, reduce heat and simmer 15 to 20 minutes, until potatoes are tender.\nPuree potato mixture in a blender or food processor or using an immersion blender; return to pot over medium heat. Stir in cream, cheese, dill, pepper, salt and cayenne. Bring to a low boil and cook, stirring, until thickened, 5 minutes.\n", "title": "Cheesiest Potato Soup", "urlnum": "25732"}, {"ingred": ["5 potatoes, peeled and cubed", "1 small carrot, finely chopped", "1/2 stalk celery, finely chopped", "1 1/2 cups water", "1 teaspoon salt", "2 1/2 cups milk", "3 tablespoons margarine, melted", "3 tablespoons all-purpose flour", "1 1/2 teaspoons steak seasoning", "1 teaspoon ground black pepper", "2 cups shredded four-cheese blend"], "time": 45, "instr": "In a large pot over medium heat, combine potatoes, carrot, celery, water and salt. Bring to a boil, then reduce heat, cover and simmer until potatoes are tender, 15 to 20 minutes. Once tender, stir in milk.\nIn a small bowl, combine melted margarine, flour, steak seasoning and pepper. Stir into soup, increase heat to medium, and cook, stirring, until thick and bubbly. Remove from heat and stir in cheese until melted. Let stand 5 to 10 minutes before serving.\n", "title": "Mandi's Cheesy Potato Soup", "urlnum": "25733"}, {"ingred": ["2 pounds spicy Portuguese sausage, sliced", "1 pound ham hocks", "1 onion, sliced", "2 quarts water", "2 carrots, diced", "3 potatoes, diced", "1 small head cabbage, chopped", "1 (8 ounce) can tomato sauce", "2 (15 ounce) cans kidney beans", "1 (16 ounce) package macaroni"], "time": 180, "instr": "In a large pot over low heat, combine sausage, ham hocks, onion and water. Cover and simmer 1 hour.\nRemove ham hock from soup, remove meat, tear into small pieces, and return meat to pot. Stir in carrots, potatoes, cabbage and tomato sauce. Cover and continue cooking 60 to 90 minutes more.\nStir in beans and pasta, adding more water as needed, and cook until heated through and pasta is tender, 10 minutes.\n", "title": "Portuguese Bean Soup II", "urlnum": "25734"}, {"ingred": ["1/2 pound dried white pea beans", "1/2 pound chorizo sausage, thinly sliced", "1 pound beef soup bones", "1 quart water", "1 medium head cabbage, chopped", "2 bunches kale - rinsed, dried and chopped", "5 potatoes, peeled and cubed", "1 quart hot water or as needed", "salt and pepper to taste"], "time": 480, "instr": "Soak beans in twice their volume of water 8 hours or overnight.\nIn a large pot, place drained beans, chorizo, soup bones and 1 quart water (or more as needed to cover). Cook over medium heat until beans are just beginning to be tender, 1 hour.\nStir in cabbage, kale, potatoes and enough hot water to cover. Cook until potatoes are tender, 20 minutes. Season with salt and pepper.\n", "title": "Portuguese Kale Soup", "urlnum": "25735"}, {"ingred": ["1/4 cup vegetable oil", "2 cups chopped onion", "1 pound smoked sausage, sliced", "1 medium head cabbage, chopped", "6 potatoes, peeled and cubed", "2 (15 ounce) cans kidney beans", "2 cups ketchup", "1 (10.5 ounce) can beef consomme", "2 2/3 quarts water", "2 teaspoons garlic powder", "2 teaspoons ground black pepper", "1 teaspoon salt", "1/2 cup vinegar"], "time": 110, "instr": "In a large pot over medium heat, cook onions in oil until just tender. Stir in sausage and cook 5 minutes more. Place cabbage, potatoes, beans, ketchup, consomme and water in the pot. Season with garlic powder, pepper and salt. Bring to a boil, then reduce heat and simmer 30 to 45 minutes.\nStir in vinegar and simmer 1 hour more. Add more water if needed.\n", "title": "Portuguese Soup", "urlnum": "25736"}, {"ingred": ["4 tablespoons olive oil, divided", "1 onion, minced", "1 clove garlic, minced", "6 potatoes, peeled and thinly sliced", "2 quarts cold water", "6 ounces linguica sausage, thinly sliced", "2 1/2 teaspoons salt", "ground black pepper to taste", "1 pound kale, rinsed and julienned"], "time": 60, "instr": "In a large saucepan over medium heat, cook onion and garlic in 3 tablespoons olive oil for 3 minutes. Stir in potatoes and cook, stirring constantly, 3 minutes more. Pour in water, bring to a boil, and let boil gently for 20 minutes, until potatoes are mushy.\nMeanwhile, in a large skillet over medium-low heat, cook sausage until it has released most of its fat, 10 minutes. Drain.\nMash potatoes or puree the potato mixture with a blender or food processor. Stir the sausage, salt and pepper into the soup and return to medium heat. Cover and simmer 5 minutes.\nJust before serving, stir kale into soup and simmer, 5 minutes, until kale is tender and jade green. Stir in the remaining tablespoon of olive oil and serve at once.\n", "title": "Caldo Verde (Portuguese Green Soup)", "urlnum": "25737"}, {"ingred": ["4 pounds tomatoes, chopped", "1/3 cup fresh basil leaves", "3 tablespoons vinegar", "2 teaspoons garlic salt", "3 cups chicken broth", "1/4 cup olive oil"], "time": 45, "instr": "In a blender or food processor, combine tomatoes, basil, vinegar and garlic salt. Puree until smooth. Transfer to a serving dish and stir in broth and olive oil. Chill in refrigerator until cold.\n", "title": "Tomato Basil Soup II", "urlnum": "25738"}, {"ingred": ["1 tablespoon olive oil", "1 clove garlic, minced", "1 (14.5 ounce) can diced tomatoes", "1 (15 ounce) can garbanzo beans, drained and rinsed", "4 cups water", "1 cube chicken bouillon, crumbled", "1 tablespoon chopped fresh rosemary", "salt and pepper to taste"], "time": 30, "instr": "In a large saucepan over medium heat, cook garlic in oil 1 minute. Stir in tomatoes and cook 2 minutes. Stir in garbanzo beans, water, bouillon cube, rosemary, salt and pepper. Simmer, covered, 10 minutes.\n", "title": "Chickpea and Tomato Soup", "urlnum": "25739"}, {"ingred": ["1 1/2 pounds pork spareribs", "3 tomatoes, diced", "1 potato, peeled and diced", "1 large carrot, diced", "1 onion, diced", "1 teaspoon salt", "5 cups water"], "time": 105, "instr": "In a deep skillet over medium heat, cook spareribs in water to cover until meat begins to fall from the bone, 1 hour. Drain.\nIn a large pot over medium heat, combine tomatoes, potato, carrot, onion, salt and 5 cups water. Place the ribs in the pot, bring to a boil, then reduce heat and simmer 20 minutes, until vegetables are soft.\n", "title": "Meat Bones Tomato Soup ", "urlnum": "25740"}, {"ingred": ["1 teaspoon olive oil", "1/2 cup chopped green bell pepper", "1/2 cup chopped onion", "1 clove garlic, minced", "1 (14.5 ounce) can diced tomatoes", "1 1/2 cups water", "1 tablespoon minced fresh basil", "1 teaspoon chicken bouillon granules", "1/4 teaspoon ground black pepper", "1 (10 ounce) package frozen chopped spinach, thawed"], "time": 25, "instr": "In a large saucepan over medium heat, cook bell pepper, onion and garlic in oil until tender. Stir in tomatoes, water, basil, bouillon and black pepper. Bring to a boil, then reduce heat and simmer 10 minutes.\nStir in spinach and cook 5 to 7 minutes more.\n", "title": "Florentine Tomato Soup", "urlnum": "25741"}, {"ingred": ["14 quarts ripe tomatoes, chopped", "7 onions, chopped", "2 stalks celery, chopped", "3 tablespoons chopped fresh parsley", "3 bay leaves", "1/4 cup salt", "3/8 cup white sugar", "2 teaspoons seasoning salt", "1 teaspoon ground black pepper", "1 teaspoon garlic salt"], "time": 240, "instr": "Place tomatoes, onions, celery, parsley and bay leaves in a large pot and cook, covered, on low heat for 1 to 2 hours, until quite soft and fragrant.\nRemove bay leaves and blend tomato mixture in batches in a food processor or blender, then run through a sieve and return juice to pot. Stir in salt, sugar, seasoning salt, pepper and garlic salt. Bring to a boil, then reduce heat and cook, uncovered, 1 to 2 hours, until thickened.\n", "title": "Tomato Soup II", "urlnum": "25742"}, {"ingred": ["1 cup macaroni", "3 cups milk", "3 tablespoons margarine", "salt and pepper to taste", "1 (14.5 ounce) can diced tomatoes"], "time": 30, "instr": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large saucepan combine cooked macaroni, milk, margarine and salt and pepper. Then stir in tomatoes. Cook over medium heat until quite hot.\n", "title": "Tomato Macaroni Soup", "urlnum": "25743"}, {"ingred": ["2 tablespoons olive oil", "2 cloves garlic, minced", "1/4 cup chopped onion", "1 (10.75 ounce) can condensed tomato soup", "1 (14.5 ounce) can diced tomatoes", "1 (6 ounce) can crabmeat", "1 pint half-and-half cream"], "time": 25, "instr": "In a large saucepan over medium heat, cook garlic and onion in oil until softened. Stir in tomato soup, tomatoes and crabmeat and heat through. Stir in half-and-half and cook until bubbly.\n", "title": "Easy Tomato Crab Soup", "urlnum": "25744"}, {"ingred": ["2 pounds tomatoes", "2 cubes beef bouillon, crumbled", "1 tablespoon white sugar", "1 teaspoon salt", "1 bay leaf", "1/4 teaspoon dried basil", "1/4 teaspoon ground black pepper", "1/2 cup butter", "1/3 cup all-purpose flour", "1 quart milk"], "time": 75, "instr": "Run the tomatoes through a food mill to remove the seeds and skins, and place in a large pot over medium heat. Stir in the bouillon, sugar, salt, bay leaf, basil and pepper. Bring to a boil, then reduce heat, and simmer 30 minutes. (If you're going to can this mixture, process it now.)\nIn a small saucepan over medium heat, melt butter. Whisk in flour all at once to form a roux, cook 1 minute. Whisk in milk, a little at a time, cooking and stirring constantly until thickened. Stir into tomato mixture and heat through.\n", "title": "Tomato Bisque II", "urlnum": "25745"}, {"ingred": ["1 tablespoon olive oil", "2 teaspoons minced garlic", "1/4 cup minced onion", "1/4 cup tomato paste", "1 quart chicken broth", "1 cup diced tomatoes", "2 teaspoons dried basil", "1/2 teaspoon dried marjoram", "1/4 teaspoon dried oregano", "1/8 teaspoon dried thyme", "1/4 cup dry white wine", "1 bay leaf"], "time": 60, "instr": "In a large saucepan over medium heat, cook garlic and onion in oil until onion is translucent. Stir in tomato paste and cook until the color is rusty. Pour in chicken broth, and stir in tomatoes, basil, marjoram, oregano, thyme, bay leaf and wine. Bring to a boil, then reduce heat and simmer 30 minutes.\n", "title": "Tomato Basil Soup I", "urlnum": "25746"}, {"ingred": ["1 tablespoon butter", "1 tablespoon olive oil", "4 large onion, thinly sliced", "1 tablespoon all-purpose flour", "2 (14 ounce) cans beef broth", "1/2 cup white wine", "1 1/2 cups water", "2 bay leaves", "6 slices French bread", "1 cup shredded Swiss cheese"], "time": 75, "instr": "In a large saucepan over low heat, melt butter with olive oil. Cook onions in mixture, stirring occasionally, for 30 minutes, until very soft, translucent and brown on the edges.\nSprinkle the flour over the onions and stir to combine. Pour in beef broth, wine and water with bay leaves. Bring to a boil, then reduce heat and simmer, uncovered, 20 to 30 minutes.\nPreheat oven broiler.\nToast the bread slices. Ladle the soup into 6 ovenproof bowls and place the bowls on a baking sheet. Place a toasted slice of bread over each bowl and top with Swiss cheese.\nPlace bowls under broiler until cheese is melted.\n", "title": "French Onion Soup VIII", "urlnum": "25747"}, {"ingred": ["2 tablespoons butter", "2 pounds yellow onions, halved and sliced 1/2 inch thick", "4 (14 ounce) cans beef broth", "1 (10.5 ounce) can beef consomme", "1/4 cup grated Romano cheese", "salt and pepper to taste", "8 slices French bread, toasted", "1/2 cup shredded Gruyere cheese"], "time": 35, "instr": "In a large pot over low heat, melt butter. Cook onions in butter until soft and golden brown, 15 to 30 minutes.\nPour in beef broth and consomme and simmer 10 minutes.\nPreheat oven broiler.\nWhisk Romano into soup and season with salt and pepper. Pour soup into 8 ovenproof bowls. Top with toasted slices of bread and grated Gruyere.\nPlace bowls under broiler until cheese melts.\n", "title": "French Onion Soup IX", "urlnum": "25748"}, {"ingred": ["1/4 cup extra virgin olive oil", "4 pounds onions", "2 teaspoons white sugar", "salt to taste", "1 (750 milliliter) bottle dry white wine", "1 quart chicken broth", "1 small cinnamon stick", "4 cups cubed, stale French or Italian bread"], "time": 195, "instr": "In a large heavy pot, heat oil over medium heat. Cut onions in half lengthwise, then slice thinly. Place sliced onions in pot and toss to coat with oil. Cover, reduce heat to medium-low, and cook, stirring occasionally, until onions are softened and beginning to color, 30 minutes.\nIncrease heat to medium and cook, stirring occasionally, uncovered, until onions are amber in color, 45 minutes.\nSprinkle onions with sugar and a little bit of salt; cook, stirring, until sugar melts and onions are caramel colored, 5 minutes. Pour in wine and broth, and place cinnamon stick in pot. Bring to a boil, then reduce heat, cover and simmer 1 hour.\nStir the bread into the soup and cook, uncovered, stirring occasionally until the bread disintegrates, 30 to 45 minutes.\nRemove the cinnamon stick. Whisk the soup to incorporate the bread. Adjust seasoning. Serve hot.\n", "title": "Florentine Caramelized Onion Soup", "urlnum": "25749"}, {"ingred": ["5 1/4 cups vegetable broth, divided", "4 onions, sliced", "1/8 teaspoon white sugar", "2 tablespoons all-purpose flour", "1/2 cup dry white wine", "1 bay leaf", "1/2 teaspoon ground thyme", "1/2 teaspoon ground black pepper", "1 tablespoon brandy", "4 slices French bread, toasted", "1 clove garlic, halved", "2 tablespoons grated fat-free Parmesan cheese"], "time": 70, "instr": "In a large non-stick saucepan, heat 1/4 cup vegetable broth. Stir in the onion and cook over medium heat until golden, 15 minutes.\nStir in the sugar and flour. Pour in the remaining 5 cups vegetable broth and the wine. Stir in the bay leaf, thyme and black pepper. Bring to a boil and let boil 8 minutes, stirring constantly; then reduce heat, partly cover, and simmer 30 minutes.\nPreheat oven broiler.\nRemove from heat, remove bay leaf and stir in brandy. Rub garlic clove over toast. Ladle the soup into 4 ovenproof bowls and float a piece of toast on top of each bowl. Sprinkle with the Parmesan.\nPlace bowls under broiler until cheese melts.\n", "title": "French Onion Soup X", "urlnum": "25750"}, {"ingred": ["5 1/4 cups vegetable broth, divided", "4 onions, sliced", "1/8 teaspoon white sugar", "2 tablespoons all-purpose flour", "1/2 cup dry white wine", "1 bay leaf", "1/2 teaspoon ground thyme", "1/2 teaspoon ground black pepper", "1 tablespoon brandy", "4 slices French bread, toasted", "1 clove garlic, halved", "2 tablespoons grated fat-free Parmesan cheese"], "time": 70, "instr": "In a large non-stick saucepan, heat 1/4 cup vegetable broth. Stir in the onion and cook over medium heat until golden, 15 minutes.\nStir in the sugar and flour. Pour in the remaining 5 cups vegetable broth and the wine. Stir in the bay leaf, thyme and black pepper. Bring to a boil and let boil 8 minutes, stirring constantly; then reduce heat, partly cover, and simmer 30 minutes.\nPreheat oven broiler.\nRemove from heat, remove bay leaf and stir in brandy. Rub garlic clove over toast. Ladle the soup into 4 ovenproof bowls and float a piece of toast on top of each bowl. Sprinkle with the Parmesan.\nPlace bowls under broiler until cheese melts.\n", "title": "French Onion Soup X", "urlnum": "25750"}, {"ingred": ["1/3 cup butter", "10 onions, peeled and thinly sliced", "2 cloves garlic, crushed", "1 (12 fluid ounce) can or bottle beer", "1 quart beef broth", "1/2 teaspoon dry mustard", "1 teaspoon dried thyme", "1/4 teaspoon ground black pepper", "1 bay leaf", "6 slices French bread, toasted", "3 cups shredded Gruyere cheese"], "time": 70, "instr": "In a large saucepan over medium heat, melt butter. Stir and cook onions in butter until golden brown, 15 minutes.\nStir in the garlic and cook 1 minute. Pour in the beer and beef broth and season with mustard, thyme, black pepper and the bay leaf. Bring to a boil, then reduce heat, cover and simmer 30 minutes.\nPreheat oven to 425 degrees F (220 degrees C).\nRemove bay leaf from soup and ladle soup into a large casserole or individual ovenproof bowls, leaving about 1 inch of room at the top of the dish or dishes. Float slices of toasted bread on the soup and pile generously with Gruyere.\nBake in preheated oven 10 minutes, until cheese is lightly browned and bubbly.\n", "title": "French Onion Soup XI", "urlnum": "25751"}, {"ingred": ["1 (14.5 ounce) can diced tomatoes", "1 (15 ounce) can tomato sauce", "1 1/2 quarts water", "1/4 cup diced onion", "1 pound boneless chicken breast halves, cooked and cubed", "1 (16.5 ounce) can red beans, drained and rinsed", "1 cup chopped broccoli", "1 cup diced carrots", "1 teaspoon salt", "1/2 teaspoon ground black pepper", "1/2 teaspoon Cajun seasoning", "1 pinch garlic powder"], "time": 30, "instr": "In a large saucepan over medium-high heat, combine diced tomatoes, tomato sauce, water and onion. Bring to a boil, then stir in cooked chicken, beans, broccoli, carrots, salt, pepper, Cajun seasoning and garlic powder. Let boil 5 minutes, then reduce heat and simmer 20 minutes more.\n", "title": "Hobart's Chicken and Red Bean Soup", "urlnum": "25752"}, {"ingred": ["3 1/2 cups water", "3 tablespoons denjang (Korean bean curd paste)", "1 tablespoon garlic paste", "1/2 tablespoon dashi granules", "1/2 tablespoon gochujang (Korean hot pepper paste)", "1 zucchini, cubed", "1 potato, peeled and cubed", "1/4 pound fresh mushrooms, quartered", "1 onion, chopped", "1 (12 ounce) package soft tofu, sliced"], "time": 35, "instr": "In a large saucepan over medium heat, combine water, denjang, garlic paste, dashi and gochujang. Bring to a boil and let boil 2 minutes. Stir in zucchini, potato, mushrooms and onions and let boil 5 to 7 minutes more. Stir in tofu and cook until tofu has expanded and vegetables are tender.\n", "title": "Korean Bean Curd (Miso) Soup", "urlnum": "25753"}, {"ingred": ["2 tablespoons vegetable oil", "1 onion, chopped", "1 green bell pepper, chopped", "1 yellow bell pepper, chopped", "2 (14.5 ounce) cans chicken broth", "1 (10 ounce) can diced tomatoes with green chile peppers", "2 (15 ounce) cans black beans, drained", "1 (15 ounce) can pinto beans, drained", "2 (15 ounce) cans kidney beans, drained"], "time": 30, "instr": "In a large saucepan over medium heat, cook onion, green and yellow bell peppers in oil until softened. Stir in chicken broth, tomatoes, black beans, pinto beans and kidney beans. Heat through.\n", "title": "Three Bean Soup", "urlnum": "25754"}, {"ingred": ["1 pound lean ground beef", "1 1/2 cups chopped onion", "1 cup chopped green bell pepper", "1 teaspoon minced garlic", "1 (15 ounce) can kidney beans, drained and rinsed", "1 (15 ounce) can pinto beans, drained and rinsed", "3 (14.5 ounce) cans diced tomatoes with green chile peppers", "2 tablespoons brown sugar", "1 tablespoon unsweetened cocoa powder", "2 tablespoons chili powder", "1 teaspoon ground cumin"], "time": 45, "instr": "Coat a large saucepan with cooking spray and place over medium heat. Cook beef in pan until browned, 5 to 8 minutes. Stir in onions, bell pepper and garlic and cook 5 minutes more.\nStir in kidney beans, pinto beans and tomatoes. Season with brown sugar, cocoa powder, chili powder and cumin. Bring to a boil, then reduce heat, cover and simmer 20 to 30 minutes. (To make in a slow cooker, simply transfer beef mixture to a slow cooker, stir in remaining ingredients, cover and cook on low 5 to 6 hours.)\n", "title": "Best Bean Chili", "urlnum": "25755"}, {"ingred": ["1 head broccoli, chopped", "1 pinch salt", "1 (8 ounce) package spaghettini", "1/4 cup olive oil", "freshly ground black pepper to taste"], "time": 25, "instr": "Bring a large pot of water to a boil. Stir in broccoli and salt and cook until just tender. Break up spaghettini and stir into the pot. Cook 8 to 10 minutes more, until pasta is al dente. Serve in bowls topped with a tablespoon of olive and some freshly ground pepper.\n", "title": "Broccoli Spaghetti Soup", "urlnum": "25756"}, {"ingred": ["3 cups water", "1 (3 ounce) package chicken flavored ramen noodles", "2 cups chopped cooked chicken breast", "2 leaves bok choy, sliced", "1 carrot, sliced", "1 teaspoon sesame oil"], "time": 30, "instr": "In a large saucepan, bring water to a boil. Break up block of noodles and stir into pot, reserving seasoning packet. Stir in chicken, bok choy and carrot. Bring to a boil again, then reduce heat and simmer 3 minutes. Stir in contents of seasoning packet and sesame oil.\n", "title": "Angela's Oriental Chicken Noodle Soup", "urlnum": "25757"}, {"ingred": ["12 shallots, thinly sliced", "1/4 cup vegetable oil", "6 ounces egg noodles", "1 cup bean sprouts", "3 quarts chicken broth", "3 cups shredded, cooked chicken breast meat", "1/2 cup chopped green onion", "salt and pepper to taste"], "time": 30, "instr": "In a small skillet over medium heat, cook shallots in oil until brown and fragrant. Remove from heat and set aside.\nBring a large pot of water to a boil. Cook noodles in boiling water until just tender, 8 to 10 minutes; drain and rinse under cold water. Set aside.\nBring a small pot of water to a boil; have ready a bowl of ice water. Blanch bean sprouts by plunging them into boiling water for 1 minute, then into cold water. Drain and set aside.\nIn a large saucepan over medium heat, bring chicken broth to a simmer.\nDivide noodles evenly between 6 bowls. Top with bean sprouts and shredded chicken. Pour the heated broth into the bowls. Drizzle with the shallot mixture and garnish with the green onion. Season with salt and pepper. Serve at once.\n", "title": "Chicken Noodle Soup III", "urlnum": "25758"}, {"ingred": ["3 tablespoons vegetable oil", "2 onions, diced", "6 stalks celery, diced", "6 carrot, diced", "3/4 tablespoon chopped fresh rosemary", "3/4 tablespoon chopped fresh tarragon", "3/4 tablespoon chopped fresh thyme", "3/4 tablespoon chopped Italian flat leaf parsley", "4 quarts low-fat, low sodium chicken broth", "3 1/2 cups cubed skinless, boneless chicken breast meat", "1 (16 ounce) package egg noodles", "salt and pepper to taste"], "time": 80, "instr": "In a large skillet over medium heat, cook onions in oil until translucent. Stir in celery, carrot, rosemary, tarragon, thyme and parsley and cook, covered, until vegetables are soft, 5 to 10 minutes.\nTransfer vegetable mixture to a large pot and pour in chicken broth. Simmer over low heat, covered, for 30 minutes.\nStir in chicken breast pieces and egg noodles and simmer, covered, 30 minutes more. Season with salt and pepper.\n", "title": "Steve's Chicken Noodle Soup", "urlnum": "25759"}, {"ingred": ["2 teaspoons vegetable oil", "1 onion, chopped", "2 cloves garlic, minced", "1 tablespoon minced fresh ginger root", "1 pinch crushed red pepper", "2 quarts chicken broth", "1 cup peeled, diagonally sliced carrots", "1 cup diagonally sliced celery", "2 cups snow peas", "12 ounces fresh shrimp, peeled and deveined", "4 ounces rice vermicelli", "2 tablespoons soy sauce", "1/4 teaspoon ground black pepper"], "time": 30, "instr": "In a large saucepan over medium heat cook onion, garlic, ginger and crushed red pepper in oil for 2 minutes. Pour in broth, carrots and celery and bring to a boil. Reduce heat, cover and simmer 5 minutes. Stir in snow peas and shrimp, cover and cook 3 minutes. Break noodles into 2 inch pieces and stir in to soup; cover and cook 3 minutes more, until vegetables are tender and shrimp is pink. Stir in soy sauce and pepper and serve.\n", "title": "Oriental Shrimp Noodle Soup", "urlnum": "25760"}, {"ingred": ["1/2 cup butter", "1 cup light brown sugar", "1 egg", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1/2 cup chopped pecans", "1/8 cup sour cream", "1/4 cup brown sugar"], "time": 45, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the butter and 1 cup brown sugar until smooth. Beat in the egg and stir in the vanilla. Combine the flour, baking soda and salt; stir into the sugar mixture. Roll the dough into 1 inch balls and place them 2 inches apart onto the prepared cookie sheets. Make a depression in the center using the cap from the vanilla or the end of a wooden spoon. Mix together the pecans, sour cream and 1/4 cup brown sugar; fill each depression with the mixture.\nBake for 8 to 11 minutes in the preheated oven, or until light brown. Cool for a few minutes on the cookie sheets before removing to wire racks to cool completely.\n", "title": "Pecan Filled Cookies", "urlnum": "25761"}, {"ingred": ["2 cups butter, softened", "1 cup white sugar", "1 egg", "2 teaspoons vanilla extract", "1 teaspoon almond extract", "3 cups sifted all-purpose flour", "1 cup cornstarch"], "time": 35, "instr": "Preheat the oven to 400 degrees F (200 degrees C).\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the egg, then stir in the vanilla and almond extracts. Combine the flour and cornstarch; stir into the creamed mixture until well blended. Fill cookie press and press out dough onto ungreased cookie sheets.\nBake for 8 to 10 minutes in the preheated oven, until edges are golden. Remove from baking sheets to cool on wire racks.\n", "title": "Spritz Cookies V", "urlnum": "25762"}, {"ingred": ["3/4 cup shortening", "1 cup packed brown sugar", "1/2 cup applesauce", "1 egg", "2 1/4 cups all-purpose flour", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "3/4 teaspoon ground cinnamon", "1/4 teaspoon ground cloves", "1/2 cup chopped raisins", "1/2 cup chopped walnuts"], "time": 60, "instr": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, mix together the shortening, brown sugar, applesauce and egg until smooth, Combine the flour, baking soda, salt, cinnamon and cloves; stir into the applesauce mixture. Drop dough by rounded teaspoons onto ungreased cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Applesauce Raisin Cookies II", "urlnum": "25763"}, {"ingred": ["10 cups flaked coconut", "2 cups all-purpose flour", "1/2 teaspoon salt", "2 2/3 cups sweetened condensed milk", "4 teaspoons vanilla extract", "1 1/2 cups semisweet chocolate chips", "1 tablespoon milk"], "time": 30, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, stir together the coconut, flour and salt. Stir in the sweetened condensed milk and vanilla until everything is well blended. Drop by heaping spoonfuls onto the prepared pan.\nBake for 12 to 15 minutes in the preheated oven, until coconut is sufficiently toasted. Immediately remove from cookie sheets to cool on wire racks.\nIn the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips and milk, stirring frequently until smooth. Remove from heat and set aside to cool. Dip cooled cookies halfway into the chocolate and scrape off excess onto the side of the bowl. Place onto waxed paper until set.\n", "title": "Easy Chocolate Covered Coconut Macaroons", "urlnum": "25764"}, {"ingred": ["4 cups toasted oat cereal", "2 cups crispy rice cereal", "2 cups dry-roasted peanuts", "2 cups candy-coated milk chocolate pieces", "1 cup light corn syrup", "1 cup white sugar", "1 1/2 cups creamy peanut butter", "1 teaspoon vanilla extract"], "time": 15, "instr": "In a large bowl, toss together the toasted oat cereal, rice cereal, peanuts and chocolate pieces; set aside. Grease a 10x15 inch jellyroll pan.\nIn a medium saucepan over medium heat, stir together the corn syrup and sugar. Bring the mixture to a boil and cook until sugar is completely dissolved. Remove from heat and quickly stir into the peanut butter and vanilla. Pour the mixture into the bowl with the cereal mixture and mix well. Press into the prepared pan. Let stand until set. Cut into bars and serve.\n", "title": "No Bake Cereal Bars", "urlnum": "25765"}, {"ingred": ["1 cup butter", "1 3/4 cups white sugar", "2 eggs", "3 cups all-purpose flour", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/4 teaspoon ground nutmeg", "1 teaspoon vanilla extract"], "time": 53, "instr": "In a medium bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking soda, salt and nutmeg; stir into the creamed mixture. Knead dough for a few turnns on a floured board until smooth. Cover and refrigerate until firm.\nPreheat the oven to 325 degrees F (165 degrees C). On a lightly floured surface, roll the dough out to 1/4 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Grandma's Old Fashioned Tea Cakes", "urlnum": "25766"}, {"ingred": ["1 1/2 cups all-purpose flour", "3/4 cup unsweetened cocoa powder", "1 1/4 teaspoons baking powder", "1/8 teaspoon salt", "3/4 cup butter, softened", "1 1/4 cups white sugar", "1 egg"], "time": 150, "instr": "Sift together the flour, cocoa, baking powder and salt; set aside. In a medium bowl, cream together the butter and sugar until smooth. Beat in the egg. Gradually stir in the sifted ingredients to form a soft dough. Divide dough into 2 pieces, flatten and wrap in plastic wrap. Refrigerate for 2 hours.\nPreheat the oven to 375 degrees F (190 degrees C). On a lightly floured surface, roll the dough out to 1/8 inch in thickness. Cut into desired shapes with cookie cutters. Dough is sticky so be sure to add more flour to the rolling surface as needed. Place cookies 1 1/2 inches apart onto cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Best Ever Chocolate Cutout Cookies", "urlnum": "25767"}, {"ingred": ["1 tablespoon active dry yeast", "1 tablespoon instant coffee granules", "1/4 cup unsweetened cocoa powder", "3 cups all-purpose flour", "1/3 cup white sugar", "1/2 cup ricotta cheese", "1/4 cup unsalted butter", "2 eggs", "1/3 cup milk, scalded and cooled", "1/4 cup chocolate hazelnut spread", "1/2 cup chopped pecans", "1/2 cup semisweet chocolate chips", "3/4 cup heavy cream", "9 ounces semisweet chocolate, chopped"], "time": 300, "instr": "Place the yeast, instant coffee, cocoa, four, sugar, ricotta cheese, butter, eggs, milk and chocolate hazelnut spread into the bread machine in the order suggested by the manufacturer. Set the machine for DOUGH and press the START button. At the beep- or at the end of the second knead, add the chocolate chips and pecans.\nGrease a large baking sheet. Form the dough into two thick logs about 3 1/2 inches wide and 12 inches long. Cover and let rise until double, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Bake biscotti for 40 to 45 minutes, until edges begin to brown. Cool on wire racks. Using a sharp serrated knife, slice the logs into 1/2 inch wide slices. Lay the slices cut side down on the baking sheet. Bake for 5 minutes, turn and bake 5 minutes more, until dry. Do not brown.\nWhen the biscotti are completely cool, make the chocolate dip. In a small saucepan, heat cream until scalding hot but not boiling. Remove from heat and stir in the semisweet chocolate until smooth. Allow to cool slightly. Dip biscotti halfway into the chocolate and set onto waxed paper to dry. Store in an airtight container. Do not refrigerate. These will keep for several weeks.\n", "title": "Chocolate Pecan Biscotti", "urlnum": "25768"}, {"ingred": ["1/4 cup butter, melted", "1/3 cup unsweetened cocoa powder", "1 cup white sugar", "2 eggs", "1 teaspoon vanilla extract", "1 cup all-purpose flour", "1 teaspoon baking soda", "1/4 teaspoon salt", "1/4 cup confectioners' sugar for rolling"], "time": 160, "instr": "In a medium bowl, mix together the butter and cocoa until smooth. Beat in the sugar, eggs and vanilla until well blended. Combine the flour, baking soda and salt; gradually blend into the chocolate mixture to form a dough. Cover dough and chill for at least 2 hours or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Roll dough into 1 inch balls and roll the balls in the confectioners' sugar. Place cookies 3 inches apart onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, until the tops of the cookies have cracked. remove from baking sheets to cool on wire racks.\n", "title": "Chocolate Blossoms", "urlnum": "25769"}, {"ingred": ["1/2 cup flaked coconut", "1 cup milk", "1/2 cup white sugar", "1 1/2 tablespoons cornstarch", "3 cups all-purpose flour", "2 tablespoons unsweetened cocoa powder", "1 teaspoon baking soda", "2 teaspoons cream of tartar", "1/2 teaspoon salt", "1/2 cup butter, softened", "1 cup white sugar", "1 teaspoon vanilla extract", "1 egg, beaten", "1 cup milk"], "time": 35, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Prepare the filling first. In a 2 quart saucepan, over medium heat, stir together the milk and coconut. Combine the cornstarch and 1/2 cup of sugar; stir into the saucepan. Bring to a simmer and cook, stirring constantly until thickened. Remove from heat and set aside to cool.\nSift together the flour, cocoa, baking soda, cream of tartar and salt; set aside. In a medium bowl, cream together the butter, 1 cup sugar and vanilla until smooth. Stir in the egg and milk. Gradually mix in the sifted ingredients to form a dough. On a lightly floured surface, roll the dough out to 1/4 inch in thickness. Cut into 2 1/2 inch circles with a cookie cutter. Place half of the circles 1 1/2 inches apart onto the prepared cookie sheets. Spoon about 1 teaspoon of the filling onto the center of each cookie on the pan. Top with another circle and seal the edges by pinching.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Chocolate Coconut Mound Cookies", "urlnum": "25770"}, {"ingred": ["1 cup all-purpose flour", "1 teaspoon baking powder", "1/2 cup butter, melted", "2 (1 ounce) squares semisweet chocolate, chopped", "1 cup white sugar", "2 eggs", "1 teaspoon vanilla extract", "1 cup semisweet chocolate chips", "1/4 cup confectioners' sugar for rolling"], "time": 132, "instr": "Sift together the flour and baking powder; set aside. In a medium bowl, stir chocolate into melted butter until melted and smooth. Mix in the sugar, eggs and vanilla. Gradually blend in the sifted ingredients. Stir in the chocolate chips. Cover dough and chill for at least 2 hours or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets or line them with parchment paper. Roll the chilled dough into 1 inch balls and roll each ball in confectioners' sugar. Place cookies 2 inches apart onto the prepared cookie sheets.\nBake for 9 to 12 minutes in the preheated oven, until the tops are cracked. Remove from cookie sheets to cool on wire racks.\n", "title": "Chocolate Crinkle Cookies", "urlnum": "25771"}, {"ingred": ["1 cup butter, softened", "1 cup white sugar", "1 cup brown sugar", "2 eggs", "2 teaspoons vanilla extract", "8 drops food coloring", "3/4 cup chocolate hazelnut spread", "2 3/4 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon baking soda", "3/4 cup semisweet chocolate chips"], "time": 30, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the butter, white sugar and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla and food coloring. Mix in the chocolate hazelnut spread. Combine the flour, baking powder, and baking soda; stir into the sugar mixture until just blended. Fold in chocolate chips. Drop dough by spoonfuls 2 inches apart onto the prepared cookie sheets. These cookies spread.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Chocolate Fudgy Cookies", "urlnum": "25772"}, {"ingred": ["1 cup butter, softened", "1 cup brown sugar", "1/2 cup white sugar", "2 eggs", "1/2 teaspoon vanilla extract", "1 3/4 cups all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 teaspoon ground cinnamon", "2 1/2 cups rolled oats", "2 cups semisweet chocolate chips"], "time": 45, "instr": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13 inch baking pan with aluminum foil.\nIn a medium bowl, cream together the butter, brown sugar and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking soda, salt and cinnamon; gradually blend into the creamed mixture. Stir in the oats. Press the dough into the bottom of the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, until firm and lightly toasted at the edges. Melt chocolate chips in the microwave or in a metal bowl over a pan of simmering water, stirring frequently until smooth. Spread over bars. Cool completely before cutting into squares.\n", "title": "Oatmeal Chocolate Goodness Bars", "urlnum": "25773"}, {"ingred": ["1 cup semisweet chocolate chips", "3/4 cup shortening", "1/2 cup white sugar", "3 eggs", "1 teaspoon vanilla extract", "1 cup all-purpose flour", "1 teaspoon baking powder", "1/4 teaspoon salt", "1/2 teaspoon ground cinnamon", "1 (8 ounce) can crushed pineapple, drained"], "time": 55, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9 inch square pan. In the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, stirring frequently until smooth. Set aside.\nCream together the shortening and sugar until smooth. Beat in the eggs one at a time then stir in the vanilla. Combine the flour, baking powder, salt and cinnamon; blend into the creamed mixture. Divide batter into separate bowls. Mix the melted chocolate into one half and the drained crushed pineapple to the other. Spread the chocolate batter evenly into the prepared pan, then spread the pineapple batter over the top of that.\nBake for 30 to 35 minutes in the preheated oven. Cool in the pan on a wire rack.\n", "title": "Chocolate Pineapple Squares", "urlnum": "25774"}, {"ingred": ["1 1/2 cups quick-cooking oats", "3/4 cup all-purpose flour", "1/4 teaspoon baking soda", "3/4 cup packed brown sugar", "1/2 cup shortening"], "time": 15, "instr": "In a medium bowl, stir together the oats, flour, baking soda and brown sugar. Cut in the shortening until the mixture resembles cornmeal. There should be no lumps of shortening left. Measure 1/2 cup of the mixture into re-sealable bags or containers for storage. Label and date each bag. This mix can be stored in a cool dry place for up to 12 weeks.\nTo make the cookies, empty one package of the mix into a bowl. Stir in 2 teaspoons of water, 1 tablespoon of raisins and 1 tablespoon of mini semisweet chocolate chips. Mix well and shape teaspoonfuls of dough into small balls. Place balls on an ungreased cookie sheet and flatten with the buttered bottom of a glass dipped in sugar. Follow you oven's instructions for baking.\n", "title": "Easy Bake Oven Cookie Mix", "urlnum": "25775"}, {"ingred": ["1 (19.8 ounce) package brownie mix", "1 (3.9 ounce) package instant chocolate pudding mix", "3/8 cup vegetable oil", "3 eggs"], "time": 30, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, stir together the brownie mix and dry instant pudding. Add the oil and eggs; mix until well blended. Roll the dough into walnut sized balls. Place the cookies 2 inches apart onto the cookie sheet.\nBake for 6 to 10 minutes in the preheated oven, until firm. I think they are best if removed when the middle is still soft. Cool on cookie sheets for 1 minute before removing to wire racks.\n", "title": "Easy Chocolate Cookies", "urlnum": "25776"}, {"ingred": ["1 1/4 cups all-purpose flour", "1/2 cup unsweetened cocoa powder", "1/2 teaspoon salt", "1/4 cup sliced almonds", "1/4 cup butter, softened", "2/3 cup white sugar", "1 egg, beaten", "1/2 teaspoon vanilla extract"], "time": 15, "instr": "Preheat oven to 350 degrees F (175 degrees C). Turn a 9x5 inch loaf pan or metal bowl upside down and cover the outside with foil. Place onto a cookie sheet.\nStir together the flour, cocoa, salt and almonds; set aside. In a medium bowl, cream together the butter and sugar until smooth. Beat in the egg and vanilla. Gradually stir in the dry ingredients to form a fairly stiff dough. On a lightly floured surface, roll the dough out to 1/4 inch in thickness. Cut into circles using a glass or cookie cutter. Starting at the top (bottom) of the pan or bowl, arrange cookies so they are overlapping. Work toward the edges covering as much of the pan as you can. Be sure to press each cookie on so you will have a good solid bowl.\nBake for 10 to 15 minutes in the preheated oven, until cookies are firm. Cool completely. Carefully turn the pan over and remove the pan from the foil, then carefully remove the foil from inside the cookie structure. Fill with cookie or candy.\n", "title": "Cookie Bowl", "urlnum": "25777"}, {"ingred": ["1/2 cup butter", "1/2 cup brown sugar", "2 tablespoons unsweetened cocoa powder", "1 egg, beaten", "1 teaspoon vanilla extract", "1/2 cup chopped walnuts", "15 arrowroot biscuits, crushed"], "time": 10, "instr": "Butter an 8x8 inch baking dish.\nIn a saucepan over medium heat, melt together the butter, brown sugar and cocoa, stirring frequently until smooth. Remove from heat and stir in the egg and vanilla. Mix in the crushed cookies and walnuts. Press the mixture into the prepared pan and refrigerate until firm.\n", "title": "Chocolate Squares II", "urlnum": "25778"}, {"ingred": ["1/2 cup butter, softened", "1 cup white sugar", "1 egg", "1/4 cup milk", "1 teaspoon vanilla extract", "1 3/4 cups all-purpose flour", "1/3 cup unsweetened cocoa powder", "1/2 teaspoon baking soda", "18 large marshmallows, halved", "1 cup white sugar", "1/2 cup unsweetened cocoa powder", "1/4 cup milk", "1 teaspoon vanilla extract", "1/4 cup butter", "18 pecan halves"], "time": 20, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together 1/2 cup butter and 1 cup sugar until smooth. Beat in the egg, then stir in the 1/4 cup milk and vanilla. Combine the flour, 1/3 cup cocoa and baking soda; stir into the creamed mixture. Drop by heaping teaspoonfuls onto the prepared cookie sheet.\nBake for 8 minutes in the preheated oven. Remove cookie sheet and press marshmallow halves into the center of each cookie cut side down. Return the cookies to the oven for an additional 2 minutes. Remove from the oven and press lightly on the cookies to flatten slightly. Remove cookies to wire racks to cool.\nTo make the icing: In a small saucepan over medium heat, combine 1 cup sugar, 1/2 cup cocoa, 1/4 cup milk, 1 teaspoon vanilla and 1/4 cup butter. Bring the mixture to a boil, stirring occasionally, and let boil for 1 minute. Brush the cookies with the frosting then top each one with a pecan half before the icing sets.\n", "title": "Chocolate Surprise", "urlnum": "25779"}, {"ingred": ["1 (18.25 ounce) package German chocolate cake mix", "2 eggs, beaten", "2/3 cup shortening", "1 (16 ounce) container prepared coconut pecan frosting"], "time": 20, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, stir together the cake mix, eggs and shortening until well blended. Roll the dough into walnut sized balls. Place the cookies 2 inches apart onto the cookie sheet.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. Match up evenly sized cookies and sandwich them with the coconut pecan frosting.\n", "title": "German Chocolate Cake Cookies", "urlnum": "25780"}, {"ingred": ["1 cup butter, softened", "1/2 cup brown sugar", "1 cup white sugar", "1 teaspoon orange extract", "2 eggs", "2 1/2 cups all-purpose flour", "1/2 teaspoon baking soda", "1/4 teaspoon salt", "1 teaspoon ground cinnamon", "2 cups semisweet chocolate chips", "1 cup miniature marshmallows, frozen"], "time": 30, "instr": "Preheat the oven to 300 degrees F (150 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter, brown sugar and white sugar until smooth. Beat in the eggs, one at a time then stir in the orange extract. Combine the flour, baking soda, salt and cinnamon; stir into the sugar mixture. Fold in the chocolate chips and frozen marshmallows. Drop dough by heaping spoonfuls onto the prepared cookie sheet.\nBake for 20 to 22 minutes in the preheated oven. Remove from cookie sheets to cool on wire racks.\n", "title": "Gooey Marshmallow Chocolate Chip Cinnamon Cookies", "urlnum": "25781"}, {"ingred": ["2/3 cup butter, melted", "2 cups quick-cooking oats", "2/3 cup all-purpose flour", "1/4 teaspoon salt", "1 cup white sugar", "1/4 cup corn syrup", "1/4 cup milk", "1 teaspoon vanilla extract", "2 cups milk chocolate chips"], "time": 45, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Line 2 cookie sheets with aluminum foil and grease the foil.\nIn a large skillet over medium heat, melt the butter. Stir together the oats, flour, salt and sugar; mix into the melted butter until well blended. Stir in the corn syrup, milk and vanilla. Drop batter by teaspoonfuls 3 inches apart onto the prepared cookie sheets.\nBake for 5 to 7 minutes in the preheated oven, until medium brown. Cool completely before removing from the cookie sheets. In the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, stirring frequently until smooth. Remove from heat. Spread chocolate onto the bottoms of cookies and sandwich them together.\n", "title": "Milk Chocolate Florentine Cookies", "urlnum": "25782"}, {"ingred": ["1 cup shortening", "1 cup white sugar", "1/2 cup brown sugar", "1/2 cup honey", "2 eggs", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "1/2 cup crispy rice cereal", "1/2 cup rolled oats", "1 cup jumbo semisweet chocolate chips", "1 cup milk chocolate chips"], "time": 35, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the shortening, white sugar, brown sugar and honey until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking soda and salt; stir into the creamed mixture. Using a wooden spoon, stir in the oats, cereal, jumbo chocolate chips and milk chocolate chips. Drop by heaping teaspoonfuls onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven, until golden. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Yummy Chocolate Chip Cookies", "urlnum": "25783"}, {"ingred": ["1/2 cup butter, softened", "1/2 cup peanut butter", "1 cup packed brown sugar", "1/2 cup white sugar", "3 eggs", "1 teaspoon vanilla extract", "1/3 cup water", "1 1/2 cups all-purpose flour", "1 cup powdered protein supplement", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 1/3 cups semisweet chocolate chips"], "time": 20, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the butter, peanut butter, brown sugar and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla and water. Combine the flour, protein powder, baking soda and salt; stir into the creamed mixture. Fold in chocolate chips. Drop dough by heaping spoonfuls onto un-greased cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Protein Peanut Butter Chocolate Chip Cookies", "urlnum": "25784"}, {"ingred": ["1/2 cup applesauce", "2 eggs", "1 tablespoon soybean oil", "1 (18.25 ounce) package chocolate fudge cake mix", "1/2 cup peanut butter chips", "1/2 cup semisweet chocolate chips", "1/2 cup chopped pecans"], "time": 30, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the applesauce, eggs and oil until well blended. Stir in the cake mix. Mix in the peanut butter chips, chocolate chips and pecans. Drop by spoonfuls or roll into balls and place 2 inches apart onto unprepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Peanut Butter Chocolate Chip Cookies IV", "urlnum": "25785"}, {"ingred": ["2 eggs, beaten", "1 cup white sugar", "1 cup chopped dates", "1 teaspoon vanilla extract", "1 tablespoon butter", "3 cups crispy rice cereal", "1 cup flaked coconut"], "time": 25, "instr": "In a medium saucepan over medium heat, combine the eggs sugar and dates. Bring to a boil, stirring occasionally, and boil for 5 minutes. Remove from heat and stir in the butter and vanilla. Mix in crispy rice cereal. Butter hands and roll the mixture into walnut sized balls. Roll the balls in coconut. Serve.\n", "title": "Coconut Date Balls", "urlnum": "25786"}, {"ingred": ["2/3 cup all-purpose flour", "5 1/2 cups flaked coconut", "1/4 teaspoon salt", "1 (14 ounce) can sweetened condensed milk", "2 teaspoons vanilla extract"], "time": 25, "instr": "Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper or aluminum foil.\nIn a large bowl, stir together the flour, coconut and salt. Stir in the sweetened condensed milk and vanilla using your hands until well blended. Use an ice cream scoop to drop dough onto the prepared cookie sheets. Cookies should be about golf ball size.\nBake for 12 to 15 minutes in the preheated oven, until coconut is toasted.\n", "title": "Coconut Macaroons III", "urlnum": "25787"}, {"ingred": ["1/2 cup white sugar", "1/2 cup brown sugar", "1 cup corn syrup", "1 cup peanut butter", "6 cups cornflakes cereal", "1 cup roasted Spanish peanuts", "4 (1.5 ounce) bars milk chocolate candy bars"], "time": 50, "instr": "In a medium saucepan over medium high heat, combine the white sugar, brown sugar and corn syrup. Bring the mixture to a rapid boil, then remove from heat. Stir in the peanut butter until well blended. In a large bowl, stir together the cornflakes and peanuts. Stir the peanut butter mixture into the cornflake mixture and mix until evenly distributed. Press the mixture into a greased 9x13 inch pan.\nIn the microwave or in a metal bowl over a pan of simmering water, melt chocolate candy, stirring frequently until smooth. Remove from heat and spread over the tops of the bars. Let cool before cutting into bars.\n", "title": "Babe Ruth Bars II", "urlnum": "25788"}, {"ingred": ["1/2 cup shortening", "1 cup white sugar", "1/2 cup milk", "1 teaspoon vanilla extract", "1 1/2 cups all-purpose flour", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 very ripe banana, mashed", "1 teaspoon lemon juice", "1/2 cup chopped walnuts", "2 tablespoons butter, melted", "1 teaspoon vanilla extract", "2 cups confectioners' sugar", "1/2 ripe banana", "1/2 teaspoon salt", "1/4 teaspoon lemon juice"], "time": 45, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, cream together the shortening and sugar until smooth. Stir in the milk and 1 teaspoon vanilla. Combine the flour, baking soda and 1/2 teaspoon salt; stir into the sugar mixture. Mix in 1 banana, 1 teaspoon lemon juice and walnuts. Spread evenly into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, until a toothpick inserted into the center comes out clean. Let bars cool in the pan on a wire rack.\nTo make the frosting: In a medium bowl, mix together the melted butter, 1 teaspoon vanilla, confectioners' sugar, 1/2 banana, 1/2 teaspoon of salt and 1/4 teaspoon lemon juice using an electric mixer. Beat until smooth. Spread over cooled bars and then cut into squares.\n", "title": "Banana Bars", "urlnum": "25789"}, {"ingred": ["1 cup brown sugar", "1/2 cup white sugar", "1 cup margarine, melted", "4 cups rolled oats", "2 cups semisweet chocolate chips", "3/4 cup peanut butter"], "time": 22, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the brown sugar, white sugar, melted margarine and oats until well blended. Mix in the chocolate chips. Press the mixture into a 9x9 inch pan.\nBake for 12 to 15 minutes in the preheated oven. Spread peanut butter over the top of the bars and let cool until set. Cut into squares and serve.\n", "title": "Butter Finger Bars", "urlnum": "25790"}, {"ingred": ["2 tablespoons butter", "1 cup white sugar", "1/4 teaspoon salt", "1/3 cup half-and-half cream", "1 cup miniature marshmallows", "1 cup cherry baking chips", "1 cup semisweet chocolate chips", "1/2 cup peanut butter", "1 cup roasted Spanish peanuts"], "time": 60, "instr": "Line an 8x8 or 9x9 inch square pan with waxed paper.\nIn a medium saucepan, combine butter, sugar, salt and half and half. Heat until boiling, stirring occasionally. Boil for 5 minutes, stirring enough to keep from scorching. Remove from heat and stir in the marshmallows, and cherry chips. Press the mixture into the prepared pan.\nIn the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, and peanut butter together stirring frequently until smooth. Spread over the mixture in the pan. Refrigerate for 2 hours before cutting into squares.\n", "title": "Cherry Mash Bars", "urlnum": "25791"}, {"ingred": ["1 1/2 cups butter, melted", "4 cups graham cracker crumbs", "6 (1.5 ounce) bars milk chocolate candy bars", "2 cups miniature marshmallows"], "time": 30, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, mix together the melted butter and graham cracker crumbs. Press half of the graham cracker mixture into the bottom of the prepared pan. In the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, stirring frequently until smooth. Remove from heat and spread over the graham cracker layer. For easier spreading, refrigerate the crust while the chocolate is melting. Make a layer of marshmallows over the chocolate and top with the remaining graham cracker crumbs.\nBake for 15 minutes in the preheated oven, cool and cut into squares.\n", "title": "S'More Bars II", "urlnum": "25792"}, {"ingred": ["CRUST:", "1 (18.25 ounce) package yellow cake mix", "1 egg, beaten", "1/2 cup butter, softened", "CENTER:", "2 cups semisweet chocolate chips", "TOPPING:", "1 (8 ounce) package cream cheese, softened", "1 (16 ounce) package confectioners' sugar", "3 eggs, beaten", "1 teaspoon vanilla extract"], "time": 75, "instr": "Preheat the oven to 300 degrees F (150 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, mix together the cake mix, 1 egg and butter until well blended. The batter will be stiff. Crumble and press into the prepared pan. Sprinkle chocolate chips evenly over, and press them into the crust slightly.\nFor the topping, beat the cream cheese, confectioners' sugar, 3 eggs and vanilla in a medium bowl using an electric mixer until light and fluffy. Spread over the chocolate chip layer.\nBake for 45 to 50 minutes, or until golden brown. Cool completely before cutting into squares.\n", "title": "Cream Cheese Chocolate Chip Bars", "urlnum": "25793"}, {"ingred": ["3 cups quick-cooking oats", "1 (14 ounce) can sweetened condensed milk", "2 tablespoons butter, melted", "1 cup flaked coconut", "1 cup sliced almonds", "1 cup miniature semisweet chocolate chips", "1/2 cup sweetened dried cranberries"], "time": 35, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a large bowl, mix together the oats, sweetened condensed milk, butter, coconut, almonds, chocolate chips and cranberries with your hands until well blended. Press flat into the prepared pan.\nBake for 20 to 25 minutes in the preheated oven, depending on how crunchy you want them. Lightly browned just around the edges will give you moist, chewy bars. Let cool for 5 minutes, cut into squares then let cool completely before serving.\n", "title": "Easy Granola Bars", "urlnum": "25794"}, {"ingred": ["1 1/2 cups all-purpose flour", "2/3 cup brown sugar", "1/4 teaspoon baking soda", "1/2 teaspoon salt", "1/2 teaspoon vanilla extract", "1/2 cup butter, softened", "2 egg yolks", "3 cups miniature marshmallows", "2/3 cup light corn syrup", "2 cups peanut butter chips", "2 teaspoons vanilla extract", "1/4 cup butter", "2 cups dry-roasted peanuts", "2 cups crispy rice cereal"], "time": 60, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, stir together the flour, brown sugar, baking soda and salt. Mix in the vanilla, butter and egg yolks until the mixture resembles fine crumbs. Press into the bottom of the prepared pan.\nBake for 15 minutes in the preheated oven, or until lightly toasted. Remove from the oven and sprinkle mini marshmallows evenly over the hot crust. Let stand while the topping is being made.\nIn a medium saucepan over medium heat, melt corn syrup and peanut butter chips, stirring frequently until smooth. Remove from heat and stir in rice cereal and peanuts. Immediately spread over the layer of marshmallows. Cut while still slightly warm.\n", "title": "Pay Check Bars", "urlnum": "25795"}, {"ingred": ["2 cups all-purpose flour", "1/4 cup white sugar", "1/2 teaspoon salt", "3/4 cup butter", "1/3 cup corn syrup", "2 (8 ounce) packages cream cheese, softened", "3 eggs", "1 cup corn syrup", "2 teaspoons vanilla extract", "3/4 cup peach preserves"], "time": 65, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl mix together the flour sugar and salt. Cut in the butter until the mixture is fine and crumbly. Stir in 1/3 cup corn syrup until a dough forms. Press into the bottom of the prepared pan.\nIn another bowl, beat cream cheese and eggs using an electric mixer, until smooth and creamy. Mix in 1 cup corn syrup and vanilla until well blended. Spread evenly over the crust.\nBake for 35 to 40 minutes in the preheated oven, until the edges are light brown. Remove from the oven and spread peach preserves over the hot filling immediately. Chill for at least 3 hours before cutting into small squares.\n", "title": "Peach Cheesecake Bars", "urlnum": "25796"}, {"ingred": ["2 cups all-purpose flour", "2 cups rolled oats", "1 1/2 cups brown sugar", "1/2 teaspoon salt", "1 teaspoon baking soda", "1 1/2 cups butter, melted", "2 cups semisweet chocolate chips", "1 (12 ounce) jar caramel ice cream topping", "6 tablespoons all-purpose flour"], "time": 50, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a large bowl, stir together 2 cups flour, oats, brown sugar, salt and baking soda. Mix in melted butter until evenly distributed. Press half of the mixture into the bottom of the prepared pan.\nBake for 10 minutes in the preheated oven, until lightly toasted. Remove from the oven and immediately sprinkle with chocolate chips. Let stand. In a small bowl, mix the caramel topping with the remaining flour; drizzle evenly over the chocolate chips. Sprinkle the remaining crust mixture evenly over the caramel layer and press down lightly.\nBake for 15 more minutes in the preheated oven. Allow to cool completely before cutting into squares.\n", "title": "Granny Mabel's Best Bar Cookies", "urlnum": "25797"}, {"ingred": ["3/4 cup butter, softened", "1 cup packed light brown sugar", "1 1/2 cups rolled oats", "1 1/2 cups all-purpose flour", "1 teaspoon salt", "1/2 teaspoon baking powder", "1 (10 ounce) jar raspberry preserves"], "time": 55, "instr": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 9x13 inch pan.\nIn a large bowl, cream together the butter and brown sugar until smooth. Combine the oats, flour, salt and baking powder; stir into the creamed mixture. Press half of the mixture into the bottom of the prepared pan. Spread the preserves over the crust. Crumble the remaining crust mixture over the raspberry layer.\nBake for 20 to 25 minutes in the preheated oven, or until light brown. Cool completely before cutting into bars.\n", "title": "Raspberry Oat Bars", "urlnum": "25798"}, {"ingred": ["1/2 cup butter, softened", "1/2 cup superfine sugar", "1 grated zest of one orange", "1/2 cup corn oil", "2 1/2 cups all-purpose flour", "1 1/2 cups semolina", "4 teaspoons baking powder", "1 teaspoon ground cinnamon", "1 teaspoon ground cloves", "1/2 cup orange juice", "1 cup water", "1 cup white sugar", "1/2 cup honey", "1 cinnamon stick", "2 teaspoons lemon juice", "1/2 cup finely chopped walnuts"], "time": 70, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter, superfine sugar and orange zest. Gradually mix in the oil and beat until light and fluffy. Combine the flour, semolina, baking powder, cinnamon and cloves; beat into the fluffy mixture alternately with the orange juice. As the mixture thickens, turn out onto a floured board and knead into a firm dough. Pinch off tablespoonfuls of dough and form them into balls or ovals. Place cookies 2 inches apart onto the prepared cookie sheets.\nBake for 25 minutes in the preheated oven, or until golden. Cool on baking sheets until room temperature.\nTo make the syrup: In a medium saucepan, over medium heat, combine the water, white sugar, honey, cinnamon stick and lemon juice. Bring to a boil and boil for 10 minutes. Remove the cinnamon stick. While the mixture is boiling hot, dip the cookies in one at a time, making sure to cover them completely. Place them on a wire rack to dry and sprinkle with walnuts. Place paper under the rack to catch the drips. Keep finished cookies in a sealed container at room temperature.\n", "title": "Finikia", "urlnum": "25799"}, {"ingred": ["6 cups all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon baking powder", "1 1/2 teaspoons salt", "4 teaspoons ground ginger", "4 teaspoons ground cinnamon", "1 1/2 teaspoons ground cloves", "1 teaspoon ground black pepper", "1 cup unsalted butter, softened", "1 cup packed brown sugar", "2 eggs", "1 cup unsulfured molasses"], "time": 113, "instr": "Sift together the flour, baking soda, baking powder, salt, ginger, cinnamon, cloves, and black pepper; set aside. In a large bowl, or stand mixer with the paddle attachment, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the molasses. Gradually mix in the sifted ingredients. Divide the dough into thirds and wrap in plastic wrap. Refrigerate for at least one hour.\nPreheat oven to 350 degrees F (175 degrees C).\nOn a lightly floured surface, roll the dough out to 1/8 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto cookie sheets.\nBake for 8 to 10 minutes in the preheated oven, until cookies are crisp but not dark. Remove to wire racks to cool completely. Decorate as desired.\n", "title": "Basic Gingersnap Cookies", "urlnum": "25800"}, {"ingred": ["6 cups all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon baking powder", "1 1/2 teaspoons salt", "4 teaspoons ground ginger", "4 teaspoons ground cinnamon", "1 1/2 teaspoons ground cloves", "1 teaspoon ground black pepper", "1 cup unsalted butter, softened", "1 cup packed brown sugar", "2 eggs", "1 cup unsulfured molasses"], "time": 113, "instr": "Sift together the flour, baking soda, baking powder, salt, ginger, cinnamon, cloves, and black pepper; set aside. In a large bowl, or stand mixer with the paddle attachment, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the molasses. Gradually mix in the sifted ingredients. Divide the dough into thirds and wrap in plastic wrap. Refrigerate for at least one hour.\nPreheat oven to 350 degrees F (175 degrees C).\nOn a lightly floured surface, roll the dough out to 1/8 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto cookie sheets.\nBake for 8 to 10 minutes in the preheated oven, until cookies are crisp but not dark. Remove to wire racks to cool completely. Decorate as desired.\n", "title": "Basic Gingersnap Cookies", "urlnum": "25800"}, {"ingred": ["1/2 cup butter, room temperature", "2 cups packed brown sugar", "3 eggs", "1/2 teaspoon vanilla extract", "3 1/2 cups all-purpose flour", "1/2 teaspoon baking soda", "1 teaspoon cream of tartar", "1/2 teaspoon salt", "1 cup chopped walnuts"], "time": 500, "instr": "In a large bowl, cream together butter and brown sugar until smooth. Beat in the eggs one at a time then stir in the vanilla. Sift together the flour, baking soda, cream of tartar and salt; blend into the creamed mixture. Mix in the walnuts. Form dough into long roll about 2 inches in diameter. Wrap in waxed paper and refrigerate overnight.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease cookie sheets or line with parchment paper. Unwrap the roll of dough and using a sharp knife, slice the roll into 1/4 inch coins. Place cookies 2 inches apart onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Remove from cookie sheets to cool on wire racks.\n", "title": "Caramel Cookies", "urlnum": "25801"}, {"ingred": ["2 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 cup butter, softened", "2 cups brown sugar", "2 eggs", "1 teaspoon vanilla extract", "4 cups high protein crisp rice and wheat cereal", "1 cup flaked coconut", "1 cup chopped walnuts", "1/2 cup raisins"], "time": 30, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Sift together the flour, baking powder, baking soda and salt; set aside.\nIn a large bowl, cream together the butter and brown sugar until smooth. Beat in the eggs one at a time then stir in the vanilla. Blend in the sifted ingredients until just incorporated. Mix in the cereal, coconut, walnuts and raisins. Drop by tablespoonfuls onto ungreased cookie sheets. Cookies should be at least 2 inches apart.\nBake for 9 to 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Special Cookies", "urlnum": "25802"}, {"ingred": ["1/2 cup butter, softened", "1 cup brown sugar", "2 eggs", "1 (8 ounce) can crushed pineapple, drained", "3/4 cup shredded carrots", "1 cup raisins", "2 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "2 tablespoons ground cinnamon", "1 cup chopped walnuts (optional)"], "time": 30, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets or line with parchment paper.\nIn a large bowl, cream together the butter and brown sugar until smooth. Beat in the eggs one at a time, stir in the crushed pineapple, carrots and raisins. Combine the flour, baking powder, baking soda, salt and cinnamon; stir into the carrot mixture. Mix in the walnuts if desired. Drop by rounded spoonfuls onto the prepared cookie sheets.\nBake for 15 to 20 minutes in the preheated oven, until bottoms begin to brown and cookies are set. Allow cookies to cool for a few minutes on the cookie sheets before removing to wire racks to cool completely.\n", "title": "Carrot Cake Cookies", "urlnum": "25803"}, {"ingred": ["2 egg whites", "1 cup white sugar", "2 cups high protein crisp rice and wheat cereal", "1 cup flaked coconut", "1 teaspoon vanilla extract"], "time": 45, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets or line with parchment paper.\nIn a clean and dry glass or metal bowl, beat egg whites until soft peaks form. Gradually add sugar while continuing to whip until stiff peaks form. Fold in cereal, coconut and vanilla. Drop by heaping spoonfuls onto the prepared cookie sheets.\nBake for 15 to 20 minutes in the preheated oven, until firm. Allow to cool completely before removing from cookie sheets.\n", "title": "Chewy Cereal Cookies", "urlnum": "25804"}, {"ingred": ["2 quarts vegetable oil for frying", "1 cup water", "1/2 cup margarine", "1 cup all-purpose flour", "1/4 teaspoon salt", "3 eggs", "1/4 cup white sugar", "1/4 teaspoon ground cinnamon"], "time": 160, "instr": "In a heavy deep skillet or deep-fryer, heat oil to 360 degrees F (180 degrees C). Oil should be about 1 1/2 inches deep.\nIn a medium saucepan, heat water and margarine to a rolling boil. Combine the flour and salt; stir into the boiling mixture. Reduce heat to low and stir vigorously until the mixture forms a ball, about 1 minute. Remove from heat and beat in the eggs one at a time. Spoon the mixture into a pastry bag fitted with a large star tip.\nCarefully squeeze out 4 inch long strips of dough directly into the hot oil. Fry 3 or 4 strips at once, until golden brown, about 2 minutes on each side. Remove from hot oil to drain on paper towels. Stir together the sugar and cinnamon; roll churros in the mixture while still hot.\n", "title": "Churros II", "urlnum": "25805"}, {"ingred": ["1/2 cup canola oil", "1/2 cup margarine", "1 cup brown sugar", "1 cup white sugar", "2 eggs", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 1/2 cups cornflakes cereal", "1 cup rolled oats", "1 cup semisweet chocolate chips", "1/2 cup chopped walnuts"], "time": 30, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Lightly grease cookie sheets.\nIn a large bowl, mix together the canola oil, margarine, brown sugar and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking soda, baking powder and salt; stir into the sugar mixture. Mix in the cornflakes cereal, oats, chocolate chips and walnuts. Drop by heaping teaspoonfuls onto the prepared cookie sheets.\nBake for 12 to 15 minutes in the preheated oven, until golden brown. Allow cookies to cool slightly on the cookie sheets before removing to wire racks to cool completely.\n", "title": "Corn Flake Cookies II", "urlnum": "25806"}, {"ingred": ["1/2 cup butter flavored shortening", "1/2 cup white sugar", "1/2 cup brown sugar", "1 egg", "1 teaspoon vanilla extract", "2 1/4 cups all-purpose flour", "1/3 cup unsweetened cocoa powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 3/4 cups grated zucchini"], "time": 25, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the shortening, white sugar and brown sugar until smooth. Beat in the egg and vanilla. Combine the flour, cocoa, baking soda and salt; gradually stir into the creamed mixture. Fold in the grated zucchini. Drop by rounded spoonfuls onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Chocolate Zucchini Cookies", "urlnum": "25807"}, {"ingred": ["4 (1 ounce) squares unsweetened chocolate, chopped", "1 cup semisweet chocolate chips", "6 tablespoons butter", "3 eggs", "1 cup white sugar", "1 1/2 teaspoons vanilla extract", "1/2 cup all-purpose flour", "2 tablespoons unsweetened cocoa powder", "1/4 teaspoon baking powder", "1/4 teaspoon salt", "1 cup semisweet chocolate chips"], "time": 120, "instr": "In the microwave or in a metal bowl over a pan of simmering water, melt unsweetened chocolate, 1 cup of the chocolate chips, and the butter stirring occasionally until smooth. Remove from heat and set aside to cool. In a large bowl, whip eggs and sugar until thick and pale, about 2 minutes. Stir in the vanilla and the chocolate mixture until well mixed. Combine the flour, cocoa, baking powder and salt; gradually stir into the chocolate mixture. Fold in remaining 1 cup chocolate chips. Cover dough and chill for at least an hour or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Roll chilled dough into 1 inch balls. Place on ungreased cookie sheets so they are 2 inches apart.\nBake for 9 to 11 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Chocolate Truffle Cookies", "urlnum": "25808"}, {"ingred": ["1 1/2 teaspoons active dry yeast", "1/4 cup warm milk", "2 cups all-purpose flour", "2 tablespoons white sugar", "1/2 teaspoon salt", "3/4 cup butter", "2 eggs, beaten", "1 (15 ounce) container ricotta cheese", "1/4 cup white sugar", "2 egg whites, stiffly beaten", "1 cup chopped red and green candied cherries", "1/4 cup chopped walnuts", "1/2 cup semisweet chocolate chips"], "time": 0, "instr": "Place warm milk in a small bow and sprinkle the yeast over the top; stir and set aside. In a large bowl, stir together the flour, 2 tablespoons sugar and salt. Cut in the butter until lumps are no larger than peas. Stir in the yeast mixture and eggs to form a dough. Shape dough into a ball, place in a greased bowl, cover and refrigerate overnight.\nPreheat the oven to 300 degrees F (150 degrees C). Divide dough into 2 pieces. Roll each piece out into a 10 inch square. Cut into 14 strips. Wrap each strip in an overlapping spiral around the length of a greased wooden clothes pin. You can roll the pastry in sugar at this point if you like. Place covered clothes pins 2 inches apart onto ungreased cookie sheets.\nBake for 20 minutes in the preheated oven, until golden brown. Carefully remove clothespins while cookies are still warm and place cookies on a wire rack to cool completely.\nTo make the filling: In a medium bowl, stir together the ricotta cheese and 1/4 cup of white sugar. Fold in the beaten egg whites until evenly distributed. Gently fold in the candied cherries, walnuts and chocolate chips. Spoon into a pastry bag fitted with a large tip and pipe the filling into the cookies. Serve immediately after filling..\n", "title": "Clothespin Cookies III", "urlnum": "25809"}, {"ingred": ["1 cup honey", "1/4 cup dark molasses", "1 tablespoon ground cinnamon", "1/4 teaspoon ground nutmeg", "1 1/2 teaspoons ground cloves", "2 tablespoons chopped candied orange peel", "2 tablespoons chopped candied citron", "1 cup chopped blanched almonds", "1 cup brown sugar", "1 teaspoon lemon zest", "1 1/2 teaspoons orange zest", "1/2 teaspoon baking soda", "2 teaspoons hot water", "1 egg, beaten", "4 1/2 cups all-purpose flour"], "time": 0, "instr": "In a large bowl, stir together the honey, molasses, cinnamon, nutmeg and cloves until well blended. Mix in the candied orange peel, citron, almonds, brown sugar, orange and lemon zests. Stir the baking soda into the hot water, then beat into the mixture along with the egg. Gradually mix in the flour. The dough should be very stiff, you may need to knead it on the counter to get it thoroughly blended. Cover and chill overnight so the flavors can ripen.\nPreheat oven to 350 degrees F (175 degrees C). On a lightly floured surface, roll the dough out to 1/2 inch thickness. Cut into bars about 2 inches long and 3/4 inch wide. Place cookies 1 inch apart onto ungreased cookie sheets.\nBake for 12 to 15 minutes in the preheated oven, until the bottoms are only starting to brown. Remove cookies to cool on wire racks. Ice them with a thin confectioners glaze while they are still warm, if you like. When cool, store in a tightly closed container. If you want soft cookies, put half an apple in the container for several days.\n", "title": "Lebkuchen V", "urlnum": "25810"}, {"ingred": ["1/2 cup honey", "1/2 cup molasses", "3/4 cup packed brown sugar", "1 egg", "1 tablespoon lemon juice", "1 teaspoon lemon zest", "2 3/4 cups all-purpose flour", "1/2 teaspoon baking soda", "1 teaspoon ground cinnamon", "1 teaspoon ground cloves", "1 teaspoon ground allspice", "1 teaspoon ground nutmeg", "1/3 cup diced candied citron", "1/3 cup chopped hazelnuts", "1 cup white sugar", "1/2 cup water", "1/4 cup confectioners' sugar"], "time": 600, "instr": "In a medium saucepan, stir together the honey and molasses. Bring the mixture to a boil, remove from heat and stir in the brown sugar, egg, lemon juice and lemon zest. In a large bowl, stir together the flour, baking soda, cinnamon, cloves, allspice and nutmeg. Add the molasses mixture to the dry ingredients and mix well. Stir in the citron and hazelnuts. Cover dough and chill overnight.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Using a small amount of dough at a time, roll out on a lightly floured surface to 1/4 inch thickness. Cut into small rectangles and place them 1 inch apart onto the prepared cookie sheet.\nBake for 10 to 12 minutes in the preheated oven, until no imprint remains when touched lightly. Brush the icing over the cookies while they are still hot and quickly remove them to wire cooling racks. Store in airtight container with a cup of orange or apple for a few days to mellow.\nTo make the icing: Combine the sugar and water in a small saucepan. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Remove from heat and stir in the confectioners' sugar. If icing becomes sugary while brushing cookies, re-heat slightly- adding a little water until crystals dissolve.\n", "title": "Lebkuchen VI", "urlnum": "25811"}, {"ingred": ["10 graham crackers, crushed", "1 cup raisins", "1 cup chopped pitted dates", "1/2 cup honey", "1/2 cup finely chopped almonds"], "time": 15, "instr": "In a medium bowl, mix together the graham cracker crumbs, raisins, dates and honey until well blended. Roll into 1 inch balls and roll the balls in chopped almonds.\n", "title": "Easiest Cracker Cookies", "urlnum": "25812"}, {"ingred": ["1 1/4 cups all-purpose flour", "1 cup quick-cooking oats", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/3 cup butter, softened", "3/4 cup packed brown sugar", "1/2 cup peanut butter", "1/4 cup buttermilk", "1/3 cup miniature semisweet chocolate chips"], "time": 20, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Stir together the flour, oats, baking soda and salt; set aside.\nIn a medium bowl, cream together butter and brown sugar until smooth. Stir in the peanut butter and buttermilk. Gradually mix in the dry ingredients, then fold in chocolate chips. Roll dough into walnut-sized balls and place them 2 inches apart onto the prepared cookie sheets. Use a fork dipped in flour to flatten the balls slightly.\nBake for 8 to 10 minutes in the preheated oven, until lightly brown at the edges. Remove from cookie sheets to cool on wire racks.\n", "title": "Cookies for Rookies", "urlnum": "25813"}, {"ingred": ["2/3 cup butter, softened", "1 cup white sugar", "2 eggs", "1/2 teaspoon baking soda", "1/4 cup hot water", "1 1/2 cups chopped pitted dates", "1 1/2 cups golden raisins", "1 2/3 cups all-purpose flour", "1 teaspoon ground cinnamon", "1 cup chopped walnuts"], "time": 30, "instr": "Preheat the oven to 400 degrees F (200 degrees C). In a small bowl, dissolve baking soda in hot water. Stir in the dates and raisins; set aside.\nIn a medium bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the date and raisin mixture. Combine the flour and cinnamon; mix into the batter until just blended. Finally stir in the walnuts. Drop dough by tablespoonfuls onto the prepared cookie sheet. Cookies should be at least 1 inch apart.\nBake for 8 to 10 minutes in the preheated oven, or until lightly browned. Allow cookies to cool on baking sheet for 2 minutes before removing to a wire rack to cool completely.\n", "title": "Australian Federation Biscuits", "urlnum": "25814"}, {"ingred": ["5 (1 ounce) squares semisweet chocolate, chopped", "1 cup butter, softened", "1 1/2 cups white sugar", "4 eggs", "2 teaspoons vanilla extract", "1/2 cup peanut butter", "4 cups all-purpose flour", "2 teaspoons baking soda", "2 teaspoons baking powder", "1 teaspoon salt", "1 (3.9 ounce) package instant chocolate pudding mix", "2 cups rolled oats", "2 cups chopped peanut butter cups"], "time": 30, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. In the microwave or in a metal bowl over a pan of simmering water, melt the semisweet chocolate, stirring frequently until smooth. Remove from heat and set aside to cool slightly.\nIn a large bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Mix in the melted chocolate and peanut butter. Sift together the flour, baking soda, baking powder, salt and instant pudding mix; gradually blend into the peanut butter mixture. Stir in the oats and chopped peanut butter cups. Drop by heaping spoonfuls onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Good Cookies II", "urlnum": "25815"}, {"ingred": ["1 (3 ounce) package cream cheese", "1/2 cup butter", "1 cup all-purpose flour", "1 egg", "1 tablespoon butter", "1 teaspoon vanilla extract", "1 cup brown sugar", "3/4 cup chopped walnuts"], "time": 60, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Line mini muffin pans with paper liners.\nIn a medium bowl, stir together the cream cheese, 1/2 cup butter and flour until a dough forms. Roll into 1 inch balls and press them into the bottom and up the sides of the prepared muffin cups.\nIn a small bowl, blend together the egg, butter, vanilla and brown sugar until smooth. Stir in walnuts. Spoon the mixture into the muffin cups, but do not fill all the way to the top or the mixture will bubble over.\nBake for 15 to 20 minutes in the preheated oven, until the crusts are golden.\n", "title": "Walnut Cups", "urlnum": "25816"}, {"ingred": ["1 (18.25 ounce) package white cake mix", "1/3 cup brown sugar", "1 egg", "1/3 cup milk", "1 cup butterscotch chips"], "time": 35, "instr": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, stir together the cake mix and brown sugar. Add egg and milk; mix until well blended. Stir in the butterscotch chips. Spread the dough evenly into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, until brownies pull away form the edge of the pan slightly. Cool in the pan on a wire rack then cut into bars.\n", "title": "White Brownies", "urlnum": "25817"}, {"ingred": ["1 cup unsalted butter, softened", "1 cup white sugar", "1 egg", "1 egg yolk", "1 teaspoon vanilla extract", "1 teaspoon almond extract", "1 5/8 cups all-purpose flour", "1 teaspoon baking powder", "1/4 teaspoon salt", "6 (1 ounce) squares semisweet chocolate, chopped", "2 tablespoons butter", "1 tablespoon milk"], "time": 40, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together unsalted butter and sugar. Beat in the egg and egg yolk one at a time, then stir in the vanilla and almond extracts. Combine the flour, baking powder and salt; gradually stir into the sugar mixture until smoothly blended. Fill a large pastry bag fitted with a 3/4 inch round tip. A large freezer storage bag with one of the corners snipped off will also work.\nPipe dough into 2 inch long logs using a side to side squiggle motion. Space cookies at least 2 inches apart. Place cookie sheets with cookies into the freezer for a couple of minutes to harden.\nBake for 15 minutes in the preheated oven, or until cookies are lightly browned. Cool for a few minutes on the baking sheets, then remove to wire racks to cool completely.\nIn the microwave or in a metal bowl over a pan of simmering water, melt chocolate and 2 tablespoons of butter, stirring frequently until smooth. Remove from heat and stir in the milk. Dip both ends of the cooled cookies into the chocolate and place them onto waxed paper to set.\n", "title": "Wonderful Almond Fingers", "urlnum": "25818"}, {"ingred": ["1 cup butter", "1/2 cup brown sugar", "2 egg yolks", "2 cups all-purpose flour", "2 egg whites", "1 1/2 cups finely chopped walnuts", "1/2 cup raspberry jam"], "time": 120, "instr": "In a medium bowl, cream together the butter and brown sugar until smooth. Beat in the egg yolks one at a time. gradually mix in the flour. Cover dough and chill until firm, about 2 hours.\nPreheat the oven to 325 degrees F (165 degrees C). Line cookie sheets with parchment paper or aluminum foil. Roll dough into balls a little smaller than walnuts. Dip the balls in egg white, then roll them in the chopped walnuts. Place cookies 1 inch apart onto the prepared cookie sheets. Press thumb into middle of each ball to create a divot.\nBake for 12 to 15 minutes in the preheated oven, or until edges are golden. Remove from oven and repress divots, fill the divots with 1/2 teaspoon of raspberry jam. Remove cookies to cool on wire racks.\n", "title": "Wreath Cookies", "urlnum": "25819"}, {"ingred": ["3/4 cup butter, softened", "1/2 cup white sugar", "2 egg yolks", "1 1/2 vanilla beans, divided", "1 1/2 cups all-purpose flour", "1/2 cup ground almonds", "2 cups confectioners' sugar for rolling"], "time": 12, "instr": "In a medium bowl, cream together the butter and white sugar until smooth. Beat in the egg yolks one at a time. Split the half of vanilla bean and scrape the seeds; stir the seeds into the butter mixture. Mix in the flour and ground almonds. Divide the dough into two pieces, wrap and refrigerate until firm.\nPreheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper. Break off tablespoonful sized pieces of dough and roll them into little ropes about 2 inches long. Bend the ropes into a half circle and place them 2 inches apart onto the prepared cookie sheets.\nBake for 10 to 15 minutes in the preheated oven, until lightly browned. Scrape the seeds from the remaining vanilla bean and stir them into the confectioners' sugar. Carefully roll warm cookies in the vanilla sugar.\n", "title": "Vanilla Half-Moons", "urlnum": "25820"}, {"ingred": ["1/4 cup white sugar", "2 tablespoons almond paste", "1 cup flaked coconut", "1/2 cup miniature semisweet chocolate chips", "3 egg whites", "1/2 teaspoon cream of tartar"], "time": 50, "instr": "Preheat oven to 325 degrees F (165 degrees C). Line cookie sheets with parchment paper or grease lightly.\nIn a medium bowl, blend together the sugar and almond paste using your fingers until the paste is completely worked into the sugar. Stir in the coconut and chocolate chips. In a clean dry glass or metal bowl, Whip egg whites and cream of tartar to stiff peaks. Fold half of the egg whites into the coconut mixture to lighten the batter. Gently fold in the remaining whites, being careful not to deflate. Drop by rounded teaspoonfuls onto the prepared cookie sheets.\nBake for 20 minutes in the preheated oven, or until tops are lightly browned. Allow cookies to cool on baking sheet for a few minutes before removing to a wire rack to cool completely.\n", "title": "Choconut Macaroons", "urlnum": "25821"}, {"ingred": ["10 eggs", "2/3 cup white sugar", "1 tablespoon vanilla extract", "1 cup heavy cream", "8 teaspoons baking powder", "1 teaspoon salt", "8 cups all-purpose flour", "2 quarts oil for frying", "2 cups confectioners' sugar for dusting"], "time": 240, "instr": "Heat 2 inches oil in a deep-fryer or deep cast iron skillet to 375 degrees F (190 degrees C).\nIn a large bowl, beat the eggs, sugar, vanilla, heavy cream baking powder and salt with an electric mixer until smooth and well blended. Gradually mix in the flour, 1 cup at a time until the batter is too stiff to stir. Turn out onto a floured surface and knead in enough additional flour to make a smooth and soft dough. Roll out pieces of dough to 1/4 inch thickness. Cut into 2x3 inch rectangles. Make a slit in the center of the square but do not go all the way to the ends.\nFry cookies in hot oil, turning once, until golden. Drain in a colander. When the cookies are all fried, place them into a large container and dust them with confectioners' sugar.\n", "title": "Thick Wandies", "urlnum": "25822"}, {"ingred": ["1 1/2 cups all-purpose flour", "1/3 cup packed brown sugar", "3/4 cup butter", "3/4 cup cold water", "1 (1 ounce) package unflavored gelatin", "3/4 cup white sugar", "1/8 teaspoon salt", "3/4 cup confectioners' sugar", "3/4 teaspoon baking powder", "1/2 teaspoon vanilla extract", "1/2 teaspoon almond extract", "1 dash food coloring"], "time": 75, "instr": "Preheat the oven to 325 degrees F (165 degrees C). In a medium bowl, mix together the flour, brown sugar and butter until crumbly and well blended. Press the mixture into the bottom of an ungreased 9x9 inch baking pan.\nBake for 20 minutes in the preheated oven, until firm and golden. Set aside to cool.\nPour cold water into a medium saucepan and sprinkle the gelatin over it. Let stand 5 minutes. Stir in the white sugar and salt. Cook over medium heat, stirring to dissolve sugar and gelatin. When the mixture is clear, remove from heat and stir in the confectioners' sugar. Set aside until cool.\nWhen the mixture has cooled to luke warm, stir in the baking powder, vanilla and almond extracts and any color of food coloring. Beat at high speed with an electric mixer until the mixture can hold a peak. Pour over the shortbread base and cool until the gloss disappears. Cut into 36 squares and enjoy!\n", "title": "Marshmallow Squares                                                                            ", "urlnum": "25823"}, {"ingred": ["1/2 cup applesauce", "1/3 cup rum", "2 eggs", "1 tablespoon salad oil", "1 (21.5 ounce) package brownie mix", "1 cup sliced almonds", "1/2 cup semisweet chocolate chips"], "time": 105, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch brownie pan.\nIn a large bowl, stir together the applesauce, rum, eggs and oil until well blended. Stir in the contents of the brownie mix. Fold in the almonds and chocolate chips. Spread evenly into the prepared pan.\nBake for 30 to 35 minutes in the preheated oven, until the center is firm. Cool one hour and cut into squares.\n", "title": "Throw Together Brownies", "urlnum": "25824"}, {"ingred": ["1 cup shortening", "1 cup white sugar", "3 eggs", "1 teaspoon vanilla extract", "3 cups all-purpose flour", "1 teaspoon baking soda", "2 teaspoons cream of tartar"], "time": 180, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the shortening and white sugar. beat in the eggs one at a time then stir in the vanilla. Combine the flour, baking soda and cream of tartar; stir into the sugar mixture to form a dough. On a lightly floured surface, roll the dough out to 1/4 inch in thickness. Cut into desired shapes with cookie cutters. Place cookies 1 1/2 inches apart onto cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "The Absolute Best Cookie Recipe Ever", "urlnum": "25825"}, {"ingred": ["1/3 cup butter, softened", "1 cup white sugar", "1 cup molasses", "4 cups all-purpose flour", "2 teaspoons baking soda", "1 teaspoon salt", "1 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "1/2 teaspoon ground cloves", "1 cup milk", "4 cups semisweet chocolate chips", "1 cup raisins"], "time": 60, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Lightly grease cookie sheets.\nIn a medium bowl, cream together the butter and sugar until smooth. Stir in the molasses. Combine the flour, baking soda, salt, cinnamon and ginger; stir into the molasses mixture alternately with the milk. Finally, mix in the chocolate chips and raisins. Drop by rounded spoonfuls onto the prepared cookie sheets.\nBake for 10 to 15 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Cry Babies II", "urlnum": "25826"}, {"ingred": ["1 egg", "3/4 cup brown sugar", "1/2 cup honey", "1/2 cup dark molasses", "3 cups sifted all-purpose flour", "1/2 teaspoon baking soda", "1 1/4 teaspoons ground nutmeg", "1 1/4 teaspoons ground cinnamon", "1/2 teaspoon ground cloves", "1/2 teaspoon ground allspice", "1/2 cup slivered almonds", "1/2 cup candied mixed fruit peel, finely chopped", "1 egg white, beaten", "1 tablespoon lemon juice", "1/2 teaspoon lemon zest", "1 1/2 cups sifted confectioners' sugar"], "time": 500, "instr": "In a large bowl, beat the egg, brown sugar and honey until smooth. Stir in the molasses. Combine the flour, baking soda, nutmeg, cinnamon, cloves and allspice; stir into the molasses mixture. Stir in the almonds and candied fruit peel. Cover or wrap dough, and chill overnight.\nPreheat the oven to 400 degrees F (200 degrees C). Grease cookie sheets. On a lightly floured surface, roll the dough out to 1/4 inch in thickness. Cut into 2x3 inch rectangles. Place cookies 1 1/2 inches apart onto cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, until firm. While still warm, brush the cookies with the lemon glaze.\nTo make the glaze: In a small bowl, stir together the egg white, lemon juice and lemon zest. Mix in the confectioners' sugar until smooth. Brush over cookies.\n", "title": "German Lebkuchen", "urlnum": "25827"}, {"ingred": ["6 eggs", "3/4 cup evaporated milk", "1 cup vegetable oil", "2 tablespoons vanilla extract", "1 1/4 cups white sugar", "2 tablespoons baking powder", "6 cups all-purpose flour"], "time": 180, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, beat the eggs, evaporated milk, oil and vanilla until well blended. Mix in the sugar and baking powder. Stir in the flour 1 cup at a time until the dough becomes too stiff to stir. Turn out onto a clean surface and knead in as much of the remaining flour as possible. Dough should be smooth and not sticky. Keep the dough covered with a towel while pinching off tablespoon sized pieces of dough and rolling them into small ropes 6 inches long and 1/4 inch in diameter. Tie ropes into loose knots and place them 2 inches apart onto the prepared cookie sheets. The cookies will almost triple in size while baking.\nBake for 10 to 12 minutes in the preheated oven, until light brown on the bottom. Remove from cookie sheets to cool on wire racks. When cool, glaze with a mixture of confectioners' sugar and water, if desired.\n", "title": "Oil Cookies", "urlnum": "25828"}, {"ingred": ["1/2 cup butter, softened", "1/2 cup shortening", "1 cup white sugar", "1 cup light brown sugar", "2 eggs", "2 tablespoons evaporated milk", "2 teaspoons vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 1/2 cups rolled oats", "1 1/2 cups semisweet chocolate chips", "1 cup flaked coconut", "1 cup chopped pecans"], "time": 35, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter, shortening, white sugar and brown sugar until light and fluffy. Beat in the eggs one at a time, then stir in the evaporated milk and vanilla. Combine the flour, baking powder, baking soda and salt; stir into the sugar mixture. Mix in the oats, chocolate chips, coconut and pecans. Drop by rounded tablespoonfuls onto the prepared cookie sheets. Cookies should be spaced about 2 inches apart.\nBake for 13 to 15 minutes in the preheated oven, until golden brown. Cool slightly on cookie sheets before removing to wire racks to cool completely.\n", "title": "Spring Cleaning Cookies", "urlnum": "25829"}, {"ingred": ["1 cup butter, softened", "2 (3 ounce) packages cream cheese", "1/2 cup white sugar", "2 cups all-purpose flour", "2 teaspoons butter, melted", "2 eggs", "1/2 teaspoon vanilla extract", "2 cups chopped pecans", "1 1/2 cups brown sugar", "1/2 cup honey"], "time": 30, "instr": "In a medium bowl, mix together the butter, cream cheese and sugar until smooth. Stir in the flour and mix thoroughly. The dough should be somewhat firm. Roll into 36 small balls, place them on a plate and refrigerate for one hour.\nMake the filling in a medium bowl. Beat the eggs, melted butter, vanilla and brown sugar until smooth and well blended. Stir in the nuts. Preheat oven to 375 degrees F (190 degrees C). Press the chilled dough balls into the bottom and up the sides of tart pans or mini muffin cups. Fill each shell with filling almost to the top. Use a squeeze top honey container if you have one, to drip about 1/2 teaspoon of honey onto the top of each cup.\nBake for 15 to 20 minutes in the preheated oven, until crust is lightly browned. Allow to cool in the tins completely before removing.\n", "title": "Little Nut Cups", "urlnum": "25830"}, {"ingred": ["1 (18.25 ounce) package spice cake mix", "1 (15 ounce) can solid pack pumpkin"], "time": 35, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, stir together the cake mix and pumpkin until well blended. Drop by rounded spoonfuls onto the prepared cookie sheet.\nBake for 18 to 20 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Pumpkin Spice Cookie", "urlnum": "25831"}, {"ingred": ["2 (8 ounce) cans refrigerated crescent roll dough", "2 (8 ounce) packages cream cheese", "1 cup white sugar", "1 teaspoon vanilla extract", "1/2 cup margarine, melted", "1/4 cup white sugar", "1 teaspoon ground cinnamon"], "time": 45, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nPress one can of the crescent rolls into the bottom of the prepared pan. In a medium bowl, mix together the cream cheese, 1 cup of sugar, and vanilla until smooth and creamy. Spread over the crescent layer. Unroll the second can of crescent rolls and lay them on top of the cream cheese layer. Do not press down. Pour the melted margarine over the entire pan. Combine the remaining 1/4 cup of sugar and cinnamon; sprinkle over the top.\nBake for 25 to 30 minutes in the preheated oven, or until the top is crisp and golden.\n", "title": "Cream Cheese Squares", "urlnum": "25832"}, {"ingred": ["1 cup butter, softened", "1 (3 ounce) package cream cheese", "3/4 cup brown sugar", "1/2 cup white sugar", "2 eggs", "2 1/4 cups all-purpose flour", "1 teaspoon baking soda", "10 ounces milk chocolate candy bar, chopped", "1 cup flaked coconut", "1 3/4 cups chopped walnuts"], "time": 25, "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together the butter, cream cheese, brown sugar and white sugar until smooth. Beat in the eggs one at a time, mixing well after each. Combine the flour and baking soda; stir into the sugar mixture. Mix in the chopped chocolate, coconut and walnuts. Drop by rounded tablespoons onto ungreased cookie sheets.\nBake for 11 to 13 minutes in the preheated oven, or until golden brown. Remove from baking sheets to cool on wire racks.\n", "title": "Jacinto's", "urlnum": "25833"}, {"ingred": ["1 cup shortening", "1 cup white sugar", "1 cup brown sugar", "2 eggs", "1 teaspoon vanilla extract", "1/2 teaspoon baking powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "2 cups rolled oats", "2 cups whole wheat flake cereal", "1 cup flaked coconut"], "time": 30, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the shortening, white sugar and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the baking powder, baking soda and oats; stir into the sugar mixture. Fold in the wheat cereal, and coconut. Drop dough by teaspoonfuls onto the prepared cookie sheets. Flatten slightly with a fork.\nBake for 10 to 12 minutes in the preheated oven, or until light brown.\n", "title": "Flying Saucers", "urlnum": "25834"}, {"ingred": ["3/4 cup shortening", "3/4 cup margarine", "1 cup white sugar", "1 cup brown sugar", "1/2 cup peanut butter", "2 eggs", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1/3 cup unsweetened cocoa powder", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon cream of tartar", "1 cup rolled oats", "1 cup flaked coconut", "1/2 cup chopped walnuts (optional)", "2 cups miniature semisweet chocolate chips"], "time": 39, "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the shortening, margarine, white sugar and brown sugar until smooth. Beat in the eggs one at a time, then stir in the peanut butter and vanilla. Combine the flour, cocoa, baking powder, baking soda and cream of tartar; stir into the sugar mixture. Mix in the oats, walnuts (if desired) and chocolate chips. Drop by rounded spoonfuls onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Grandmas Cowboy Cookies", "urlnum": "25835"}, {"ingred": ["1 1/2 cups all-purpose flour", "1 teaspoon baking soda", "1 cup unsalted butter, softened", "3/4 cup brown sugar", "3/4 cup white sugar", "1 egg", "1 teaspoon vanilla extract", "1 1/2 cups rolled oats", "1 cup dried cherries", "1 cup miniature semisweet chocolate chips", "1 cup toffee baking bits"], "time": 34, "instr": "Sift together the flour and baking soda; set aside. In a large bowl, cream together the butter, brown sugar and white sugar until smooth. Beat in the egg and vanilla. Gradually stir in the sifted mixture, then mix in the oats, cherries, chocolate chips and toffee bits until evenly distributed. Divide the dough in to 3 portions and form them into logs, about 2 inches in diameter. wrap in waxed paper and refrigerate or freeze until firm.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets or line them with parchment paper. Slice dough logs into 3/4 inch thick slices. Place the cookies 2 inches apart onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Chewy Oatmeal Cherry Toffee Crisps", "urlnum": "25836"}, {"ingred": ["1 cup butter, softened", "2 cups packed brown sugar", "2 eggs", "2 teaspoons vanilla extract", "2 1/3 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon salt", "2 cups rolled oats", "1 cup semisweet chocolate chips", "1 cup vanilla baking chips", "1/2 cup butterscotch chips", "1 cup chopped pecans"], "time": 30, "instr": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, cream together the butter and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking soda and salt; stir into the creamed mixture. Mix in the oats, chocolate chips, vanilla chips, butterscotch chips and chopped pecans. Drop by tablespoonfuls onto ungreased cookie sheets. Cookies should be at least 2 inches apart.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Kitchen Sink Cookies", "urlnum": "25837"}, {"ingred": ["2 cups all-purpose flour", "1/2 teaspoon baking powder", "1/8 teaspoon baking soda", "1/2 teaspoon salt", "1/4 teaspoon ground cardamom", "2/3 cup unsalted butter, softened", "1 cup white sugar", "1 (3 ounce) package cream cheese, softened", "3 tablespoons almond paste", "1 egg", "1 teaspoon vanilla extract", "1/4 teaspoon lemon zest"], "time": 30, "instr": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Sift together the flour, baking powder, baking soda, salt and cardamom. Set aside.\nIn a medium bowl, cream together the butter, sugar, cream cheese and almond paste until smooth. Beat in the egg, vanilla and lemon zest. Gradually blend in the dry ingredients until well mixed. Drop by spoonfuls onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n", "title": "Jen's Almond Cardamom Cookies", "urlnum": "25838"}, {"ingred": ["1 cup margarine", "1 cup white sugar", "1 egg", "1/2 cup molasses", "2 1/2 teaspoons baking soda", "3 tablespoons boiling water", "4 1/2 cups all-purpose flour", "1 tablespoon margarine", "3 tablespoons boiling water", "1/4 teaspoon ground ginger", "1/8 teaspoon salt", "2 1/2 cups confectioners' sugar"], "time": 30, "instr": "In a large bowl, cream together 1 cup margarine and sugar until smooth. Beat in the egg and molasses until well blended. Dissolve the baking soda in boiling water; stir into the molasses mixture. Gradually mix in the flour to make a smooth dough. Cover and chill dough for at least 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). On a lightly floured surface, roll the dough out to 1/8 inch in thickness. Cut into circles using a 3 inch round cutter. Cut a smaller 1 inch circle out of half of the cookies. It is easier to cut the center hole after the cookies have been placed onto the cookie sheets. Place cookies 1 inch apart onto ungreased cookie sheets.\nBake for 7 to 10 minutes in the preheated oven, until edges begin to darken. Allow cookies to cool completely before sandwiching. Frost solid cookies and place a cookie with the center hole on top.\nTo make the frosting: Beat 1 tablespoon of margarine and water together. Blend in the ginger and salt. Gradually beat in the confectioners' sugar until the desired consistency is reached. Sandwich between cooled cookies.\n", "title": "Frosted Molasses Ginger Sandwich Cookies", "urlnum": "25839"}, {"ingred": ["1/2 cup butter, softened", "2/3 cup white sugar", "1 egg, separated", "2 tablespoons milk", "1 teaspoon vanilla extract", "1 cup all-purpose flour", "1/3 cup HERSHEY®'S Cocoa Powder", "1/4 teaspoon salt", "1 cup chopped walnuts", "26 HERSHEY®'S KISSES® Milk Chocolates", "1/2 cup confectioners' sugar", "1 tablespoon butter, softened", "2 teaspoons milk", "1/4 teaspoon vanilla extract"], "time": 85, "instr": "Beat butter, sugar, egg yolk, milk and vanilla in medium bowl until light and fluffy. Stir together flour, cocoa and salt; gradually add to butter mixture, beating until blended. Refrigerate dough at least 1 hour or until firm enough to handle.\nHeat oven to 350 F. Lightly grease cookie sheet. Shape dough into 1-inch balls. With fork, beat egg white slightly. Dip each ball into egg white; roll in nuts. Place on prepared cookie sheet. Press thumb gently in center of each cookie.\nBake 10 to 12 minutes or until set. Meanwhile, prepare VANILLA FILLING. Remove wrappers from KISSES. Remove cookies from cookie sheet to wire rack; cool 5 minutes. Spoon about 1/4 teaspoon filling into each thumbprint. Gently press a KISS in center of each cookie. Cool completely. About 2 dozen cookies.\nVANILLA FILLING: Combine 1/2 cup powdered sugar, 1 tablespoon softened butter or margarine, 2 teaspoons milk and 1/4 teaspoon vanilla extract in small bowl; beat until smooth.\n", "title": "Chocolate Thumbprint Cookies", "urlnum": "25840"}, {"ingred": ["3/4 cup butter, softened", "1 cup packed light brown sugar", "1 egg", "1 tablespoon apple juice", "1/2 teaspoon vanilla extract", "1 1/2 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon baking soda", "1/4 teaspoon salt", "1 1/2 cups quick-cooking oats", "1 (10 ounce) package HERSHEY®'S Cinnamon Chips", "1 cup apples - peeled, cored and chopped", "1/2 cup raisins"], "time": 30, "instr": "Heat oven to 350 degrees F. Lightly grease cookie sheet.\nBeat butter, brown sugar, egg, apple juice and vanilla in large bowl until creamy. Stir together flour, baking powder, baking soda and salt. Add to butter mixture; beat until blended. Stir in oats. Add cinnamon chips, apple and raisins; stir until blended. Drop by teaspoons onto prepared cookie sheet.\nBake 10 minutes or until edges are lightly browned. Cool 1 minute; remove from cookie sheet to wire rack. Cool completely.\n", "title": "Cinnamon Chip Apple Cookies", "urlnum": "25841"}, {"ingred": ["1 cup pimento-stuffed green olives, crushed", "1/2 cup drained kalamata olives, crushed", "2 cloves garlic, minced", "1/4 cup roughly chopped pickled cauliflower florets", "2 tablespoons drained capers", "1 tablespoon chopped celery", "1 tablespoon chopped carrot", "1/2 cup pepperoncini, drained", "1/4 cup marinated cocktail onions", "1/2 teaspoon celery seed", "1 teaspoon dried oregano", "1 teaspoon dried basil", "3/4 teaspoon ground black pepper", "1/4 cup red wine vinegar", "1/2 cup olive oil", "1/4 cup canola oil", "2 (1 pound) loaves Italian bread", "8 ounces thinly sliced Genoa salami", "8 ounces thinly sliced cooked ham", "8 ounces sliced mortadella", "8 ounces sliced mozzarella cheese", "8 ounces sliced provolone cheese"], "time": 0, "instr": "To Make Olive Salad: In a medium bowl, combine the green olives, kalamata olives, garlic, cauliflower, capers, celery, carrot, pepperoncini, cocktail onions, celery seed, oregano, basil, black pepper, vinegar, olive oil and canola oil. Mix together and transfer mixture into a glass jar (or other nonreactive container). If needed, pour in more oil to cover. Cover jar or container and refrigerate at least overnight.\nTo Make Sandwiches: Cut loaves of bread in half horizontally; hollow out some of the excess bread to make room for filling. Spread each piece of bread with equal amounts olive salad, including oil. Layer 'bottom half' of each loaf with 1/2 of the salami, ham, mortadella, mozzarella and Provolone. Replace 'top half' on each loaf and cut sandwich into quarters.\nServe immediately, or wrap tightly and refrigerate for a few hours; this will allow for the flavors to mingle and the olive salad to soak into the bread.\n", "title": "Real N'awlins Muffuletta", "urlnum": "25842"}, {"ingred": ["3 pounds rabbit meat, cleaned and cut into pieces", "1/2 teaspoon salt", "1/3 cup all-purpose flour", "1/2 pound bacon, diced", "1/2 cup finely chopped shallots", "1 clove garlic, finely chopped", "1 cup dry red wine", "1 cup water", "1 tablespoon chicken bouillon granules", "1 tablespoon currant jelly", "10 black peppercorns, crushed", "1 bay leaf", "1/4 teaspoon dried rosemary, crushed", "2 teaspoons lemon juice", "3 tablespoons water", "2 tablespoons all-purpose flour", "1/8 teaspoon dried thyme, crushed"], "time": 120, "instr": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain on paper towels and set aside. Sprinkle rabbit with salt and coat with 1/3 cup flour, shaking off excess. Brown rabbit in remaining bacon fat. Remove from skillet, along with all but 2 tablespoons of the fat, and reserve.\nSaute shallots and garlic in skillet for about 4 minutes, until tender. Stir in wine, 1 cup water and bouillon. Heat to boiling, then stir in jelly, peppercorns, bay leaf, and rosemary. Return rabbit and bacon to skillet. Heat to boiling, then reduce heat to low. Cover and let simmer about 1 1/2 hours or until rabbit is tender.\nRemove bay leaf and discard. Place rabbit on a warm platter and keep warm while preparing gravy.\nTo Make Gravy: Stir lemon juice into skillet with cooking liquid. Combine 3 tablespoons water with 2 tablespoons flour and mix together; stir mixture into skillet over low heat. Finally, stir in thyme. Pour gravy over stew and serve, or pour into a gravy boat and serve on the side.\n", "title": "Hasenpfeffer (Rabbit Stew)", "urlnum": "25843"}, {"ingred": ["1 (1.5 fluid ounce) jigger vodka", "1 teaspoon dry vermouth", "1/2 fluid ounce cranberry juice", "1 twist lime zest, garnish"], "time": 5, "instr": "Fill a shaker with ice and pour in vodka, vermouth and cranberry juice. Shake vigorously for 10 seconds. Strain into a cocktail glass. Garnish with a twist of lime\n", "title": "Cosmopolitan Martini", "urlnum": "25844"}, {"ingred": ["1 (1.5 fluid ounce) jigger vodka", "1/2 fluid ounce cointreau", "1 teaspoon fresh lime juice", "1 1/2 fluid ounces cranberry juice", "1 twist lime zest, garnish"], "time": 3, "instr": "Pour all the ingredients into a shaker with lots of ice. Shake vigorously for several seconds and strain into a cocktail glass. Garnish with a lime twist.\n", "title": "Cosmopolitan", "urlnum": "25845"}, {"ingred": ["1 (16 ounce) can frozen orange juice concentrate", "1 pint heavy cream", "20 fluid ounces carbonated water", "1/3 cup confectioners' sugar", "2 1/2 teaspoons vanilla extract", "15 cubes ice"], "time": 5, "instr": "In a blender, combine orange juice concentrate, cream, carbonated water, confectioners' sugar, vanilla and ice. Blend until smooth. Pour into glasses and serve immediately.\n", "title": "Creamy Orange Glorious", "urlnum": "25846"}, {"ingred": ["3/4 cup milk", "1 teaspoon vanilla extract", "3 tablespoons granulated sugar", "3 tablespoons mocha flavored instant coffee mix", "1 cup crushed ice"], "time": 5, "instr": "In a blender or food processor, combine milk, vanilla, sugar, coffee powder and crushed ice. Blend until smooth. Pour into glasses and serve.\n", "title": "Iced Mocha Fusion Shake", "urlnum": "25847"}, {"ingred": ["2 cups milk", "4 tablespoons chocolate instant breakfast mix", "2 tablespoons crunchy peanut butter", "2 bananas, sliced", "4 cubes ice"], "time": 5, "instr": "In a blender, combine milk, instant breakfast mix, peanut butter, bananas and ice. Blend until smooth, about 30 seconds. Serve immediately.\n", "title": "Chocolate Banana Peanut Butter Shake", "urlnum": "25848"}, {"ingred": ["4 cups half-and-half", "1 cup white sugar", "11 egg yolks, beaten", "1 teaspoon vanilla extract", "2 cups heavy cream", "2/3 cup dark rum", "1/2 cup Scotch whiskey", "1 pint vanilla ice cream"], "time": 490, "instr": "In a saucepan over low heat, stir together the half-and-half and sugar. Whisk in egg yolks and cook until light custard forms; do not boil. Remove from heat and cool, then place in refrigerator and chill overnight.\nInto the chilled mixture, stir in vanilla, cream, dark rum, scotch, and vanilla ice cream. Serve cold.\n", "title": "Eggnog Blend", "urlnum": "25849"}, {"ingred": ["1 (1.5 fluid ounce) jigger coconut flavored rum", "3/4 tablespoon grenadine syrup", "3 1/2 fluid ounces guava flavored juice cocktail"], "title": "Cape Sunrise", "instr": "Pour rum over ice in a highball glass. Fill the glass with guava juice cocktail; stir. Drizzle the grenadine syrup over the top.\n", "time": 3, "urlnum": "25850"}, {"ingred": ["1 (1.5 fluid ounce) jigger coconut flavored rum", "2 fluid ounces cranberry juice", "2 fluid ounces grapefruit juice", "1/2 teaspoon superfine sugar"], "title": "Cape Breeze", "instr": "In a highball glass over ice, combine coconut rum, cranberry juice, grapefruit juice and sugar. Stir.\n", "time": 3, "urlnum": "25851"}, {"ingred": ["2 cubes ice", "2 fluid ounces peppermint schnapps", "3 fluid ounces coffee flavored liqueur"], "title": "Peppermint Patty II", "instr": "Into two small brandy snifter or cordial glasses, place one ice cube, one fluid ounce of schnapps, and 1 1/2 fluid ounces of the coffee liqueur, stir gently.\n", "time": 1, "urlnum": "25852"}, {"ingred": ["1 quart orange sherbet", "2 quarts fresh orange juice", "1 (2 liter) bottle ginger ale, chilled", "2 (750 milliliter) bottles champagne, chilled"], "title": "New Year's Champagne Punch", "instr": "Place the orange juice, ginger ale, and champagne in the refrigerator to get them well chilled.\nIn a large punch bowl, place the block of sherbet in the center and pour the orange juice over the top. Next, pour the ginger ale over the sherbet. Finally, pour both bottles of champagne over the sherbet. Stir gently to mix the liquids, resulting in a foamy top. Serve immediately.\n", "time": 5, "urlnum": "25853"}, {"ingred": ["1 (3.5 ounce) package instant French vanilla pudding", "1 1/2 quarts milk", "2 1/2 teaspoons rum flavored extract", "1/2 teaspoon nutmeg"], "title": "Eggless Eggnog", "instr": "In a large bowl, combine the pudding mix with 2 cups of milk, following package directions; allow to chill for 5 minutes.\nTo the pudding stir in the rum flavoring and nutmeg, then slowly mix in the remaining 4 cups of milk until the mixture is a thick but drinkable consistency. Chill until ready to serve.\n", "time": 5, "urlnum": "25854"}, {"ingred": ["1 (1.5 fluid ounce) jigger creme de menthe liqueur", "1 teaspoon maraschino cherry juice", "1 maraschino cherry"], "title": "Cough Syrup", "instr": "Fill an 8 fl. ounce rocks glass with crushed ice. Pour in the shot of creme de menthe and cherry juice, and stir. Toss in the cherry.\n", "time": 2, "urlnum": "25855"}, {"ingred": ["1 fluid ounce vodka", "1 fluid ounce coffee flavored liqueur", "1/2 cup milk", "1/8 teaspoon cola-flavored carbonated beverage"], "title": "Paralyzers", "instr": "Fill a highball glass with ice, and pour in vodka, coffee liqueur, milk, and cola; stir.\n", "time": 2, "urlnum": "25856"}, {"ingred": ["1 (8 ounce) package cream cheese", "1 (4 ounce) can small shrimp, drained", "1/2 (12 ounce) bottle cocktail sauce"], "title": "Very Easy Shrimp Dip", "instr": "Spread the cream cheese on the bottom of a 8 inch square serving dish. Layer the shrimp over the cream cheese. Pour the cocktail sauce over the top.\n", "time": 10, "urlnum": "25857"}, {"ingred": ["1 pound processed cheese", "2 cups mayonnaise", "1 (2 pound) package frozen hash brown potatoes, thawed", "1 white onion, chopped", "1 (3 ounce) jar real bacon bits"], "title": "Cheesy  Potato Casserole", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn the microwave, melt cheese in a large microwave-safe bowl. Stir in mayonnaise, potatoes and onions. Spread in a 9x13 inch baking dish and top with bacon bits.\nBake in preheated oven for 1 hour, or until hot and bubbly.\n", "time": 75, "urlnum": "25858"}, {"ingred": ["2 cups water", "2 bunches asparagus, trimmed and cut into 1 inch pieces", "2 tablespoons vegetable oil", "24 large fresh shrimp, peeled, deveined and cut in half lengthwise", "2 teaspoons chopped fresh ginger root", "3 tablespoons soy sauce", "2 teaspoons granulated sugar", "1 teaspoon dry sherry", "salt to taste"], "title": "Jumbo Shrimp and Asparagus", "instr": "In a medium saucepan, bring two cups of water to a boil. Cook asparagus in boiling water for 3 minutes. Drain, reserving 2 tablespoons of liquid.\nHeat the oil in a skillet over medium-high heat. Saute the shrimp pieces until the color changes, about 3 to 5 minutes. Stir in asparagus with reserved liquid , and season with ginger, soy sauce, sugar, sherry and salt to taste. Continue to cook for 5 more minutes.\n", "time": 30, "urlnum": "25859"}, {"ingred": ["2 (10 ounce) cans condensed cream of mushroom soup", "2 (5 ounce) cans tuna, drained and flaked", "7 ounces crushed potato chips"], "title": "Tuna Casserole III", "instr": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9-inch glass pie dish.\nIn a mixing bowl, combine soup, tuna, and 1/4 of the potato chips. Mix thoroughly. Pour into the prepared pie dish. Cover the top with remaining potato chips.\nBake in the preheated oven until potato chips on top start to brown, 10 to 15 minutes. Cool before serving.\n", "time": 25, "urlnum": "25860"}, {"ingred": ["1 cup butter", "2 large white onions, chopped", "6 stalks celery, chopped", "3 cloves garlic, pressed", "4 tablespoons all-purpose flour", "5 pounds fresh shrimp, peeled, deveined and chopped", "1 cup chopped fresh mushrooms", "3 tablespoons paprika", "salt to taste", "ground black pepper to taste", "crushed red pepper to taste"], "title": "Ann's Shrimp Etouffee", "instr": "In a large skillet, melt butter and saute onions, celery and garlic for about 45 minutes or until they are cooked down.\nStir in flour and cook briefly, do not brown. Stir in chopped shrimp and cook for 20 minutes.\nPour in 2 to 3 cups of water and mushrooms. Stir in paprika and season with salt, pepper and red pepper flakes. Cook for 30 minutes. Should be a thick and have a gravy-like consistency.\n", "time": 145, "urlnum": "25861"}, {"ingred": ["3 eggs", "2 cups heavy cream", "1 1/2 cups mayonnaise", "2 tablespoons chopped onion", "2 tablespoons chopped fresh parsley", "1/2 cup dry sherry", "1 (6 ounce) package herb-seasoned dry bread stuffing mix", "1 pound cooked crabmeat"], "title": "Bunch's Crab Casserole", "instr": "Place eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.\nPreheat oven to 300 degrees F (150 degrees C). Lightly grease an 11x7 inch baking dish.\nIn a bowl, combine the chopped eggs, heavy cream, mayonnaise, onion, parsley, and sherry. Reserve 1/2 cup of the stuffing mix and add the rest to the egg mixture. Stir in the crabmeat.\nPour the mixture into prepared baking dish and sprinkle the reserved stuffing on top. Bake in preheated oven for 45 minutes or until bubbly and slightly browned on top.\n", "time": 75, "urlnum": "25862"}, {"ingred": ["3 tablespoons butter", "1 pound lobster meat, cut into bite-sized pieces", "3 tablespoons all-purpose flour", "3/4 teaspoon dry mustard", "salt and pepper to taste", "1 cup heavy cream", "1/2 cup milk", "3 slices bread, crust removed"], "title": "Lobster Casserole", "instr": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 2 quart baking dish.\nMelt butter in a medium sized pot over low heat. Saute the lobster meat in butter until it starts to change color. Do not cook too long or too fast, or the lobster meat will toughen. With a slotted spoon, remove lobster meat from pan and set aside.\nTo the remaining butter in the pot, stir in the flour, dry mustard, salt and pepper. Gradually whisk in cream and milk. Cook, stirring constantly, until thickened, about 5 minutes. Return lobster meat to the pot. Tear the bread into small pieces and stir into the mixture. Pour into prepared baking dish.\nBake in preheated oven for 20 to 25 minutes or until bubbly and delicately browned.\n", "time": 55, "urlnum": "25863"}, {"ingred": ["1/4 cup butter", "1/2 cup sliced fresh mushrooms", "1/2 cup white wine", "1 pound peeled crawfish", "1/4 cup all-purpose flour", "1/2 teaspoon salt", "1/2 teaspoon red pepper flakes", "2 cups milk", "paprika, for garnish"], "title": "Crawfish Thermidor", "instr": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease 4 small to medium sized ramekins.\nIn a skillet, melt the butter and add mushrooms and white wine; simmer for about 8 minutes. Add the crawfish tails and simmer for another 5 minutes.\nGradually blend in flour, salt, and red pepper flakes. Slowly drizzle in the milk, stirring constantly and cook until mixture thickens.\nPour mixture into the prepared ramekins. Sprinkle the top of each with a pinch of paprika.\nBake in preheated oven for 10 to 15 minutes or until heated through.\n", "time": 45, "urlnum": "25864"}, {"ingred": ["5 cups dry egg noodles", "1 (10.75 ounce) can condensed cream of mushroom soup", "1 cup milk", "1 1/2 cups water", "2 (12 ounce) cans tuna, drained and flaked", "1 (10 ounce) package frozen green peas", "1 (10 ounce) package frozen carrots", "2 (15 ounce) cans sliced potatoes, drained", "salt to taste", "ground black pepper to taste", "paprika to taste", "3/4 cup dry bread crumbs"], "title": "Mushroom Tuna Noodle Casserole", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a mixing bowl combine soup, milk, and water. Pour a small amount of the mixture into a 9x13 inch baking dish; enough to just cover the bottom.\nLayer the cooked noodles, flaked tuna, peas, carrots, and potatoes until all used up. Pour the remaining soup mixture over the layers. Sprinkle with salt, pepper, and paprika. Lightly coat the entire casserole with bread crumbs.\nCover and bake in preheated oven for 45 minutes.\n", "time": 60, "urlnum": "25865"}, {"ingred": ["4 (6 ounce) fillets salmon, with skin and bones removed", "8 sheets phyllo dough", "1/2 cup melted butter", "salt to taste", "ground black pepper to taste", "4 tablespoons Dijon mustard"], "title": "Wrapped Salmon", "instr": "Preheat oven to 375 degrees F (190 degrees C).\nCut the filets into log shaped pieces, about 2 inches wide by 5 inches long, keeping the filet portions separate. Take 2 sheets of phyllo dough, placing one on top of the other, and brush lightly with melted butter, covering the one side completely.\nPlace a portion of salmon (6 ounces), on the edge, nearest you, of the phyllo dough. Sprinkle with salt and pepper to taste. Coat the portion of salmon with 1 tablespoon of Dijon mustard.\nFold the phyllo dough, nearest you, over the salmon and make one complete wrap. Take the sides of the dough and fold them towards the center, and continue rolling up the dough. Brush all sides with butter, covering completely and place on a cookie sheet. Repeat steps for remaining portions of salmon.\nBake in preheated oven for 20 minutes or until phyllo dough is golden brown.\n", "time": 45, "urlnum": "25866"}, {"ingred": ["2 tablespoons olive oil", "2 cloves garlic, chopped", "1/4 cup chopped green onion", "1 pound fresh shrimp, peeled and deveined", "1/2 cup Italian flat leaf parsley, chopped", "1/2 cup freshly grated Parmesan cheese"], "title": "Shrimp Verde", "instr": "Heat olive oil in a large skillet. Saute garlic and scallions briefly, but do not brown the garlic.\nToss in shrimp and saute until pink and opaque in the center. Stir in parsley and heat through.\nRemove from heat and pour into a serving dish. Sprinkle with grated Parmesan cheese.\n", "time": 20, "urlnum": "25867"}, {"ingred": ["1/2 gallon water", "1 small onion, quartered", "1 strip celery, roughly chopped", "2 bay leaves", "3 tablespoons fresh lemon juice", "2 pounds unshelled raw shrimp", "1 cup butter, softened", "1 cup dry bread crumbs", "1/4 cup sour cream", "1/4 cup chopped fresh parsley", "2 cloves garlic, crushed", "1 teaspoon salt", "1 teaspoon Worcestershire sauce", "1 teaspoon steak sauce", "1 teaspoon coarsely ground black pepper", "1 1/2 tablespoons fresh lemon juice"], "title": "Shrimp de Jonghe II", "instr": "Preheat oven to 400 degrees F (200 degrees C).\nIn a large pot, combine water, onion, celery, bay leaves, and 3 tablespoons of fresh lemon juice. Bring the liquid to a boil and add the unshelled shrimp. Simmer for 5 minutes, then remove the pot from the heat. Let shrimp cool in the liquid. Drain the shrimp and shell and devein them.\nIn a mixing bowl, cream the butter with an electric hand mixer or whisk, and thoroughly blend in the bread crumbs and sour cream. Slowly beat in the parsley, crushed garlic, salt, Worcestershire sauce, steak sauce, black pepper and juice of 1/2 lemon.\nArrange the shrimp in the bottom of 6 (5 ounce) ramekins and cover them with the butter mixture.\nBake in preheated oven until tops are lightly browned, about 10 to 15 minutes.\n", "time": 45, "urlnum": "25868"}, {"ingred": ["1 pound sea scallops", "3 tablespoons butter", "2 tablespoons all-purpose flour", "1 cup heavy cream", "1/4 cup grated Parmesan cheese", "salt to taste", "ground black pepper to taste", "1 (10 ounce) package frozen chopped spinach, thawed", "1 cup shredded mozzarella cheese", "1/4 cup grated Parmesan cheese", "1/4 cup plain bread crumbs", "1 tablespoon OLD BAY® Seasoning"], "title": "Deb's Scallops Florentine", "instr": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch pie plate.\nBring a pot of water to a rolling boil. Rinse the scallops, and drop them into the boiling water; cook for 2 minutes. Remove the scallops with a slotted spoon, and pat dry. Place on the bottom of the prepared pie plate.\nIn a small saucepan, melt the butter, and stir in the flour. Cook over low heat for 3 minutes. Whisk in heavy cream and 1/4 cup Parmesan cheese. Season with salt and pepper to taste. Cook for another 2 to 3 minutes, stirring constantly, or until thick.\nSqueeze the spinach dry, and spread over the scallops. Pour the cream sauce over the spinach, and top with mozzarella cheese, 1/4 cup Parmesan cheese, and bread crumbs. Sprinkle Old Bay Seasoning over the bread crumbs.\nBake in preheated oven for 15 minutes, or until browned and bubbly.\n", "time": 55, "urlnum": "25869"}, {"ingred": ["1 pound fresh shrimp, peeled, deveined and finely minced", "1/2 yellow onion, minced", "1/2 cup finely chopped water chestnuts", "1/2 cup finely chopped celery", "1 green onion, finely chopped", "1/2 cup cooked crabmeat", "1 egg, beaten", "1 1/2 tablespoons chopped fresh parsley", "1 teaspoon sesame oil", "salt to taste", "ground black pepper to taste", "5 drops soy sauce", "1 teaspoon minced garlic", "2 cups oil for frying", "8 thick slices white bread", "1/4 cup soy sauce", "1 tablespoon water", "1 teaspoon sesame oil", "3 tablespoons chopped fresh parsley", "garlic powder to taste", "1 teaspoon white sugar"], "title": "Daddy's Shrimp Toast", "instr": "In a mixing bowl, combine the shrimp, onion, water chestnuts, celery, and green onion. Stir in crabmeat, egg, parsley, sesame oil, soy sauce, and garlic. Season with salt and pepper to taste.\nMake the dipping sauce: In a small mixing bowl, whisk together soy sauce, water, sesame oil, parsley, garlic powder, and sugar; set aside.\nIn a heavy skillet, heat 2 cups oil, or enough to be 1/2 inch deep, over medium heat. Spread a thick layer of shrimp filling on one side of each slice of bread.\nFry the topped bread in hot oil until golden brown and shrimp is pink, turning once. Do not let the filling sit on the bread too long or the sandwich will get soggy. Drain on paper towels and let cool for a minute. Slice diagonally and serve with dipping sauce or alone.\n", "time": 40, "urlnum": "25870"}, {"ingred": ["1 clove garlic, minced", "6 tablespoons olive oil", "1 teaspoon dried basil", "1 teaspoon salt", "1 teaspoon ground black pepper", "1 tablespoon fresh lemon juice", "1 tablespoon chopped fresh parsley", "2 (6 ounce) fillets halibut"], "title": "Grilled Fish Steaks", "instr": "In a stainless steel or glass bowl, combine garlic, olive oil, basil, salt, pepper, lemon juice, and parsley.\nPlace the halibut filets in a shallow glass dish or a resealable plastic bag, and pour the marinade over the fish. Cover or seal and place in the refrigerator for 1 hour, turning occasionally.\nPreheat an outdoor grill for high heat and lightly oil grate. Set grate 4 inches from the heat.\nRemove halibut filets from marinade and drain off the excess. Grill filets 5 minutes per side or until fish is done when easily flaked with a fork.\n", "time": 90, "urlnum": "25871"}, {"ingred": ["1 cup pecan halves or pieces", "1 cup honey", "3/4 cup butter", "1/4 cup vegetable oil", "4 (4 ounce) fillets salmon", "salt and pepper to taste"], "title": "Salmon with Pecan Honey Glaze", "instr": "Preheat oven to 350 degrees F (175 degrees C). Spread pecans in a single layer on a baking sheet. Bake 8 to 10 minutes, or until slightly browned. Stir 2 or 3 times to toast uniformly.\nIn a small saucepan over medium-high heat, combine honey with half of the butter. Stir in the toasted pecans, and cook for 8 to 10 minutes to infuse the flavors. Remove from heat, and keep warm.\nMelt remaining butter with oil in a large skillet over high heat. Season fish with salt and pepper. Arrange fillets in skillet, and cook until firm to the touch, about 4 to 5 minutes per side. Salmon is done when it flakes easily with a fork. Transfer to serving plate, and spoon glaze over top.\n", "time": 35, "urlnum": "25872"}, {"ingred": ["2 large Spanish onions, sliced", "1 large ripe tomato", "1/2 cup olive oil", "3/4 cup fresh lemon juice", "4 (8 ounce) cans oysters", "1 large ripe tomato, diced", "3 green onions, chopped", "3/8 cup ketchup", "1/2 teaspoon soy sauce", "1/2 teaspoon garlic salt", "2 tablespoons chopped fresh parsley", "1/2 teaspoon granulated sugar", "salt to taste"], "title": "Seviche", "instr": "In a saucepan over medium heat, add the sliced onions and add just enough water to cover. Bring to a simmer and cook just enough to soften. Remove from heat and drain. Rinse with cold water and drain.\nTake one 1 large tomato and score an 'X' , skin deep, on the top and bottom. Place in the same saucepan used for the onions and add enough water to cover. Bring to a simmer and cook until soft and the skin starts to peel, about 5 minutes. Remove the tomato and rinse under cold water until it's cool enough to hold in your hand. Using your fingers or the blade of a knife, gently peel off the skin. Place the peeled tomato in a blender and puree.\nIn a large glass dish or bowl, combine the onions, olive oil and lemon juice. Stir in the oysters, pureed tomato, diced tomato, green onions, ketchup and soy sauce. Season with garlic salt, parsley, sugar, and salt to taste.\n", "time": 140, "urlnum": "25873"}, {"ingred": ["1 cup butter", "2 tablespoons prepared Dijon-style mustard", "1 tablespoon fresh lemon juice", "1 tablespoon chopped garlic", "1 tablespoon chopped fresh parsley", "2 pounds medium raw shrimp, shelled, deveined, with tails attached"], "title": "Shrimp Scampi Bake", "instr": "Preheat oven to 450 degrees F (230 degrees C).\nIn a small saucepan over medium heat, combine the butter, mustard, lemon juice, garlic, and parsley. When the butter melts completely, remove from heat.\nArrange shrimp in a shallow baking dish. Pour the butter mixture over the shrimp.\nBake in preheated oven for 12 to 15 minutes or until the shrimp are pink and opaque.\n", "time": 45, "urlnum": "25874"}, {"ingred": ["1 (6 ounce) can small shrimp, drained", "1 (6 ounce) can crabmeat, drained and flaked", "1/2 cup mayonnaise", "1/4 cup thinly sliced green onions", "1/4 cup diced celery", "1 (8 ounce) package shredded mozzarella cheese", "1/8 teaspoon salt", "1/8 teaspoon ground black pepper", "1 (1 pound) loaf French bread, halved horizontally"], "title": "Shrimp and Crabmeat Loaf", "instr": "In a bowl, combine well the shrimp, crab, mayonnaise, green onions, celery, cheese, salt, and pepper.\nSpread the shrimp mixture on the bottom half of bread and replace the top half. Cut into 8 pieces and serve immediately or refrigerate whole and cut into 8 pieces when ready to serve.\nHeating instructions: Preheat oven to 400 degrees F (200 degrees C). Wrap the loaf in a large piece of aluminum foil. Bake for 20 minutes or until heated through. Cut into 8 pieces.\n", "time": 30, "urlnum": "25875"}, {"ingred": ["3/4 pound salmon fillet", "1/2 cup water", "1/2 cup uncooked instant rice", "4 (10 inch) garlic and herb flour tortillas", "1 cup shredded Monterey Jack cheese", "4 tablespoons diced red onion", "4 tablespoons Ranch-style salad dressing"], "title": "Succulent Salmon Wraps", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nLay the salmon filet on a sheet of aluminum foil. Fold and seal the foil together to enclose the salmon inside. Bake in preheated oven for 30 minutes or until the salmon flakes easily with a fork.\nWhile the salmon is cooking, bring the 1/2 cup of water to a boil and add the rice. Cover, remove the pan from the heat, and let sit for 5 minutes or until all the water has been absorbed.\nWrap the tortillas tightly in aluminum foil. During the last few minutes of the salmon's cook time, put the wrapped tortillas in the oven to warm. When the salmon is done, remove it from the foil and cut it into 4 equal pieces.\nRemove a warm tortilla from the oven, one at a time, filling each one with a piece of salmon. Break the piece of salmon up and place it on the tortilla. Add an 1/8 cup of cooked rice, 1/4 cup of cheese, and 1 tablespoon of red onion. Drizzle 1 tablespoon of ranch dressing over the top. Wrap the tortilla up and serve warm.\n", "time": 40, "urlnum": "25876"}, {"ingred": ["3 tablespoons margarine", "2 tablespoons sliced green onion", "1 1/2 pounds fresh shrimp, shelled and deveined without tails", "1 (8 ounce) package cream cheese, cubed", "3 tablespoons milk", "1/2 cup shredded Swiss cheese", "2 tablespoons dry white wine", "1/8 teaspoon ground red pepper", "1/4 cup fine dry bread crumbs", "2 tablespoons melted margarine"], "title": "Shrimp Versailles", "instr": "Preheat oven to BROIL. Lightly grease a 1 to 1 1/2 quart baking dish.\nIn a large skillet over medium heat, melt 3 tablespoons of margarine and saute the green onions. Toss in shrimp and saute until pink, about 5 minutes.\nRemove shrimp with slotted spoon and set aside. Add cream cheese and milk to skillet, stirring constantly until cheese melts. Stir in Swiss cheese, wine, cooked shrimp, and red pepper. Cook until all cheese is melted and shrimp are heated through.\nPour mixture into prepared baking dish. Combine bread crumbs and 2 tablespoons of melted margarine, sprinkle over shrimp mixture.\nBroil for 1 to 2 minutes or until golden brown.\n", "time": 60, "urlnum": "25877"}, {"ingred": ["2 tablespoons butter", "1 cup chopped onion", "2 (4.5 ounce) cans small shrimp, drained", "1 (4.5 ounce) can sliced mushrooms, drained", "1/2 pound cooked crabmeat", "1/2 teaspoon salt", "1/4 teaspoon ground black pepper", "1/4 teaspoon paprika", "8 (6 ounce) fillets flounder", "2 (10.75 ounce) cans condensed cream of mushroom soup", "1/3 cup chicken broth", "2 tablespoons water", "2/3 cup shredded Cheddar cheese", "2 tablespoons minced fresh parsley"], "title": "Shrimp and Crab Stuffed Flounder", "instr": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13 inch baking dish and set aside.\nIn a saucepan over medium heat, melt butter and saute onion, shrimp, and mushrooms until onion is tender. Stir in crabmeat, salt, pepper, and paprika; heat through.\nSpoon the shrimp and crab mixture onto each flounder filet. Roll the filet up and fasten with toothpicks. Place rolled filets in prepared baking dish.\nIn a small bowl, whisk together soup, chicken broth, and water until smooth. Pour over the filets. Sprinkle cheese over the top.\nCover the baking dish with aluminum foil and bake in preheated oven for 30 minutes. Remove from oven and remove foil. Sprinkle the parsley over the top of the filets. Return the dish to the oven and bake uncovered for an additional 5 minutes or until fish flakes easily with a fork.\n", "time": 60, "urlnum": "25878"}, {"ingred": ["3 tablespoons butter", "1/4 cup all-purpose flour", "2 cups heavy cream, divided", "2 ounces freshly grated Parmesan cheese", "2 tablespoons dry sherry", "1/2 teaspoon paprika", "2 cups cooked crabmeat", "1 cup peeled cooked shrimp", "1 1/2 cups garlic-flavored croutons", "1/4 cup fresh parsley", "4 tablespoons melted butter"], "title": "Ann's Neptune's Delight", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large saucepan over medium heat, melt 3 tablespoons of butter. Remove from heat and whisk in flour. Pour in 1/2 cup of heavy cream and whisk well, return to heat.\nAdd cheese and stir until creamy. Remove from heat and pour in remaining cream. Stir in sherry, paprika, crabmeat, and shrimp. Spoon mixture into 6 large individual ramekins.\nIn a food processor or blender, blend together croutons and parsley. Top each filled ramekin with crouton mixture. Drizzle melted butter over the top.\nBake in preheated oven for 20 minutes or until top is browned and bubbly.\n", "time": 25, "urlnum": "25879"}, {"ingred": ["3/4 cup butter, softened", "1 cup packed light brown sugar", "1/4 cup light corn syrup", "1 egg", "1 2/3 cups HERSHEY®'S Cinnamon Chips, divided", "2 1/2 cups all-purpose flour", "2 teaspoons baking soda", "1/4 teaspoon salt", "1 cup ground pecans", "1 1/2 teaspoons shortening"], "title": "Chewy Drizzled Cinnamon Chips Cookies", "instr": "Beat butter and brown sugar in large bowl until fluffy. Add corn syrup and egg; mix well.\nPlace 1 cup cinnamon chips in microwave-safe bowl. Microwave at HIGH 1 minute; stir. If necessary, microwave at HIGH an additional 15 seconds at a time, stirring after each heating, just until chips are melted when stirred. Stir melted chips into butter mixture.\nStir together flour, baking soda and salt; add to cinnamon chips mixture, beating just until blended. Cover; refrigerate dough about 1 hour or until firm enough to handle.\nHeat oven to 350 degrees F. Shape dough into 1-inch balls; roll in nuts, lightly pressing nuts into dough. Place on ungreased cookie sheet.\nBake 8 to 10 minutes or until golden around edges. Cool slightly; remove from cookie sheet to wire rack. Cool completely. Drizzle with CINNAMON CHIPS DRIZZLE. About 5 dozen cookies.\nCINNAMON CHIPS DRIZZLE: Place remaining 2/3 cup cinnamon chips and 1-1/2 teaspoons shortening (do not use butter, margarine, spread or oil) in small microwave-safe bowl. Microwave at HIGH 1 minute; stir until chips are melted and mixture is smooth.\n", "time": 95, "urlnum": "25880"}, {"ingred": ["2 tablespoons peanut oil", "1 tablespoon margarine", "1 large onion, chopped", "1 tablespoon minced fresh ginger root", "2 tablespoons minced garlic", "1 teaspoon ground cinnamon", "1 teaspoon ground black pepper", "2 tablespoons ground coriander", "2 tablespoons ground cumin", "1/4 teaspoon ground turmeric", "1 teaspoon cayenne pepper", "2 tomatoes", "2 serrano chile peppers, seeded", "1/2 cup fresh cilantro", "1/2 cup yogurt, whisked until smooth", "3 cups water"], "title": "Basic Curry Sauce", "instr": "Heat oil and margarine in a small skillet or wok over medium high heat. Add onion and saute until very brown, 10 to 15 minutes. (Note: This is an important step; if onion is not cooked well, sauce will taste funny.)\nAdd ginger and garlic to onion and saute for an additional 2 minutes. Process onion/ginger/garlic mixture in food processor until smooth. Do not rinse food processor.\nPlace onion mixture in a large saucepan. Stir in the cinnamon, black pepper, coriander, cumin, turmeric and cayenne pepper and cook over low heat until mixture is thick and has the consistency of a paste.\nPuree tomatoes, chile peppers and cilantro in food processor until smooth. Add to onion mixture and stir well over low heat, cooking off moisture from tomatoes and cilantro. Add yogurt a little bit at a time, stirring constantly to avoid curdling.\nBlend the whole mixture in food processor to puree it (for a very smooth sauce). Return to saucepan, add water and increase heat to high; bring sauce to a rolling boil. Cover saucepan and boil for 3 to 5 minutes. Reduce heat and simmer until desired consistency is reached.\nTo serve with meat, cook the meat first separately, then simmer for 5 to 10 minutes in the sauce before serving over rice or with bread. To serve with vegetables, steam raw veggies first 4 to 5 minutes, then simmer for 5 to 10 minutes in the sauce before serving.\n", "time": 45, "urlnum": "25881"}, {"ingred": ["1 pound ground beef", "1 cup fresh mushrooms, sliced", "1/2 white onion, diced", "2 cups beef gravy", "salt and pepper to taste", "3 small red bell peppers, halved and seeded", "3/4 cup shredded Monterey Jack cheese"], "title": "Beef and Mushroom Stuffed Peppers", "instr": "Preheat oven to 375 degrees F (190 degrees C).\nBrown beef in a large skillet over medium-high heat. Halfway through browning, add mushrooms and onion. Continue cooking until meat is fully browned; drain fat from skillet. Stir in enough gravy to bond mixture without making it soupy. Season with salt and pepper, and set aside.\nMeanwhile, heat a medium saucepan of water until boiling. Place peppers in water, and boil for 2 to 3 minutes, until just tender; remove from water. Place peppers, hollow side up, in a 9x13 inch baking dish, and fill each with beef mixture.\nBake in preheated oven for 15 to 20 minutes, until bubbling. Top with cheese, and bake for an additional 5 to 10 minutes. Serve in a small pool of gravy.\n", "time": 50, "urlnum": "25882"}, {"ingred": ["1 pound ground beef", "1 (15.25 ounce) can whole kernel corn", "1 (15 ounce) can green beans", "2 (4 ounce) jars mushrooms, drained", "1 (16 ounce) jar processed cheese sauce", "salt and pepper to taste"], "title": "Beefy Oven Packets", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nCut squares out of aluminum foil. Form beef into small, round flat hamburgers and place one (seasoned to taste) on each square. To each burger add a bit of corn, beans, mushrooms and a spoonfull of cheese sauce. Fold foil over so that there is no leaking during baking.\nBake in the preheated oven for 1 hour.\n", "time": 70, "urlnum": "25883"}, {"ingred": ["1 pound Italian sausage", "1 (8 ounce) can tomato sauce", "2 (10 ounce) packages frozen chopped spinach, thawed and drained", "2 cups cottage cheese", "1/2 cup grated Parmesan cheese", "1 egg, beaten", "2 cups shredded mozzarella cheese"], "title": "Spinach, Sausage and Cheese Bake", "instr": "Brown sausage in skillet over medium high heat. Drain fat from skillet and stir in tomato sauce. Set mixture aside.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the spinach, cottage cheese, Parmesan cheese and egg. Mix well and spread mixture in the bottom of a 9x13 inch baking dish. Spoon sausage mixture over spinach mixture and top with mozzarella cheese.\nBake in preheated oven for 40 minutes.\n", "time": 60, "urlnum": "25884"}, {"ingred": ["3 1/2 pounds lamb ribs", "2 onions, chopped", "1 cup dry white wine", "1/4 cup soy sauce", "1/4 cup fresh lemon juice", "1 tablespoon honey", "1 tablespoon olive oil", "2 teaspoons minced garlic", "1 teaspoon ground cinnamon", "1 teaspoon salt", "1 teaspoon ground black pepper"], "title": "Lamb Ribs with Honey and Wine", "instr": "Place lamb in a 9x13-inch baking dish.\nCombine onions, white wine, soy sauce, lemon juice, honey, olive oil, garlic, cinnamon, salt, and pepper in a small bowl. Mix well and pour mixture all over lamb. Cover with plastic wrap and marinate in the refrigerator for 1 hour.\nPreheat oven to 400 degrees F (200 degrees C).\nRoast lamb in the preheated oven until browned and tender, about 1 hour 10 minutes.\n", "time": 140, "urlnum": "25885"}, {"ingred": ["4 (1/2 pound) strip steaks, cut 1/2 inch thick", "salt to taste", "freshly ground black pepper to taste", "1 teaspoon dry mustard, divided", "1/4 cup margarine", "3 tablespoons lemon juice", "2 teaspoons minced fresh chives", "1 teaspoon Worcestershire sauce"], "title": "Steak Diane", "instr": "Pound steaks to be 1/4 inch thick, and sprinkle each side with salt, black pepper, and 1/8 teaspoon mustard; rub into the meat.\nMelt margarine in a large skillet over medium-high heat. Fry 2 of the steaks for 2 minutes on each side, and transfer to a hot serving plate. Repeat with remaining 2 steaks.\nAdd lemon juice, chives, Worcestershire sauce, and remaining mustard to the pan, and bring to a boil. Return the steaks to the pan to heat through, and coat with sauce.\n", "time": 40, "urlnum": "25886"}, {"ingred": ["2 tablespoons prepared horseradish", "1 tablespoon cider vinegar", "1 teaspoon dry mustard", "3 tablespoons reduced-fat mayonnaise", "1/8 teaspoon ground red pepper", "1/2 cup nonfat sour cream"], "title": "Horseradish Sauce", "instr": "In a small bowl whisk together horseradish, vinegar, mustard, mayonnaise, ground red pepper and sour cream.\n", "time": 5, "urlnum": "25887"}, {"ingred": ["1 cup broken dry spaghetti", "1 (15.25 ounce) can whole kernel corn", "1 cup shredded Cheddar cheese", "1 (15 ounce) can cream-style corn", "1/4 cup margarine, melted"], "title": "Baked Spaghetti Corn", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 1 1/2 quart casserole combine broken spaghetti, whole kernel corn, cheese, cream-style corn and margarine.\nBake in preheated oven for 20 to 25 minutes, or until spaghetti is cooked.\n", "time": 35, "urlnum": "25888"}, {"ingred": ["3 tablespoons butter", "2 large portobello mushrooms, sliced", "1 (10 ounce) package frozen chopped spinach, thawed and drained", "1/4 teaspoon dried basil", "1/4 teaspoon salt", "1/4 teaspoon black pepper", "1 clove garlic, chopped", "2 tablespoons dry red wine", "1/4 cup grated Parmesan cheese"], "title": "Sauteed Portobellos and Spinach", "instr": "Melt butter in a large skillet or saute pan over medium heat. Saute mushrooms, spinach, basil, salt, pepper and garlic until mushrooms are tender and spinach is heated through.\nPour in wine and reduce heat to low; simmer 1 minute. Stir in Parmesan cheese and serve.\n", "time": 20, "urlnum": "25889"}, {"ingred": ["7 large potatoes, peeled and cubed", "1 (10 ounce) package frozen chopped spinach, thawed and drained", "1 cup sour cream", "1/4 cup butter", "2 tablespoons chopped green onions", "2 teaspoons salt", "1/4 teaspoon black pepper", "1 cup shredded Cheddar cheese"], "title": "Potato Spinach Casserole", "instr": "Preheat oven to 400 degrees F (200 degrees C). Grease a 2 quart casserole dish.\nBring a large pot of salted water to a boil. Add potatoes and cook until tender, about 15 minutes. Drain and mash.\nIn a large bowl combine mashed potatoes, spinach, sour cream, butter, green onions, salt and pepper. Spoon into prepared dish.\nBake for 15 minutes. Top with cheese and bake 5 minutes longer.\n", "time": 40, "urlnum": "25890"}, {"ingred": ["3 pounds red potatoes, peeled and sliced", "6 ounces Gouda cheese, shredded, divided", "3 tablespoons butter", "5 cloves garlic, minced", "1 1/2 cups heavy cream", "1 teaspoon salt", "1/2 teaspoon black pepper"], "title": "Garlic Potatoes Gratin", "instr": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a 9x13 inch baking dish.\nIn the prepared dish layer 1/2 of the potatoes, 1/2 of the cheese, then the remaining potatoes.\nMelt the butter in a small skillet over medium heat. Saute garlic until fragrant and golden brown; pour over potatoes.\nCombine cream, salt and pepper; pour evenly over potatoes and sprinkle with remaining cheese.\nBake in preheated oven for 75 minutes. Serve immediately.\n", "time": 90, "urlnum": "25891"}, {"ingred": ["2 (10 ounce) packages frozen chopped spinach, thawed and drained", "1 (8 ounce) package cream cheese, softened", "1 (10.75 ounce) can condensed cream of mushroom soup", "1 (6 ounce) can French-fried onions, divided"], "title": "Spinach Casserole", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl combine spinach, cream cheese, mushroom soup and 1/2 of the fried onions; mix well. Transfer mixture to a 2 quart casserole dish and sprinkle with remaining fried onions.\nBake for 20 minutes, or until heated through.\n", "time": 30, "urlnum": "25892"}, {"ingred": ["1 (16 ounce) package frozen, chopped carrots", "1/2 cup light cream", "3 1/2 tablespoons prepared horseradish", "1 tablespoon grated onion", "1 cup mayonnaise", "1 teaspoon salt", "1/4 teaspoon black pepper", "1/4 cup melted butter", "1/2 cup crushed corn flake cereal"], "title": "Baked Zesty Carrots", "instr": "Preheat oven to 350 degrees F (175 degrees C). Place carrots in a 9x13 inch baking dish.\nIn a medium bowl combine cream, horseradish, onion, mayonnaise, salt and pepper. Pour mixture over carrots.\nCombine melted butter and corn flakes; sprinkle over carrots.\nBake in preheated oven for 15 to 20 minutes, or until heated through.\n", "time": 30, "urlnum": "25893"}, {"ingred": ["1 1/4 (16 ounce) packages frozen corn kernels", "1 (8 ounce) package cream cheese", "1/2 cup butter", "1/2 cup milk", "1 tablespoon white sugar", "salt and pepper to taste"], "title": "Slow Cooker Creamed Corn", "instr": "In a slow cooker, combine corn, cream cheese, butter, milk, and sugar. Season with salt and pepper to taste.\nCook on High for 2 to 4 hours, or on Low for 4 to 6 hours.\n", "time": 250, "urlnum": "25894"}, {"ingred": ["5 pounds red potatoes, cut into chunks", "1 tablespoon minced garlic, or to taste", "3 cubes chicken bouillon", "1 (8 ounce) container sour cream", "1 (8 ounce) package cream cheese, softened", "1/2 cup butter", "salt and pepper to taste"], "title": "Slow Cooker Mashed Potatoes", "instr": "In a large pot of lightly salted boiling water, cook the potatoes, garlic, and bouillon until potatoes are tender but firm, about 15 minutes. Drain, reserving water. In a bowl, mash potatoes with sour cream and cream cheese, adding reserved water as needed to attain desired consistency.\nTransfer the potato mixture to a slow cooker, cover, and cook on Low for 2 to 3 hours. Just before serving, stir in butter and season with salt and pepper to taste.\n", "time": 210, "urlnum": "25895"}, {"ingred": ["1/2 cup white vinegar", "1/2 cup salad oil", "1/2 cup white sugar", "1 teaspoon garlic powder", "1 small red onion, sliced", "2 (14.5 ounce) cans French-style green beans, drained", "1 (14.5 ounce) can bean sprouts, drained"], "title": "Good Good Green Beans", "instr": "In a large bowl, combine vinegar, oil, sugar, garlic powder, onion, green beans and bean sprouts. Cover and marinate overnight in the refrigerator.\n", "time": 730, "urlnum": "25896"}, {"ingred": ["2 cups uncooked long-grain rice", "1 (4.5 ounce) can mushrooms, with liquid", "2 stalks celery, finely chopped", "1 red bell pepper, finely chopped", "1 (1 ounce) package dry onion soup mix", "1 (10.5 ounce) can beef broth", "1/2 cup vegetable oil", "1 cup water", "3 tablespoons soy sauce"], "title": "One Bowl Rice", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 9x13 inch baking dish, combine rice, mushrooms, celery, red bell pepper, onion soup mix, beef broth, oil, water and soy sauce.\nBake, covered, in preheated oven for 45 minutes, or until all liquid is absorbed and rice is cooked.\n", "time": 60, "urlnum": "25897"}, {"ingred": ["4 (10 ounce) cans diced tomatoes with green chile peppers, drained", "12 fresh jalapeno peppers, seeded", "1 onion, cut into chunks", "1 (4 ounce) can chopped green chile peppers, drained", "1 sprig fresh cilantro, chopped", "garlic powder to taste", "salt to taste"], "title": "Saundra's Hot Sauce", "instr": "In a food processor, combine diced tomatoes with chiles, jalapenos and onion; process until desired texture is achieved. Transfer to a bowl and stir in the can of green chiles, cilantro, garlic powder and salt.\n", "time": 15, "urlnum": "25898"}, {"ingred": ["3/4 cup water", "1 cube chicken bouillon", "1 pound carrots, peeled and julienned", "2 tablespoons butter", "1 cup chopped celery", "1 (4.5 ounce) can mushrooms, drained", "1/4 cup chopped onion", "2 tablespoons all-purpose flour", "1/4 teaspoon salt", "1/4 teaspoon dried tarragon", "1 dash black pepper", "2/3 cup milk"], "title": "Creamed Carrot Strips", "instr": "Heat water in a large saucepan over medium-high heat. Dissolve bouillon in hot water and add carrots; cover and boil gently for 10 minutes.\nMeanwhile, melt butter in a large skillet over medium heat. Saute celery, mushrooms and onion until tender. Stir in flour, salt, tarragon and pepper. Gradually stir in milk and carrots with the broth they were boiled in.\nCook over medium heat, stirring occasionally, until mixture comes to a boil and thickens.\n", "time": 30, "urlnum": "25899"}, {"ingred": ["3 medium small yellow squash, cubed", "3 small zucchini, cubed", "1 (10 ounce) can diced tomatoes with green chile peppers", "1/2 onion, chopped", "salt to taste", "garlic powder to taste"], "title": "Zesty Zucchini and Squash ", "instr": "In a large saucepan, combine squash, zucchini, tomatoes with chiles, onion, salt and garlic powder. Bring to a boil over medium-high heat.\nReduce heat to low and cook until tender-crisp.\n", "time": 40, "urlnum": "25900"}, {"ingred": ["1/2 cup mayonnaise", "2 teaspoons ketchup", "2 tablespoons prepared horseradish", "1/4 teaspoon paprika", "1/4 teaspoon salt", "1/8 teaspoon dried oregano", "1 dash ground black pepper", "cayenne pepper to taste"], "title": "Dipping Sauce", "instr": "In a small bowl combine mayonnaise, ketchup, horseradish, paprika, salt, oregano, black pepper and cayenne pepper. Store, covered, in the refrigerator.\n", "time": 5, "urlnum": "25901"}, {"ingred": ["2 tablespoons butter", "1 pound fresh mushrooms, sliced", "2 (10 ounce) packages fresh spinach, rinsed and stems removed", "1 teaspoon salt", "4 tablespoons butter, melted", "1/4 cup finely chopped onion", "1 1/2 cups shredded Cheddar cheese, divided"], "title": "Spinach and Mushroom Casserole", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart casserole dish.\nMelt 2 tablespoons butter in a large skillet over medium heat. Saute mushrooms until tender, about 8 to 10 minutes.\nMeanwhile, place spinach in a large pot. Wilt over medium heat; drain, squeezing or pressing out excess water. Place in prepared baking dish and top with salt, 4 tablespoons melted butter, onion and 1/2 of the cheese. Layer mushrooms on top and sprinkle with remaining cheese.\nBake in preheated oven for 20 minutes.\n", "time": 40, "urlnum": "25902"}, {"ingred": ["1 (8 ounce) package uncooked elbow macaroni", "1 pound processed cheese, cubed", "1 (15 ounce) can mixed vegetables, drained", "1 (10.75 ounce) can condensed cream of mushroom soup", "1 pound kielbasa sausage, sliced"], "title": "Macaroni and Cheese Casserole", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain.\nIn a large bowl combine macaroni, processed cheese, mixed vegetables, mushroom soup, 1/2 of a soup can of water and sausage. Transfer to a 9x13 inch baking dish.\nBake, covered with aluminum foil, for 20 to 25 minutes.\n", "time": 40, "urlnum": "25903"}, {"ingred": ["24 kiwis, peeled and mashed", "3/4 cup pineapple juice", "1/4 cup fresh lemon juice", "3 apples, unpeeled and halved", "4 cups white sugar"], "title": "Kiwi Jam", "instr": "In a large saucepan, combine 3 cups mashed kiwi, pineapple juice, lemon juice and apples. Bring to a boil and then add the sugar; stir to dissolve, reduce heat and simmer for 30 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.\n", "time": 760, "urlnum": "25904"}, {"ingred": ["1 quart water", "2 cups uncooked long-grain white rice", "2 tablespoons chicken broth", "1 tablespoon minced garlic", "1 green bell pepper, chopped", "1 small yellow onion, chopped", "1 (15 ounce) can cream-style corn", "1 (11 ounce) can Mexican-style corn, drained", "1 (11 ounce) can whole kernel corn, drained", "1 (10 ounce) can diced tomatoes with green chile peppers, with liquid", "1 (4 ounce) can chopped green chile peppers, drained", "1 (8 ounce) package Mexican-style processed cheese food, cubed", "1/2 teaspoon salt", "1/4 teaspoon black pepper", "1/2 teaspoon chili powder", "3/4 cup shredded reduced-fat Cheddar cheese"], "title": "Cheesy Mexi-Rice Casserole", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 3 1/2 quart casserole dish.\nIn a saucepan, bring water to a boil. Stir in rice, reduce heat, and cover. Simmer for 20 minutes.\nIn a wok or large skillet, heat the broth and saute the garlic, bell pepper and onion until tender, about 5 minutes. Stir in cooked rice, cream-style corn, Mexican-style corn, whole kernel corn, diced tomatoes with chiles, green chiles, Mexican-style processed cheese, salt, pepper and chili powder. Spoon into prepared casserole dish.\nBake in preheated oven for 30 minutes, or until bubbly. Top with shredded Cheddar, cover and bake 5 minutes more. Remove from oven, uncover and let stand 10 minutes.\n", "time": 75, "urlnum": "25905"}, {"ingred": ["1 tablespoon olive oil", "1 onion, finely chopped", "6 cloves garlic, finely chopped", "6 links spicy pork sausage, sliced", "1 cup water", "2 pounds frozen green beans", "seasoning salt to taste"], "title": "Awesome Green Beans", "instr": "Heat oil in a large saucepan over medium heat. Saute onion and garlic until tender. Stir in sausage and cook until evenly brown.\nPour in water and bring to a boil. Stir in green beans; reduce heat to medium-low, cover and simmer until tender, about 30 minutes. Check water level often and add more as needed to prevent scorching. Season with salt to taste.\n", "time": 60, "urlnum": "25906"}, {"ingred": ["1/2 cup butter", "1/4 cup grated fresh ginger root", "1 1/2 tablespoons minced garlic", "1/2 cup chopped green onions", "1 1/2 teaspoons dried basil", "1 teaspoon black pepper", "1 dash red pepper flakes", "1/3 cup grated Parmesan cheese"], "title": "Buttered Ginger Sauce", "instr": "Melt butter in a small saucepan over medium heat. Stir in ginger, garlic, green onions, basil, black pepper and red pepper flakes; cook for 5 minutes. Stir in Parmesan cheese and cook until well blended.\n", "time": 25, "urlnum": "25907"}, {"ingred": ["1 (16 ounce) package creamed cottage cheese", "4 eggs, beaten", "1/4 cup vegetable oil", "1 (1 ounce) envelope dry onion soup mix", "1 cup finely chopped walnuts", "1 1/2 cups cornflakes cereal"], "title": "Cottage Cheese Roast", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan.\nIn a large bowl, combine cottage cheese, eggs, vegetable oil, soup mix, walnuts and cereal. Spoon into prepared pan.\nBake in preheated oven for 35 to 40 minutes.\n", "time": 50, "urlnum": "25908"}, {"ingred": ["1 tablespoon olive oil", "1 onion, diced", "1 (15 ounce) can pinto beans, drained", "3 tablespoons tomato paste", "chili powder to taste", "1 cup vegetable broth"], "title": "Vegan Refried Beans", "instr": "Heat oil in a medium skillet over medium heat. Saute onions until tender. Stir in beans, tomato paste, chili powder and vegetable broth. Cook 5 minutes, or until stock has reduced. Mash with a potato masher.\n", "time": 15, "urlnum": "25909"}, {"ingred": ["2 tablespoons corn oil", "1 (8 ounce) package tempeh, broken into bite-sized pieces", "2 tablespoons soy sauce", "1 tablespoon lime juice", "1 1/2 cups chopped green bell pepper", "1 (4.5 ounce) can sliced mushrooms, drained", "1/2 cup frozen chopped spinach, thawed and drained", "1 tablespoon chopped green chile peppers", "1 tablespoon chopped fresh cilantro", "1 tablespoon dried minced onion"], "title": "Tempeh Fajitas", "instr": "Heat oil in a large skillet over medium heat. Saute tempeh with soy sauce and lime juice until tempeh browns. Stir in bell peppers, mushrooms, spinach, chile peppers, cilantro and dried onion.\nIncrease heat to medium-high and cook until fluids have reduced, stirring occasionally.\n", "time": 25, "urlnum": "25910"}, {"ingred": ["2 tablespoons olive oil", "2 tablespoons balsamic vinegar", "4 ripe tomatoes, sliced", "3 tablespoons mayonnaise", "1/2 teaspoon dried parsley", "1/4 teaspoon dried oregano", "1/4 teaspoon black pepper", "3 tablespoons grated Parmesan cheese, divided", "4 slices bread, lightly toasted"], "title": "Mama's Best Broiled Tomato Sandwich", "instr": "Preheat oven to broil.\nIn a shallow bowl, whisk together the olive oil and vinegar. Marinate the tomatoes in the mixture, stirring occasionally.\nMeanwhile, in a small bowl, combine mayonnaise, parsley, oregano, black pepper and 4 teaspoons Parmesan cheese. Spread mixture on each slice of toasted bread. Place marinated tomatoes on 2 slices and sprinkle with remaining Parmesan cheese.\nPlace on a baking sheet and broil for 5 minutes, or until cheese turns golden brown. Serve immediately, open faced or closed.\n", "time": 15, "urlnum": "25911"}, {"ingred": ["6 potatoes", "8 eggs", "seasoning salt to taste", "1 cup margarine", "1 (16 ounce) container sour cream"], "title": "Potato and Egg Casserole", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool, peel and slice.\nPlace eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and slice.\nIn a 9x13 inch casserole dish layer potatoes and eggs, sprinkling each layer of eggs with seasoning salt, ending with potatoes.\nIn a small saucepan over low heat, melt margarine with sour cream. Pour over potatoes and sprinkle lightly with seasoning salt.\nBake in preheated oven for 30 minutes.\n", "time": 75, "urlnum": "25912"}, {"ingred": ["1 1/2 cups uncooked instant rice", "1 tablespoon sesame oil", "soy sauce to taste", "2 eggs, beaten", "1 teaspoon finely chopped fresh ginger root", "1/4 cup finely chopped green onions"], "title": "Poor Man's Fried Rice", "instr": "Bring water to a boil in a medium saucepan. Stir in rice and cover. Remove from heat and let stand 5 minutes. Fluff with a fork and drain any excess water.\nHeat oil in a large skillet over medium heat. Stir in rice and soy sauce; heat briefly then transfer rice to a bowl.\nScramble the eggs in the same skillet, then stir in rice. Stir in ginger and green onions; heat through and serve.\n", "time": 30, "urlnum": "25913"}, {"ingred": ["5 large potatoes, chopped", "3 carrots, peeled and sliced", "1 onion, chopped", "1 green bell pepper, chopped", "1 (15.25 ounce) can whole kernel corn", "3 cups water", "3 cubes vegetable bouillon"], "title": "Potato Medley", "instr": "In a large pot over high heat, combine potatoes, carrots, onion, green bell pepper, corn and water. Boil until tender, then add bouillon.\nReduce heat to medium and simmer for 10 minutes.\n", "time": 30, "urlnum": "25914"}, {"ingred": ["1/4 cup olive oil", "2 cups chopped onion", "2 tablespoons wheat bran", "1 cup oat bran", "1 cube vegetable bouillon", "1/2 cup hot water", "1 (8 ounce) package shredded Cheddar cheese", "1 teaspoon dried marjoram", "1 teaspoon ground sage", "1 (.75 ounce) packet instant gravy mix", "1 tablespoon prepared horseradish"], "title": "Rissoles", "instr": "Heat oil in a large skillet over medium heat and saute onions until transparent. Stir in wheat bran and oat bran. Meanwhile, dissolve bouillon in hot water.\nStir cheese, marjoram and sage into onion mixture. When cheese is melted, gradually stir in enough bouillon water to create a moist batter. Remove from heat and refrigerate for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Form mixture into patties and place on a baking sheet.\nBake in preheated oven for 15 minutes.\nPrepare gravy according to package directions and add horseradish.\n", "time": 60, "urlnum": "25915"}, {"ingred": ["3 (14.5 ounce) cans vegetable broth", "3/4 cup small seashell pasta", "1 tablespoon olive oil", "1 onion, chopped", "2 cloves garlic, minced", "1 (15 ounce) can garbanzo beans, drained and rinsed", "1 (28 ounce) can whole peeled tomatoes, chopped, juice reserved", "1/2 teaspoon dried basil", "1/2 teaspoon dried thyme", "salt and pepper to taste"], "title": "Garbanzo Tomato Pasta Soup", "instr": "Bring vegetable broth to a boil in a large pot. Add pasta and cook for 8 to 10 minutes or until al dente.\nMeanwhile, heat oil in a small skillet over medium heat. Saute onions and garlic until translucent. Stir into pasta and add garbanzo beans, tomatoes, basil, thyme, salt and pepper. Heat through and serve.\n", "time": 30, "urlnum": "25916"}, {"ingred": ["1/2 cup dry kidney beans, soaked overnight", "1/2 cup dry white beans, soaked overnight", "1/2 cup dry brown lentils, soaked overnight", "6 cups chopped fresh tomatoes", "6 cups water", "1 cup chopped fresh mushrooms", "1/2 cup chopped green bell pepper", "1/2 cup chopped red bell pepper", "1/2 cup fresh green beans", "1/2 cup chopped celery", "1/4 onion, chopped", "1/4 red onion, chopped", "3/4 cup extra firm tofu, drained, crumbled", "salt to taste", "black pepper to taste", "onion powder to taste", "garlic powder to taste", "chili powder to taste"], "title": "Vegan Chunky Chili", "instr": "Drain and rinse kidney beans, white beans and lentils. Combine in a large pot and cover with water; boil over medium-high to high heat for 1 hour, or until tender.\nMeanwhile, in a large saucepan over high heat, combine tomatoes and water; bring to a boil. Reduce heat to low and simmer, uncovered, for 1 hour, or until tomatoes are broken down.\nStir the tomatoes into the beans and add mushrooms, green bell pepper, red bell pepper, green beans, celery, onions and tofu. Season with salt, pepper, onion powder, garlic powder and chili powder to taste. Simmer for 2 to 3 hours, or until desired consistency is reached.\n", "time": 980, "urlnum": "25917"}, {"ingred": ["1 cup uncooked white rice", "2 tablespoons vegetable oil", "1 (10 ounce) package frozen green bell peppers and onions", "1 (15 ounce) can black beans, undrained", "1 (10 ounce) can enchilada sauce"], "title": "Jamie's Black Beans and Rice", "instr": "In a saucepan bring 2 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nMeanwhile, heat oil in a large skillet over medium heat. Saute peppers and onions until tender. Stir in beans and enchilada sauce; simmer 15 minutes. Serve over cooked rice.\n", "time": 30, "urlnum": "25918"}, {"ingred": ["2 (8 ounce) cans artichoke hearts, drained and chopped", "2 (4 ounce) cans green chile peppers, drained and chopped", "1 (4 ounce) jar pimento peppers, drained and chopped", "1 1/2 cups mayonnaise", "1/2 (8 ounce) package shredded Monterey Jack cheese", "1/2 cup grated Parmesan cheese, divided"], "title": "Hot Artichoke Dip", "instr": "In an oven safe bowl, combine artichoke hearts, chile peppers, pimento peppers, mayonnaise, Monterey Jack cheese and almost all of the Parmesan cheese; sprinkle remaining Parmesan cheese on top. Refrigerate for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven for 30 minutes, or until lightly browned.\n", "time": 105, "urlnum": "25919"}, {"ingred": ["4 zucchini, halved", "1 tablespoon olive oil", "1 onion, chopped", "2 cloves garlic, crushed", "1/2 (8 ounce) package button mushrooms, sliced", "1 teaspoon ground coriander", "1 1/2 teaspoons ground cumin, or to taste", "1 (15.5 ounce) can chickpeas, rinsed and drained", "1/2 lemon, juiced", "2 tablespoons chopped fresh parsley", "sea salt to taste", "ground black pepper to taste"], "title": "Zucchini with Chickpea and Mushroom Stuffing", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a shallow baking dish.\nScoop out the flesh of the zucchini; chop the flesh and set aside. Place the shells in the prepared dish.\nHeat oil in a large skillet over medium heat. Saute onions for 5 minutes, then add garlic and saute 2 minutes more. Stir in chopped zucchini and mushrooms; saute 5 minutes. Stir in coriander, cumin, chickpeas, lemon juice, parsley, salt and pepper. Spoon mixture into zucchini shells.\nBake in preheated oven for 30 to 40 minutes, or until zucchini are tender.\n", "time": 60, "urlnum": "25920"}, {"ingred": ["1 cup packed fresh spinach", "1 cup packed fresh basil", "3/4 cup pine nuts", "1/2 cup walnuts", "24 small black olives", "4 cloves garlic", "1 cup grated Parmesan cheese", "1/2 cup grated Romano cheese", "1 cup olive oil", "1 dash black pepper"], "title": "Pesto Del Sol", "instr": "In a food processor, blend spinach, basil, pine nuts, walnuts, olives and garlic. Blend in Parmesan cheese and Romano cheese. Gradually add oil, processing until smooth; season with pepper. Serve at room temperature.\n", "time": 20, "urlnum": "25921"}, {"ingred": ["2 cups water", "1 cup quinoa", "1 pinch salt", "1/4 cup olive oil", "1/2 teaspoon sea salt", "1/4 cup lemon juice", "3 tomatoes, diced", "1 cucumber, diced", "2 bunches green onions, diced", "2 carrots, grated", "1 cup fresh parsley, chopped"], "title": "Quinoa Tabbouleh", "instr": "In a saucepan bring water to a boil. Add quinoa and a pinch of salt. Reduce heat to low, cover and simmer for 15 minutes. Allow to cool to room temperature; fluff with a fork.\nMeanwhile, in a large bowl, combine olive oil, sea salt, lemon juice, tomatoes, cucumber, green onions, carrots and parsley. Stir in cooled quinoa.\n", "time": 30, "urlnum": "25922"}, {"ingred": ["1/2 (8 ounce) package spaghetti", "3 skinless, boneless chicken breast halves", "1 onion, chopped", "8 ounces fresh mushrooms, quartered", "1 cube chicken bouillon", "water to cover", "salt and pepper to taste", "4 cups heavy cream", "1/4 cup grated Parmesan cheese"], "title": "Mushroom Chicken Tetrazzini", "instr": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Meanwhile, cook chicken in microwave until almost cooked through (juices run almost clear).\nPreheat oven to 325 degrees F (165 degrees C).\nSaute onion and mushrooms in a medium saucepan until soft. Add chicken, bouillon and water to cover. Simmer over medium low heat, seasoning with salt and pepper to taste. Add cooked spaghetti and cream and mix all together; finally, stir in the cheese.\nBake in preheated oven for 20 to 30 minutes, or until cooked through. Halfway through cooking, check dish and add more Parmesan cheese if desired, to taste.\n", "time": 35, "urlnum": "25923"}, {"ingred": ["1/4 cup vegetable oil, divided", "1 red onion, cut into strips", "1 (2 to 3 pound) whole chicken, cut into 8 pieces", "3/4 cup all-purpose flour", "1/8 teaspoon salt", "1/8 teaspoon ground black pepper", "1 tablespoon crushed red pepper flakes", "2 cups water", "1 cup cider vinegar"], "title": "Colonel Jackson's Smothered Chicken", "instr": "Heat 1 tablespoon oil in a large skillet and saute onion until tender. Remove and set aside.\nPlace flour, salt and pepper in a large, clean grocery bag. Add chicken, close bag tightly and shake to coat. Let sit 5 minutes. Remove chicken from bag, reserving leftover flour in bag. Heat remaining oil in skillet and brown chicken on all sides in hot oil. Remove chicken from skillet and place in a deep roasting pan.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat reserved flour in skillet over medium high heat, stirring constantly, to make a dark roux. Slowly stir in pepper flakes, water and vinegar. Finally stir in reserved sauteed onion. Mix well and pour mixture over chicken.\nCover dish and bake in preheated oven for about 35 to 45 minutes, or until chicken is tender and cooked through (no longer pink inside). Note: If gravy is too thick, add water to pan, a little at a time, until desired consistency is reached.\n", "time": 60, "urlnum": "25924"}, {"ingred": ["1 (11 ounce) can condensed cheese soup", "1/2 (10.75 ounce) can water", "1 teaspoon dried parsley", "3 skinless, boneless chicken breast halves", "6 potatoes, sliced", "1 head fresh broccoli, chopped"], "title": "Easy Cheesy Chicken Bake", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl combine soup with water and parsley and mix together. Place chicken and potatoes in a 9x13 inch baking dish and pour cheese mixture over all. Cover dish with aluminum foil.\nBake, covered, in preheated oven for 60 minutes. Add broccoli to dish and bake for another 10 to 15 minutes, or until cooked through and tender.\n", "time": 70, "urlnum": "25925"}, {"ingred": ["4 pounds skinless, boneless chicken breast halves", "1 (16 ounce) can whole cranberry sauce", "1 (20 ounce) can crushed pineapple, drained", "1/2 teaspoon ground cinnamon"], "title": "Pineapple Cranberry Chicken", "instr": "Preheat oven to 375 degrees F (190 degrees C).\nPlace chicken in a lightly greased 9x13 inch baking dish and pierce with a fork. Layer cranberry sauce and pineapple over chicken and sprinkle with cinnamon.\nCover dish and bake in the preheated oven for 25 minutes. Remove cover and bake for another 15 minutes, or until chicken is cooked through (juices run clear).\n", "time": 45, "urlnum": "25926"}, {"ingred": ["5 tablespoons olive oil, divided", "1 (8 ounce) package sliced fresh mushrooms", "1 onion, chopped", "2 cloves garlic, chopped", "1 pound large shrimp, peeled and deveined", "1 1/4 teaspoons salt, divided", "4 skinless, boneless chicken breast halves - cut into 1 inch cubes", "3 tablespoons all-purpose flour, divided", "1/4 cup dry white wine", "1 1/4 cups water", "ground black pepper to taste"], "title": "Chicken and Shrimp", "instr": "Heat 1 tablespoon oil in a large skillet over medium high heat. Saute mushrooms until golden; remove from skillet with a slotted spoon and set aside.\nAdd another 2 tablespoons oil to skillet. Saute onion, garlic and shrimp until opaque. Remove from skillet and add to mushrooms.\nIn a shallow dish or bowl mix 2 tablespoons flour with 3/4 teaspoon salt. Dredge chicken in flour to coat. Add 1 tablespoon oil to skillet and saute chicken in oil for 3 to 5 minutes or until no longer pink. Add chicken to mushroom/shrimp mixture.\nHeat 1 tablespoon oil in skillet and stir in 1 tablespoon flour. Cook about 30 seconds, stirring constantly, until brown. Stir in wine, 1/2 teaspoon salt and water. Boil for 1 minute.\nReduce heat to medium low and return shrimp and chicken mixture to skillet. Simmer for about 10 minutes, season with pepper and serve.\n", "time": 40, "urlnum": "25927"}, {"ingred": ["3 cloves garlic, finely chopped", "1 tablespoon finely chopped fresh ginger root", "1 teaspoon chile paste", "1/2 cup orange juice", "1 tablespoon sherry (optional)", "2 tablespoons soy sauce", "2 teaspoons cider vinegar", "1 teaspoon white sugar", "2 teaspoons cornstarch", "2 tablespoons cold water", "2 tablespoons peanut oil, divided", "4 skinless, boneless chicken breast halves - cut into strips", "6 green onions, chopped into 1 inch pieces", "2 green bell peppers, cut into 1 inch pieces", "1 small onion, diced", "1 tablespoon grated orange zest", "1/3 cup finely chopped peanuts"], "title": "Go Girl Hot Szechwan Chicken", "instr": "In a small bowl combine the garlic, ginger and chile paste. Mix together and set aside. In a second bowl mix together the orange juice, sherry, soy sauce and vinegar and sugar. In a third bowl combine the cornstarch with the water and mix until dissolved.\nHeat 1 tablespoon oil in a large skillet over medium high heat. Saute chicken for about 3 minutes, until browned. Remove from skillet and set aside.\nHeat 1 teaspoon oil in skillet and saute green onion, bell pepper and onion for about 3 minutes. Stir in garlic/ginger mixture and saute for 1 minute, stirring constantly. Add chicken and orange juice mixture and cook, stirring, for 2 minutes. Finally, stir in orange zest and cornstarch mixture. Heat through, stirring slowly, until sauce is clear and thick. Sprinkle with peanuts and serve.\n", "time": 30, "urlnum": "25928"}, {"ingred": ["4 skinless, boneless chicken breast halves", "1 cup lime juice", "3/4 cup lemon juice", "3/4 cup orange juice", "1/2 cup pineapple juice", "1/2 cup cherry juice"], "title": "Tropical Chicken II", "instr": "Preheat outdoor grill for medium high heat and lightly oil grate; OR preheat oven to Grill/Broil.\nPlace chicken on grill/grate. In a medium bowl mix together the lime juice, lemon juice, orange juice, pineapple juice and cherry juice. Pour mixture over chicken a little bit at a time; turn after 5 to 7 minutes and repeat. Cook until chicken is cooked through (juices run clear), about 15 minutes.\n", "time": 30, "urlnum": "25929"}, {"ingred": ["2 boneless chicken breast halves, cooked and cubed", "3/4 cup mayonnaise", "1/4 cup chopped celery", "chopped fresh cilantro to taste", "1 (1 ounce) package taco seasoning mix"], "title": "Simple Southwestern Chicken Salad", "instr": "In a medium bowl, combine the chicken, mayonnaise, celery, cilantro and seasoning mix. Mix well.\nCover bowl and refrigerate for 1 hour.\n", "time": 70, "urlnum": "25930"}, {"ingred": ["1 cup fresh broccoli florets", "1 tablespoon butter", "2 pounds skinless, boneless chicken breast meat - cubed", "1 1/2 cups sliced fresh mushrooms", "3 teaspoons all-purpose flour", "2/3 cup water", "1/3 cup undiluted, thawed orange juice concentrate", "2 cubes chicken bouillon", "1 (11 ounce) can mandarin orange segments, drained", "1/4 cup sliced green onion"], "title": "Mandarin Chicken Skillet", "instr": "Place broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain, cool and set aside.\nHeat butter in a large skillet over medium high heat. Saute chicken in butter until browned. Remove from skillet and set aside.\nSaute mushrooms in skillet for 1 minute; remove from skillet and set aside. Stir in flour, water, orange juice concentrate and seasoning.\nHeat to boiling, stirring. Simmer, stirring, for 4 minutes. Return chicken and mushrooms to skillet; stir in orange segments, green onion and broccoli. Heat through and serve.\n", "time": 35, "urlnum": "25931"}, {"ingred": ["3 tablespoons butter", "1 (3 pound) chicken, cut into pieces", "1 (14 ounce) jar red currant jelly", "1/2 cup yellow mustard", "1/2 cup blanched slivered almonds", "3 tablespoons brown sugar", "2 tablespoons lemon juice", "1/2 teaspoon ground cinnamon"], "title": "Spicy Almond Chicken", "instr": "Melt butter in a large skillet over medium heat. Add chicken and saute for about 10 minutes, or until lightly browned on all sides. Remove chicken from skillet and place in a 9x13 inch baking dish. Set aside.\nPreheat oven to 350 degrees F (175 degrees C).\nTo skillet add jelly, mustard, almonds, sugar, juice and cinnamon. Stir together and cook over medium heat, stirring constantly, until jelly dissolves. Pour mixture over chicken.\nCover dish and bake in the preheated oven for 30 minutes. Remove cover and bake an additional 10 minutes, or until chicken is cooked through (no longer pink inside).\n", "time": 55, "urlnum": "25932"}, {"ingred": ["1 pound skinless, boneless chicken breast meat", "1/2 cup Italian-style salad dressing", "1 teaspoon fresh lime juice", "1 1/2 teaspoons honey"], "title": "Restaurant-Style Chicken Tenderloins", "instr": "Slice chicken into thin strips. In a small bowl mix together the dressing, lime juice and honey. Place chicken strips in a 9x13 inch baking dish and pour mixture over chicken, covering all. Cover dish and refrigerate to marinate for 1 hour.\nRemove chicken from marinade, discarding any remaining marinade. Heat oil in a large skillet over medium heat and saute chicken strips until lightly browned and cooked through (juices run clear), 12 to 15 minutes.\n", "time": 30, "urlnum": "25933"}, {"ingred": ["2 (10.75 ounce) cans condensed cream of chicken soup", "2 (10.75 ounce) cans condensed cream of mushroom soup", "1 (16 ounce) container sour cream", "1 cup cream sherry", "6 skinless, boneless chicken breast halves"], "title": "Sherry Wine Sauce Chicken", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 9x13 inch baking dish, combine the cream of chicken soup, cream of mushroom soup, sour cream and sherry. Mix all together. Add the chicken breasts and immerse them in the sauce.\nBake in the preheated oven, uncovered, for about 45 minutes or until chicken is cooked through (no longer pink inside).\n", "time": 50, "urlnum": "25934"}, {"ingred": ["2 tablespoons butter", "1 large yellow onion, chopped", "2 cloves garlic, minced", "1 pound boneless chicken thighs", "1 cup low-sodium chicken broth", "1 (10 ounce) package frozen mixed vegetables", "1/2 teaspoon dried sage", "1/2 teaspoon dried thyme", "1 1/2 cups self-rising flour", "3 tablespoons chopped fresh parsley", "3 tablespoons shortening", "2/3 cup buttermilk"], "title": "Easy Chicken and Dumplings", "instr": "Melt butter in a large saucepan or pot over medium heat. Saute onion and garlic for 5 minutes, then stir in chicken and saute until browned, about 7 to 10 minutes. Stir in broth, vegetables, sage and thyme; mix all together and let simmer over medium heat while preparing the dumplings.\nIn a medium bowl, mix flour and parsley together. Add shortening and stir mixture into a coarse, mealy dough. Stir in buttermilk, a little bit at a time, until dough holds together and is soft but firm. (If needed, add up to 2 tablespoons more buttermilk).\nBring chicken mixture to a boil over medium high heat and drop round spoonfuls of dumpling mixture on top (do not let dumplings touch each other). Reduce heat to low, cover pot and let simmer for 10 to 12 minutes.\n", "time": 55, "urlnum": "25935"}, {"ingred": ["2 cups chopped onion", "2 cups cubed, cooked boneless chicken breast meat", "1 cup chopped celery", "2 cups whole peeled tomatoes, with liquid", "2 cups sliced carrots", "5 cups chicken broth", "1 cup sweet corn", "1 cup peas", "1 cup sliced zucchini"], "title": "Harvested Chicken Stew", "instr": "In a large soup pot combine the onion, chicken, celery, tomatoes with liquid, carrots, broth, corn, peas and zucchini. Stir together and simmer over medium low heat for 1/2 hour, or until vegetables are cooked and tender.\n", "time": 45, "urlnum": "25936"}, {"ingred": ["4 skinless, boneless chicken breast halves", "4 hard-cooked eggs, sliced", "2 cups chopped celery", "3/4 cup creamy salad dressing, e.g. Miracle Whip ™", "2 tablespoons orange juice", "3/4 (10.75 ounce) can condensed cream of chicken soup", "1/2 teaspoon poultry seasoning", "1 teaspoon onion salt", "1 (4 ounce) jar diced pimento peppers, drained", "1/2 cup blanched slivered almonds", "1 1/2 cups shredded sharp Cheddar cheese", "1 1/2 cups crushed potato chips"], "title": "Hot Chicken Salad V", "instr": "Boil chicken in lightly salted boiling water for 40 minutes. Drain, cool and cut into medium size pieces.\nIn a large bowl combine chicken, celery, eggs, salad dressing, orange juice, soup, seasoning, onion salt and pimentos. Mix well and spread mixture into a 9x13 inch baking dish. Sprinkle with almonds, cheese and potato chips. Refrigerate overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nBake casserole in preheated oven for 45 minutes.\n", "time": 90, "urlnum": "25937"}, {"ingred": ["8 ounces dry fettuccini pasta", "1 cup milk", "2 tablespoons all-purpose flour", "1 cup cottage cheese", "1/2 teaspoon garlic powder", "3 teaspoons minced onion", "salt and pepper to taste", "1/2 cup grated Parmesan cheese", "2 cups diced, cooked chicken breast meat"], "title": "Easy Chicken Alfredo II", "instr": "Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water for 8 to 10 minutes, or until al dente; drain, and set aside.\nIn a food processor, place the milk, flour, cottage cheese, garlic powder, onion, salt and pepper, and Parmesan cheese. Blend until smooth.\nTransfer the blended mixture to a saucepan over medium heat. Mix in the chicken, and cook until heated through. Serve hot over pasta.\n", "time": 30, "urlnum": "25938"}, {"ingred": ["3 pounds skinless, boneless chicken breast meat", "1 (10.75 ounce) can condensed cream of chicken soup", "1 (10.75 ounce) can condensed cream of celery soup", "1 (10.75 ounce) can milk", "1 1/2 cups chicken broth", "1 (6 ounce) package seasoned cornbread stuffing mix"], "title": "Aunt Jewel's Chicken Dressing Casserole", "instr": "Place chicken in a large saucepan full of lightly salted water. Bring to a boil; boil for about 30 minutes, or until chicken is cooked through (juices run clear). Remove chicken from pan, reserving broth. Cut chicken into bite size pieces and place in bottom of a 9x13 inch baking dish.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl mix together cream of chicken soup and cream of celery soup. Fill one empty soup can with milk, and mix milk with soups. Pour mixture over chicken. In a small bowl combine stuffing and broth; mix together and spoon mixture over casserole.\nBake in the preheated oven for 45 minutes.\n", "time": 60, "urlnum": "25939"}, {"ingred": ["1 tablespoon vegetable oil", "1 pound skinless, boneless chicken breast halves", "1 1/4 cups water", "1 (1.5 ounce) envelope ORTEGA® Burrito Seasoning Mix", "8 (10 inch) burrito-size flour tortillas", "SARGENTO® ChefStyle Shredded Mild Cheddar Cheese, shredded lettuce, chopped green onions and sliced ripe olives", "ORTEGA® Thick & Chunky Salsa"], "title": "Chicken Burritos", "instr": "HEAT vegetable oil in large skillet over medium-high heat. Add chicken; cook for 3 to 4 minutes or until no longer pink. Add water and seasoning mix. Bring to a boil. Reduce heat to low; cook for 3 to 4 minutes or until mixture thickens\nSPOON chicken mixture evenly over tortillas. Top with cheese, lettuce, green onions, olives and salsa; fold into burritos.\n", "time": 20, "urlnum": "25940"}, {"ingred": ["2 pounds cooked, shredded chicken breast meat", "1 pound tomatillos", "1 (7 ounce) can ORTEGA® Diced Green Chiles", "2 cloves garlic", "1 teaspoon salt", "1 tablespoon vegetable oil", "1 cup chopped onion", "2 teaspoons chopped fresh cilantro"], "title": "Shredded Chicken Filling", "instr": "COMBINE tomatillos, chiles, garlic and salt in food processor or blender; cover. Process for 1 minute or until mixture is smooth.\nHEAT vegetable oil in large skillet over medium-high heat. Add onion; cook, stirring occasionally, for 1 to 2 minutes or until onion is tender. Stir in tomatillo mixture and chicken. Cook, stirring occasionally, for 4 to 5 minutes or until heated through. Remove from heat; stir in cilantro.\nUSE filling in burritos, tacos, enchiladas or tamales.\n", "time": 15, "urlnum": "25941"}, {"ingred": ["2 (8 ounce) cans refrigerated quick crescent dinner rolls", "2 tablespoons butter, melted", "1 (10 ounce) package HERSHEY®'S Cinnamon Chips"], "title": "Cinnamon Chip Filled Crescents", "instr": "Heat oven to 375 F. Unroll dough; separate into 16 triangles.\nSpread melted butter on each triangle, Sprinkle 1 cup cinnamon chips evenly over rolls; gently press chips into dough. Roll from shortest side of triangle to opposite point. Place rolls, point side down, on ungreased cookie sheet; curve into crescent shape.\nBake 8 to 10 minutes or until golden brown. Drizzle with CINNAMON DRIZZLE. Serve warm.\nCINNAMON CHIPS DRIZZLE: Melt remaining 2/3 cup chips with 1-1/2 teaspoons shortening.\n", "time": 23, "urlnum": "25943"}, {"ingred": ["2 cups all-purpose biscuit baking mix", "1/3 cup white sugar", "2 tablespoons vegetable oil", "1 egg, slightly beaten", "1 cup HERSHEY®'S Cinnamon Chips", "2/3 cup milk"], "title": "Cinnamon Chips Muffins", "instr": "Heat oven to 400 F. Grease or paper-line 12 muffin cups (2-1/2-inches in diameter).\nStir together baking mix, sugar, vegetable oil, egg, cinnamon chips and milk in medium bowl just until moistened. Divide batter evenly into prepared muffin cups.\nBake 15 to 18 minutes or just until browned. Cool slightly; remove from pan.\n", "time": 23, "urlnum": "25944"}, {"ingred": ["2 cups all-purpose flour", "1 1/2 cups ALBERS® White or Yellow Corn Meal", "1 1/2 cups SARGENTO® ChefStyle Shredded Mild Cheddar Cheese", "1 (7 ounce) can ORTEGA® Diced Green Chiles", "1/2 cup granulated sugar", "1 tablespoon baking powder", "1 1/2 teaspoons salt", "1 (12 fluid ounce) can NESTLE® CARNATION® Evaporated Milk", "1/2 cup vegetable oil", "2 eggs"], "title": "Fiesta Corn Bread", "instr": "PREHEAT oven to 375 degrees F. Grease 13 x 9-inch baking pan.\nCOMBINE flour, cornmeal, cheese, chiles, sugar, baking powder and salt in large bowl; mix well. Add evaporated milk, vegetable oil and eggs; stir just until moistened. Spread into prepared baking pan.\nBAKE for 30 to 35 minutes or until wooden pick inserted in center comes out clean. Cool in pan on wire rack for 10 minutes; cut into squares. Serve warm.\n", "time": 50, "urlnum": "25947"}, {"ingred": ["2 (1 pound) loaves frozen white bread dough", "1 (10 ounce) package HERSHEY®'S Cinnamon Chips, divided", "6 tablespoons butter, melted", "1 cup white sugar"], "title": "Cinnamon Chip Buns", "instr": "Thaw dough as directed on package; let rise at room temperature, covered with plastic wrap, until about double its thawed size, about 3 hours.\nHeat oven to 350 F. Grease 12-cup fluted tube pan. Set aside1/2 cup cinnamon chips.\nWorking with 1 loaf at a time, use serrated knife to cut each loaf into 12 equal slices. Slightly flatten 1 slice; place 1 heaping teaspoon chips in center. Gather dough around chips and pinch to seal, forming a ball; set aside. Prepare remaining slices. Dip each ball in butter; coat with sugar. Place balls in prepared pan, staggering to fit, sprinkling reserved chips between layers as balls are placed in pan and on top.\nBake 45 to 50 minutes or until golden brown. Cool 10 minutes. Remove from pan to serving plate. Serve warm or at room temperature.\n", "time": 80, "urlnum": "25948"}, {"ingred": ["4 cups masa harina flour (Mexican corn masa mix)", "1/2 cup vegetable shortening", "2 1/2 cups warm water", "1 (7 ounce) can ORTEGA® Diced Green Chiles", "2 tablespoons vegetable oil, divided", "warmed ORTEGA® Refried Beans", "SARGENTO® Fancy Shredded Mild Cheddar Cheese", "ORTEGA® Thick & Chunky Salsa", "sour cream", "ORTEGA® Pickled Jalapeno Slices"], "title": "Sopes", "instr": "PLACE flour in large bowl; cut in vegetable shortening with pastry blender or two knives until mixture resembles coarse crumbs. Gradually add water, kneading until smooth. Add chiles; mix well. Form dough into 35 small balls. Pat each ball into 3-inch patty; place on waxed paper.\nHEAT 1 teaspoon vegetable oil in large skillet over medium-high heat for 1 to 2 minutes. Cook patties for 3 minutes on each side or until golden brown, adding additional oil as needed to prevent sticking.\nTOP with beans, cheese, salsa, dollop of sour cream and jalapenos.\n", "time": 45, "urlnum": "25951"}, {"ingred": ["2 1/4 cups all-purpose flour", "2 tablespoons granulated sugar", "1 tablespoon baking powder", "1/2 teaspoon salt (optional)", "3 tablespoons butter, softened", "1 egg", "1 (8 ounce) can cream-style corn", "1 (4 ounce) can ORTEGA® Diced Green Chiles", "1 tablespoon chopped fresh cilantro (optional)"], "title": "Southwestern Biscuits", "instr": "PREHEAT oven to 400 degrees F.\nCOMBINE flour, sugar, baking powder and salt in large bowl. Add butter; cut in with pastry blender or two knives until mixture resembles coarse crumbs.\nSTIR in egg, corn, chiles and cilantro; combine just until mixture holds together. Knead dough 10 times on well-floured surface. Pat dough to 3/4-inch thickness. Cut into 3-inch biscuits. Place on greased baking sheets.\nBAKE for 20 to 25 minutes or until wooden pick inserted in center comes out clean. Cool on baking sheets for 5 minutes; remove to wire racks to cool completely.\n", "time": 45, "urlnum": "25953"}, {"ingred": ["2/3 cup graham cracker crumbs", "3 tablespoons white sugar", "5 tablespoons butter", "2 (8 ounce) packages cream cheese", "1/2 cup white sugar", "1/2 teaspoon almond extract", "1/4 teaspoon salt", "2 eggs", "3 tablespoons amaretto liqueur", "1 (8 ounce) container sour cream", "1 tablespoon white sugar", "1/2 teaspoon almond extract", "1 tablespoon amaretto liqueur"], "title": "Amaretto Cheesecake III", "instr": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine graham cracker crumbs, butter and 3 tablespoons sugar. Mix well and press into the bottom of a 9 inch springform pan.\nIn a large bowl, beat cream cheese and 1/2 cup sugar until smooth. Beat in almond extract and salt. Blend in the eggs, one at a time, on low speed. Stir in 3 tablespoons amaretto liqueur. Pour batter into crust.\nBake in the preheated oven for 40 to 45 minutes, or until golden brown and filling is set. Allow to cool completely.\nMake the topping: In a small bowl, combine sour cream, 1 tablespoon sugar, 1 teaspoon almond extract and 1 tablespoon amaretto liqueur. Mix well and spread over top of cooled cake. Refrigerate 4 to 6 hours before removing from pan.\n", "time": 60, "urlnum": "25955"}, {"ingred": ["2 cups all-purpose flour", "1 cup white sugar", "3/4 teaspoon baking soda", "1/2 teaspoon salt", "1/2 teaspoon ground cinnamon", "1 (8 ounce) can crushed pineapple, with juice", "2 eggs", "1/2 cup vegetable oil", "2 very ripe bananas, mashed", "1 teaspoon vanilla extract", "1/4 cup maraschino cherries, halved", "1/4 cup butter, melted", "1 teaspoon vanilla extract", "3 cups confectioners' sugar", "4 tablespoons milk"], "title": "Banana Split Bars", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl, mix together the flour, sugar, baking soda, salt and cinnamon. Make a well in the center and pour in the crushed pineapple, eggs, oil, bananas and 1 teaspoon vanilla. Stir in the cherries. Mix well and pour into prepared pan.\nBake in the preheated oven for 30 to 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Frost cake while still warm.\nTo make the frosting: in a medium bowl, combine melted butter, 1 teaspoon vanilla and confectioners' sugar. Beat in milk, one tablespoon at a time, until desired consistency is achieved.\n", "time": 90, "urlnum": "25956"}, {"ingred": ["4 tablespoons butter, melted", "1/2 cup brown sugar", "1/2 cup chopped pecans", "4 bananas, sliced", "1 (18.25 ounce) package banana cake mix"], "title": "Banana Upside-Down Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (8 inch) pans. Combine butter and brown sugar, divide and spread evenly between the 2 pans. Sprinkle pecans evenly over both brown sugar mixtures, arrange banana slices evenly over each.\nPrepare cake mix according to package instructions. Divide batter into the 2 pans.\nBake in the preheated oven for 40 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Turn cakes upside down on a platter or plate, gently tap bottom and carefully remove pans, replacing caramel mixture that sticks to pan.\n", "time": 90, "urlnum": "25957"}, {"ingred": ["1 cup graham cracker crumbs", "1/4 cup finely chopped walnuts", "3 tablespoons brown sugar", "1 tablespoon ground cinnamon", "1/2 teaspoon ground nutmeg", "5 tablespoons butter, melted", "3 (8 ounce) packages cream cheese", "1 cup white sugar", "1 cup sour cream", "1 cup heavy cream", "3 tablespoons all-purpose flour", "1 tablespoon vanilla extract", "3 eggs"], "title": "Basic Cheesecake", "instr": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine graham cracker crumbs, chopped walnuts, brown sugar, cinnamon, nutmeg and melted butter. Mix well and press into the bottom of a 9 inch springform pan. Bake in preheated oven for 10 minutes. Remove from oven and allow to cool.\nIn a large bowl, beat cream cheese and sugar together until smooth. Beat in sour cream and heavy cream. Blend in the flour and vanilla. With mixer on low speed, add eggs one at a time. Pour batter over crust.\nBake in the preheated oven for 60 to 70 minutes, or until center is almost set (filling will be soft). Refrigerate at least 6 hours or overnight before removing from pan.\n", "time": 100, "urlnum": "25958"}, {"ingred": ["1 cup margarine", "1 3/4 cups white sugar", "3 eggs", "1 1/2 teaspoons vanilla extract", "1 1/2 cups milk", "2 1/2 cups all-purpose flour", "6 tablespoons unsweetened cocoa powder", "1 1/2 teaspoons baking soda", "1 teaspoon salt"], "title": "Best Moist Chocolate Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift together the flour, cocoa, baking soda and salt. Set aside.\nIn a large bowl, cream together the margarine and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the milk, mixing just until incorporated. Pour batter into prepared pan.\nBake in the preheated oven for 40 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 50, "urlnum": "25960"}, {"ingred": ["1 (21 ounce) can cherry pie filling", "1 (16.5 ounce) can pitted dark sweet cherries", "1 (18.25 ounce) package chocolate cake mix", "1 cup chopped walnuts", "3/4 cup butter, cut into pieces"], "title": "Black Forest Dump Cake II", "instr": "Preheat oven to 375 degrees F (190 degrees C). Spray 9x13 baking dish with cooking spray.\nDump cherry pie filling into dish and spread evenly. Repeat with cherries, including juice. Sprinkle cake mix over the top - DO NOT STIR. Sprinkle with chopped nuts. Distribute butter pieces evenly over the top.\nBake in the preheated oven for 45 minutes.\n", "time": 50, "urlnum": "25961"}, {"ingred": ["1 cup white sugar", "2 tablespoons unsweetened cocoa powder", "1/2 cup milk", "1 teaspoon vanilla extract", "2 eggs", "1/2 cup butter", "1 cup dark brown sugar", "1 cup sour milk", "1 teaspoon baking soda", "2 1/2 cups all-purpose flour", "1 1/4 cups blackberry preserves"], "title": "Blackberry Jam Cake II", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. In a saucepan, combine white sugar, cocoa, milk and vanilla. Cook over medium heat until smooth and thickened. Set aside to cool.\nIn a large bowl, cream together the butter and brown sugar until light and fluffy. Beat in the eggs one at a time, then stir in the cooked mixture. Combine sour milk and baking soda. Beat in the flour alternately with the sour milk mixture. Stir in blackberry jam. Pour batter into prepared pan.\nBake in the preheated oven for 45 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 60, "urlnum": "25962"}, {"ingred": ["1 cup butter, softened", "1 cup white sugar", "6 eggs", "1 cup buttermilk", "3 cups all-purpose flour", "1 teaspoon baking soda", "1 tablespoon ground cinnamon", "1 tablespoon ground allspice", "1 tablespoon ground cloves", "1 cup seedless blackberry jam"], "title": "Blackberry Jam Cake III", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour 3 (9 inch) pans. Mix together the flour, baking soda, cinnamon, allspice and cloves. Set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time. Beat in the flour mixture alternately with the buttermilk. Stir in the blackberry jam. Pour batter into prepared pans.\nBake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pans for 10 minutes, then turn out onto a wire rack and cool completely.\n", "time": 60, "urlnum": "25963"}, {"ingred": ["1 (18.25 ounce) package white cake mix", "1 (3 ounce) package blackberry flavored Jell-O®", "4 eggs", "1/2 cup vegetable oil", "1 cup blackberry wine", "1 1/2 cups confectioners' sugar", "1/2 cup blackberry wine"], "title": "Blackberry Wine Cake II", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a large bowl, stir together cake mix and gelatin mix. Make a well in the center and pour in eggs, oil and blackberry wine. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pan.\nBake in the preheated oven for 40 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Pour 1/2 of blackberry wine glaze over top of cake while still warm. Let set for 10 minutes then remove cake from pan. Allow cake to cool fully before pouring the remaining glaze on top.\nTo make the Glaze: In a small bowl, stir together the confectioners' sugar and 1/2 cup blackberry wine.\n", "time": 55, "urlnum": "25964"}, {"ingred": ["1/2 cup butter", "1 1/3 cups white sugar", "2 eggs", "1 teaspoon vanilla extract", "2 cups buttermilk", "4 cups all-purpose flour", "3 teaspoons baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "2 cups blueberries", "2/3 cup all-purpose flour", "2/3 cup white sugar", "6 tablespoons butter, softened"], "title": "Blueberry Buttermilk Coffeecake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift together 4 cups flour, baking powder, baking soda and salt. Set aside.\nIn a large bowl, cream together 1/2 cup butter and 1 1/3 cup sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated. Sir in blueberries. Pour batter into prepared pan. In a small bowl, combine 2/3 cup flour and 2/3 cup sugar. cut in 6 tablespoons butter until mixture resembles coarse crumbs. Sprinkle over top of batter.\nBake in the preheated oven for 45 to 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 90, "urlnum": "25965"}, {"ingred": ["1/4 cup butter", "3/4 cup white sugar", "1 egg", "1/2 cup milk", "2 cups all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon salt", "2 cups blueberries", "1/2 cup brown sugar", "3 tablespoons all-purpose flour", "1 teaspoon ground cinnamon", "1/2 cup chopped pecans", "3 tablespoons butter"], "title": "Blueberry Coffee Cake III", "instr": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 9 inch springform pan. Sift together the flour, baking powder and salt. Set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the egg. Beat in the flour mixture alternately with the milk, mixing just until incorporated. Stir in the blueberries. Pour batter into prepared pan. In a small bowl, combine brown sugar, 3 tablespoons flour, cinnamon and chopped pecans. Cut in butter until crumbly. Sprinkle over the batter.\nBake in the preheated oven for 40 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 60, "urlnum": "25966"}, {"ingred": ["1 (18.25 ounce) package yellow cake mix", "1/4 cup white sugar", "3 eggs", "1 (8 ounce) package cream cheese, room temperature", "1/2 cup vegetable oil", "1 teaspoon vanilla extract", "1 1/4 cups blueberries"], "title": "Blueberry Cream Cheese Pound Cake I", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10-inch Bundt pan.\nIn a large bowl, stir together cake mix and sugar. Make a well in the center and pour in eggs, cream cheese, oil and vanilla. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Stir in blueberries. Pour batter into prepared pan.\nBake in the preheated oven for 40 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n", "time": 155, "urlnum": "25967"}, {"ingred": ["1 (18.25 ounce) package yellow cake mix", "1 (3.4 ounce) package instant vanilla pudding mix", "1/4 cup white sugar", "1/4 cup water", "3/4 cup vegetable oil", "3 eggs", "1 (8 ounce) package cream cheese, room temperature", "1 (16.5 ounce) can blueberries, drained, juice reserved", "1 cup confectioners' sugar"], "title": "Blueberry Cream Cheese Pound Cake II", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a large bowl, stir together cake mix, pudding mix and sugar. Make a well in the center and pour in water, oil, eggs and cream cheese. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Stir in the blueberries. Pour batter into prepared pan.\nBake in the preheated oven for 50 to 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\nMake Glaze: In a small bowl, combine confectioners' sugar with 2 tablespoons reserved juice from the blueberries. Drizzle over cooled cake.\n", "time": 65, "urlnum": "25968"}, {"ingred": ["2 tablespoons butter", "1/4 cup white sugar", "2 3/4 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 cup butter", "2 cups white sugar", "4 eggs", "1 teaspoon vanilla extract", "2 cups fresh blueberries", "1/4 cup all-purpose flour"], "title": "Blueberry Pound Cake", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease a 10-inch tube pan with 2 tablespoons butter. Sprinkle pan with 1/4 cup sugar.\nMix together 2 3/4 cups flour, baking powder and salt. Set aside.\nIn a large bowl, cream together 1 cup butter and 2 cups sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Gradually beat in the flour mixture. Dredge blueberries with remaining 1/4 cup flour, then fold into batter.\nPour batter into the prepared pan.\nBake in the preheated oven for 70 to 80 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n", "time": 90, "urlnum": "25969"}, {"ingred": ["2 cups fresh blueberries", "1/2 cup white sugar", "2 tablespoons all-purpose flour", "2 tablespoons grated lemon zest", "1/2 cup butter, softened", "1 cup white sugar", "3 eggs", "1 teaspoon almond extract", "1 tablespoon grated lemon zest", "3/4 cup milk", "2 cups all-purpose flour", "4 teaspoons baking powder", "1/2 cup slivered almonds, toasted"], "title": "Blueberry Upside-Down Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch springform pan. In a medium bowl, combine blueberries, 1/2 cup sugar, 2 tablespoons flour and 2 tablespoons grated lemon zest. Toss to coat berries, then pour into the prepared pan.\nIn a large bowl, cream together the butter and 1 cup sugar until light and fluffy. Beat in the eggs one at a time, then stir in the almond extract and 1 tablespoon grated lemon zest. Stir together 2 cups flour and the baking powder. Beat into butter mixture alternately with the milk, mixing just until incorporated. Pour batter over the berries in the pan.\nBake in the preheated oven for 60 to 70 minutes, or until a toothpick inserted into the center of the cake comes out clean. Place serving plate over the top of the pan and carefully invert cake and plate together, so that the berries end up on top. Carefully unlock the buckle on the side of the pan and remove. Sprinkle toasted almonds on top of cake and serve warm.\n", "time": 110, "urlnum": "25970"}, {"ingred": ["1 cup butter", "1 1/4 cups packed brown sugar", "4 eggs", "1/4 cup grated fresh ginger root", "1 teaspoon vanilla extract", "1 cup milk", "2 1/2 cups all-purpose flour", "4 teaspoons baking powder", "4 teaspoons ground ginger", "1 1/2 teaspoons ground cinnamon", "1/2 teaspoon salt", "2 tablespoons confectioners' sugar for dusting"], "title": "Boscobel Beach Ginger Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch Bundt pan. Sift together the flour, baking powder, ground ginger, cinnamon and salt. Set aside.\nIn a large bowl, cream together the butter and brown sugar until light and fluffy. Beat in the eggs one at a time, then stir in the grated ginger root and vanilla. Beat in the flour mixture alternately with the milk, mixing just until incorporated. Pour batter into prepared pan.\nBake in the preheated oven for 45 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a serving plate. Dust lightly with confectioners' sugar before serving.\n", "time": 75, "urlnum": "25971"}, {"ingred": ["1 1/2 cups all-purpose flour", "1/2 cup white sugar", "2 1/2 teaspoons baking powder", "1 pinch salt", "1/2 cup milk", "1/4 cup vegetable oil", "1 egg", "2 cups blueberries", "1/3 cup all-purpose flour", "1/2 cup white sugar", "3/4 teaspoon ground cinnamon", "1/4 cup margarine"], "title": "Bright Blue Monday Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch square pan.\nIn a large bowl, mix together the flour, sugar, baking powder and salt. Make a well in the center and pour in the milk, oil, and egg. Mix well. Stir in the blueberries. Pour into prepared pan. In a small bowl, combine 1/3 cup flour, 1/2 cup sugar and 3/4 teaspoon cinnamon. Cut in the margarine until crumbly. Sprinkle over cake.\nBake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 60, "urlnum": "25972"}, {"ingred": ["2 cups light brown sugar", "1 cup white sugar", "1 1/2 cups butter", "5 eggs", "1 teaspoon vanilla extract", "1 cup milk", "3 cups all-purpose flour", "1/2 teaspoon baking powder", "1 cup chopped pecans"], "title": "Brown Sugar Pound Cake I", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch tube pan. Mix together the flour and baking powder; set aside.\nIn a large bowl, cream together the butter, brown sugar and white sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the milk, mixing just until incorporated. Sir in the chopped pecans. Pour batter into prepared pan.\nBake in the preheated oven for 60 to 75 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n", "time": 90, "urlnum": "25973"}, {"ingred": ["1/2 cup butter, softened", "2 cups packed brown sugar", "5 eggs", "2 teaspoons maple flavored extract", "1 cup evaporated milk", "3 cups all-purpose flour", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "1/4 cup butter", "1/2 cup packed brown sugar", "1 1/2 cups sifted confectioners' sugar", "2 tablespoons milk", "1/2 teaspoon vanilla extract"], "title": "Brown Sugar Pound Cake II", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch tube pan. Mix together the flour, baking powder and salt. Set aside.\nIn a large bowl, cream together 1/2 cup butter and 2 cups brown sugar until light and fluffy. Beat in the eggs one at a time, then stir in the maple flavoring. Beat in the flour mixture alternately with the evaporated milk, mixing just until incorporated. Pour batter into prepared pan.\nBake in the preheated oven for 70 to 80 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely. Decorate with Brown Sugar Frosting.\nTo make Brown Sugar Frosting: In a medium saucepan, combine 1/4 cup butter, 1/2 cup brown sugar, the confectioners' sugar, milk and vanilla. Cook over low heat, beating until sugar is dissolved and mixture is smooth.\n", "time": 120, "urlnum": "25974"}, {"ingred": ["1/2 cup shortening", "1 1/2 cups cane syrup", "2 eggs", "1 teaspoon vanilla extract", "2/3 cup milk", "2 cups all-purpose flour", "1/2 cup unsweetened cocoa", "1 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup butter", "1/4 cup unsweetened cocoa", "3/8 cup milk", "4 cups confectioners' sugar", "1 teaspoon vanilla extract"], "title": "Busy Day Syrup Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 (8 inch) pans. Sift together the flour, 1/2 cup cocoa, baking soda and salt. Set aside.\nIn a large bowl, cream together the shortening and cane syrup until light and fluffy. Beat in the eggs one at a time, then stir in 1 teaspoon vanilla. Beat in the flour mixture alternately with 2/3 cup milk, mixing just until incorporated. Pour batter into prepared pans.\nBake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pans for 10 minutes, then turn out onto a wire rack and cool completely. Frost between layers, on top and sides with Easy Chocolate Frosting.\nTo make Easy Chocolate Frosting: In a saucepan, combine 1/2 cup butter, 1/4 cup cocoa and 1/4 cup plus 2 tablespoons milk. Cook over low heat, stirring constantly, until mixture boils. Remove from heat. Gradually beat in confectioners' sugar and continue beating until spreading consistency is achieved. Beat in vanilla.\n", "time": 55, "urlnum": "25976"}, {"ingred": ["1/2 cup butter", "3 cups white sugar", "6 egg yolks", "2 teaspoons lemon extract", "1 cup buttermilk", "3 cups all-purpose flour", "1/4 teaspoon baking soda", "6 egg whites"], "title": "Buttermilk Pound Cake III", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch tube pan. Mix together the flour and baking soda; set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the yolks one at a time, then stir in the lemon extract. Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated. Pour batter into prepared pan.\nIn a large glass or metal mixing bowl, beat egg whites until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain. Pour batter into prepared pan.\nBake in the preheated oven for 90 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n", "time": 105, "urlnum": "25977"}, {"ingred": ["1 cup graham cracker crumbs", "1/2 cup ground pecans", "3 tablespoons white sugar", "1/2 teaspoon ground cinnamon", "1/2 teaspoon apple pie spice", "1/2 teaspoon ground nutmeg", "1/4 cup margarine, melted", "2 (8 ounce) packages cream cheese, softened", "1/2 cup white sugar", "1/2 teaspoon vanilla extract", "2 eggs", "1/4 cup caramel ice cream topping", "1 cup chopped pecans"], "title": "Caramel Pecan Cheesecake", "instr": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine graham cracker crumbs, ground pecans, sugar, cinnamon, apple pie spice and nutmeg. Pour in the melted butter. Mix well and press into the bottom of a 9 inch springform pan.\nIn a large bowl, Beat cream cheese, 1/2 cup sugar and vanilla until smooth. Beat in the eggs one at a time. Pour filling into crust.\nBake in the preheated oven for 70 minutes, or until filling is set. Allow to cool.\nIn a small bowl, combine caramel topping and chopped pecans. Spread evenly over cooled cheesecake. Refrigerate at least 4 hours before serving.\n", "time": 240, "urlnum": "25978"}, {"ingred": ["3/4 cup shortening", "1 1/3 cups packed brown sugar", "1 cup white sugar", "3 eggs", "2 teaspoons vanilla extract", "1 1/2 cups buttermilk", "3 cups all-purpose flour", "2 teaspoons baking powder", "3/4 teaspoon baking soda", "3/4 teaspoon salt", "1 teaspoon ground cinnamon", "3/4 teaspoon ground nutmeg", "3/4 teaspoon ground cloves", "1/2 teaspoon ground allspice", "1 cup chopped pecans", "1/4 cup butter", "1/2 teaspoon salt", "1 teaspoon vanilla extract", "1/2 teaspoon ground nutmeg", "3 cups confectioners' sugar, sifted", "1/4 cup buttermilk"], "title": "Caramel Spice Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (9 inch) pans. Sift together the flour, baking powder, baking soda, salt, cinnamon, 3/4 teaspoon nutmeg, cloves and allspice. Set aside.\nIn a large bowl, cream together the shortening, brown sugar and 1 cup white sugar until light and fluffy. Beat in the eggs one at a time, then stir in 2 teaspoons vanilla. Beat in the flour mixture alternately with 1 1/2 buttermilk, mixing just until incorporated. Stir in pecans. Pour batter into prepared pans.\nBake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\nTo make the frosting: In a large bowl, combine butter, 1/2 teaspoon salt, 1 teaspoon vanilla and about 1 cup of the confectioners' sugar. Beat well, then gradually beat in the remaining confectioners' sugar alternately with 1/4 cup buttermilk. Beat until smooth and creamy and spread on cake.\n", "time": 90, "urlnum": "25979"}, {"ingred": ["1/2 cup butter", "2/3 cup honey", "2 eggs", "1 banana, mashed", "1 teaspoon vanilla extract", "3/4 cup water", "1 cup all-purpose flour", "1/3 cup carob powder", "1 teaspoon baking soda", "1/2 teaspoon sea salt", "1 cup chopped walnuts (optional)", "1/4 cup butter", "1/3 cup honey", "1 cup dry milk powder", "1/4 cup carob powder", "1/4 cup water", "1 teaspoon vanilla extract"], "title": "Carob Cake And Frosting", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8 inch square pan. Sift together the flour, 1/3 cup carob powder, baking soda and salt. Set aside.\nIn a large bowl, cream together the 1/2 cup butter and 2/3 cup of honey until light and fluffy. Beat in the eggs one at a time, then stir in the banana and vanilla. Beat in the flour mixture alternately with the 3/4 cup water. Stir in chopped walnuts. Pour batter into prepared pan.\nBake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\nTo make the frosting: In a large bowl, cream 1/4 cup butter and 1/3 cup honey until smooth. Blend in the milk powder, carob powder, 1/4 cup water and 1 teaspoon vanilla. Beat until smooth and spread on cooled cake.\n", "time": 90, "urlnum": "25980"}, {"ingred": ["1 cup sifted cake flour", "1 cup egg whites", "1/4 teaspoon salt", "1 teaspoon cream of tartar", "1 1/4 cups white sugar", "3/4 teaspoon vanilla extract", "1/4 teaspoon almond extract", "1/3 cup maraschino cherries, drained and sliced"], "title": "Cherry Angel Food Cake", "instr": "Preheat oven to 325 degrees F (165 degrees C). Make sure your 10 inch tube pan is clean and dry. Sift flour three times and set aside.\nIn a large glass or metal mixing bowl, beat egg whites with salt and cream of tartar until foamy. Gradually add sugar, continuing to beat until stiff peaks form. Blend in vanilla and almond extract. Fold the flour into the whites until no streaks remain. Pour half of the batter into pan. Sprinkle with half of the cherries. Fill pan with remaining batter and top with remaining cherries.\nBake in the preheated oven for 50 minutes. Invert pan and allow to hang until cake cools.\n", "time": 90, "urlnum": "25981"}, {"ingred": ["3 cups all-purpose flour", "2 cups white sugar", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1 cup vegetable oil", "4 eggs", "1 cup milk", "1 teaspoon vanilla extract", "1 cup chopped walnuts", "1 (4 ounce) jar maraschino cherries, drained"], "title": "Cherry Nut Cake III", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl, mix together the flour, sugar, baking powder and baking soda. Make a well in the center and pour in the oil, eggs, milk and vanilla. Mix well, then stir in nuts and cherries. Pour into prepared pan.\nBake in the preheated oven for 60 to 70 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 90, "urlnum": "25982"}, {"ingred": ["3 cups chocolate cookie crumbs", "1/2 cup finely chopped almonds", "1/4 cup white sugar", "1/2 cup butter, melted", "3 (1 ounce) squares bittersweet chocolate", "2 (8 ounce) packages cream cheese, softened", "1 cup white sugar", "3 eggs", "1 teaspoon almond extract", "1 (16 ounce) container sour cream, room temperature"], "title": "Chocolate Almond Marble Cheesecake", "instr": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine cookie crumbs, almonds, 1/4 cup sugar and melted butter. Mix well. Press into the bottom and halfway up the sides of a 10 inch springform pan.\nIn the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.\nIn a large bowl, beat the cream cheese and 1 cup sugar until smooth. Beat in the eggs one at a time. Fold in the almond extract and sour cream. Pour 1 1/2 cups of the filling into a smaller bowl. Stir the melted chocolate into the smaller bowl, then fold loosely back into plain filling. Pour into crust. With the tip of a knife, swirl the filling to create a marbled effect.\nBake in the preheated oven for 40 minutes. Turn off oven and let cake cool in oven for 1 hour, with the door closed. Cool at room temperature, then refrigerate overnight.\n", "time": 130, "urlnum": "25983"}, {"ingred": ["2 1/2 cups chopped walnuts", "1 cup flaked coconut", "1 (18.25 ounce) package chocolate cake mix", "1 (3.9 ounce) package instant chocolate pudding mix", "1 cup water", "1/2 cup vegetable oil", "4 eggs", "2 (8 ounce) packages cream cheese, softened", "1/2 cup butter", "3/4 cup confectioners' sugar"], "title": "Chocolate Cake Surprise", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10x15 inch pan. Sprinkle walnuts and coconut evenly over bottom of pan.\nIn a large bowl, stir together cake mix and pudding mix. Make a well in the center and pour in water, oil, and eggs. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pan. Set aside.\nIn a saucepan, combine cream cheese and butter. Cook over medium heat, stirring occasionally, until melted and smooth. Stir in confectioners' sugar. Pour cream cheese mixture in rows (lengthwise) over the top of cake mix. Using the tip of a knife, swirl the batter to create a marbled effect.\nBake in the preheated oven for 40 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 60, "urlnum": "25984"}, {"ingred": ["1 cup unsweetened cocoa powder", "2 cups hot brewed coffee", "2 1/2 cups white sugar", "1 cup vegetable oil", "4 eggs", "2 teaspoons vanilla extract", "3 cups all-purpose flour", "2 teaspoons baking soda", "1/2 teaspoon baking powder", "1 teaspoon salt"], "title": "Chocolate Cake V", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. In a small bowl, dissolve the cocoa in the hot coffee; set aside. Sift together the flour, baking soda, baking powder and salt. Set aside.\nIn a large bowl, combine the sugar, oil, eggs and vanilla. Beat in the flour mixture alternately with the cocoa mixture. Pour batter into prepared pan.\nBake in the preheated oven for 40 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 120, "urlnum": "25985"}, {"ingred": ["2 cups graham cracker crumbs", "1/3 cup white sugar", "1/2 cup butter, melted", "30 individually wrapped caramels, unwrapped", "3 tablespoons milk", "3/4 cup chopped pecans", "1 cup semisweet chocolate chips", "3 (8 ounce) packages cream cheese, softened", "3/4 cup white sugar", "1 teaspoon vanilla extract", "3 eggs"], "title": "Chocolate Caramel Cheesecake", "instr": "In a medium bowl, combine graham cracker crumbs, sugar and melted butter. Mix well and press into the bottom and 1 inch up the sides of a 9 inch springform pan. Pour on melted caramel/pecan mixture and chill for 30 minutes.\nTo make the Caramel Filling: In a small saucepan, combine caramels and milk. Cook over low heat, stirring, until smooth. Stir in chopped pecans. Preheat oven to 325 degrees F (165 degrees C).\nIn the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm. In a large bowl, beat cream cheese, sugar and vanilla until smooth. Beat in the eggs one at a time. Fold 1/3 of the filling into the melted chocolate, then pour the chocolate mixture back into the filling and mix until no streaks remain. Pour into crust.\nBake in the preheated oven for 50 minutes, or until center is almost set. Place a pan of water on rack underneath cheesecake as it bakes to help keep it from cracking. Cool in oven with door cracked open. Refrigerate at least 5 hours before serving.\n", "time": 90, "urlnum": "25986"}, {"ingred": ["1 (1 ounce) square unsweetened baking chocolate", "1/4 cup butter", "1 cup white sugar", "1 egg", "1/4 cup plain yogurt", "1 (4 ounce) jar maraschino cherries", "1 cup sour milk", "1 3/4 cups all-purpose flour", "1 teaspoon baking soda"], "title": "Chocolate Cherry Cake IV", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. In the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the yogurt, melted chocolate and cherries with juice. Stir together the flour and baking soda and beat into the creamed mixture alternately with the sour milk. Pour batter into prepared pan.\nBake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 60, "urlnum": "25987"}, {"ingred": ["1 (18.25 ounce) package yellow cake mix", "1 (3.4 ounce) package instant vanilla pudding mix", "1 cup vegetable oil", "4 eggs", "1 cup milk", "3 (1 ounce) squares semisweet chocolate, grated", "1 cup milk chocolate chips"], "title": "Chocolate Chip Pound Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch tube pan.\nIn a large bowl, stir together cake mix and pudding mix. Make a well in the center and pour in oil, eggs and milk. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Stir in grated chocolate and chocolate chips. Pour batter into prepared pan.\nBake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 80, "urlnum": "25988"}, {"ingred": ["1/2 cup butter", "1/2 cup vegetable oil", "1 1/4 cups white sugar", "2 eggs", "2 cups grated zucchini", "1/2 cup buttermilk", "2 1/2 cups all-purpose flour", "1/4 cup unsweetened cocoa powder", "1 teaspoon baking powder", "1 teaspoon salt", "1 (8 ounce) package cream cheese, softened", "2 tablespoons butter, softened", "1/4 cup white sugar", "1 tablespoon cornstarch", "1 egg", "2 tablespoons milk", "1/2 teaspoon vanilla extract"], "title": "Chocolate Cream Cheese Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift together the flour, cocoa, baking powder and salt. Set aside.\nIn a large bowl, cream together 1/2 cup butter, oil, and 1 1/4 sugar until light and fluffy. Beat in 2 eggs, one at a time, then stir in the zucchini. Beat in the flour mixture alternately with the buttermilk. Pour half of the batter into prepared pan.\nMake the filling: In a medium bowl, beat cream cheese, 2 tablespoons butter. Combine 1/4 cup sugar and cornstarch; beat into the cream cheese mixture until smooth. Beat in 1 egg, milk and vanilla. Pour over batter in pan, distributing evenly. Pour remaining batter over filing.\nBake in the preheated oven for 50 to 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n", "time": 85, "urlnum": "25989"}, {"ingred": ["1/2 cup butter", "1/4 cup unsweetened cocoa powder", "1 tablespoon vanilla extract", "3 1/2 cups confectioners' sugar", "2 tablespoons milk"], "title": "Chocolate Frosting II", "instr": "In a saucepan over medium heat, melt butter. Stir in cocoa and vanilla. Place confectioners' sugar in a large bowl. Pour in cocoa mixture. Beat well (mixture will be extremely thick). Beat in milk, a teaspoon at a time, until desired consistency is achieved.\n", "time": 20, "urlnum": "25990"}, {"ingred": ["2 (1 ounce) squares unsweetened baking chocolate", "1/2 cup butter", "6 tablespoons milk", "3 1/2 cups confectioners' sugar", "1 pinch salt", "1 teaspoon vanilla extract"], "title": "Chocolate Frosting III", "instr": "In a large saucepan over medium heat, combine chocolate, butter and milk. Bring to a boil, stirring frequently. Remove from heat and beat in confectioners' sugar, salt and vanilla. Beat until smooth, adjusting consistency with milk or sugar, if necessary.\n", "time": 30, "urlnum": "25991"}, {"ingred": ["3 cups white sugar", "6 tablespoons unsweetened cocoa powder", "1/4 cup water", "1 1/2 cups evaporated milk", "1/4 cup butter"], "title": "Chocolate Frosting IV", "instr": "In a saucepan, combine sugar and cocoa. Stir in water to make a paste. Add milk and butter. Cook over medium heat until it comes to a boil. Continue boiling for 5 minutes. Remove from heat and beat until cool enough to spread on cake.\n", "time": 15, "urlnum": "25992"}, {"ingred": ["2 cups white sugar", "1/4 cup unsweetened cocoa powder", "1/4 teaspoon salt", "1 (5 ounce) can evaporated milk", "1/2 cup shortening"], "title": "Chocolate Frosting V", "instr": "In a saucepan, combine sugar, cocoa and salt. Add milk and shortening. Cook over medium heat until it comes to a boil. Remove from heat and let cool before spreading on cake.\n", "time": 10, "urlnum": "25993"}, {"ingred": ["4 (1 ounce) squares semisweet chocolate, chopped", "1 cup butter", "1 cup all-purpose flour, sifted", "1 3/4 cups white sugar", "4 eggs", "1 teaspoon vanilla extract", "2 cups chopped pecans"], "title": "Chocolate Fudge Cupcakes", "instr": "Preheat oven to 325 degrees F (165 degrees C). Line 24 muffin cups with paper liners. In the top of a double boiler, combine chocolate and butter. Heat, stirring occasionally, until mixture is melted and smooth. Remove from heat and allow to cool to lukewarm.\nSift flour and sugar together into a large bowl. With mixer on low speed, beat in eggs one at a time. Stir in chocolate mixture, vanilla and pecans. Fill muffin cups 2/3 full.\nBake in the preheated oven for 25 minutes. Do not overbake. Tops should be shiny but give slightly when touched.\n", "time": 60, "urlnum": "25994"}, {"ingred": ["1 (18.25 ounce) package chocolate fudge cake mix", "4 eggs", "1/2 cup vegetable oil", "1 1/3 cups water", "1 (16 ounce) container prepared chocolate fudge frosting"], "title": "Chocolate Fudge Pound Cake", "instr": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a large bowl, combine cake mix, eggs, oil and water. Beat on low speed until blended. Stir in chocolate frosting. Pour batter into prepared pan.\nBake in the preheated oven for 60 to 70 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n", "time": 70, "urlnum": "25995"}, {"ingred": ["1 1/2 cups chocolate cookie crumbs", "1/3 cup butter, melted", "4 (1 ounce) squares semisweet chocolate, chopped", "12 ounces cream cheese, room temperature", "1/2 cup brown sugar", "2 tablespoons cornstarch", "2 eggs", "3 tablespoons coffee flavored liqueur"], "title": "Chocolate Mocha Cheesecake", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease an 8 inch springform pan. In a medium bowl, combine cookie crumbs and butter. Mix well and press into the bottom of springform pan.\nIn the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.\nIn a large bowl, beat cream cheese, brown sugar and cornstarch until smooth. Beat in the eggs one at a time. Blend in the coffee liqueur. Fold 1/3 of the filling into the melted chocolate, then pour the chocolate mixture back into the filling and mix until no streaks remain. Pour into crust.\nBake in the preheated oven for 60 minutes, or until filling is set. Allow to cool to room temperature, then refrigerate at least 4 hours before serving.\n", "time": 90, "urlnum": "25997"}, {"ingred": ["12 1/2 ounces bittersweet chocolate, chopped", "1/8 cup unsalted butter", "12 egg yolks", "1/4 cup white sugar", "12 egg whites", "1/8 cup white sugar", "1 1/4 cups heavy cream", "1 tablespoon unsweetened cocoa powder, for dusting"], "title": "Chocolate Mousse Cake V", "instr": "Preheat oven to 300 degrees F (150 degrees C). Butter a 9 inch springform pan, and line bottom with parchment paper.\nIn the top of a double boiler, heat chocolate and unsalted butter, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.\nIn a large bowl, beat egg yolks and 1/4 cup sugar until thick and lemon-colored. Fold into chocolate mixture; set aside. In a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add 1/8 cup sugar, continuing to beat until stiff peaks form. Fold 1/3 of the whites into the chocolate mixture, then quickly fold in remaining whites until no streaks remain. Pour 2/3 of mixture into prepared pan.\nBake in the preheated oven for 40 minutes, or until filling is just firm in the center. Allow to cool, then remove from pan and refrigerate 1 hour.\nIn a medium bowl, whip cream to soft peaks and fold into remaining chocolate mixture. Cover and refrigerate.\nSpread remaining mousse over cooled cake and dust with cocoa.\n", "time": 85, "urlnum": "25998"}, {"ingred": ["1 1/2 cups butter, softened", "3 cups white sugar", "5 eggs", "2 teaspoons vanilla extract", "2 teaspoons instant coffee granules dissolved in 1/4 cup hot water", "1 cup buttermilk", "2 cups all-purpose flour", "3/4 cup unsweetened cocoa powder", "1/2 teaspoon baking powder", "1 teaspoon salt"], "title": "Chocolate Pound Cake III", "instr": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan. Mix together the flour, cocoa, baking powder, and salt. Set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the dissolved coffee and buttermilk. Pour batter into prepared pan.\nBake in the preheated oven for 60 to 70 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 20 minutes, then turn out onto a wire rack and cool completely.\n", "time": 90, "urlnum": "25999"}]}