{"recipe": [{"title": "Tofu Quiche with Broccoli", "instr": "Preheat oven to 400 degrees F (200 degrees C). Bake pie crust in preheated oven for 10 to 12 minutes.\nPlace broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nHeat oil in a large skillet over medium-high heat. Saute onion and garlic until golden. Stir in the cooked broccoli and heat through.\nIn a blender, combine tofu, soy milk, mustard, salt, nutmeg, ground red pepper, black pepper, parsley and Parmesan soy cheese; process until smooth. In a large bowl combine tofu mixture with broccoli mixture. Pour into pie crust.\nBake in preheated oven until quiche is set, 35 to 40 minutes. Allow to stand for at least 5 minutes before cutting.\n", "time": 65, "ingred": ["1 (9 inch) unbaked 9 inch pie crust", "1 pound broccoli, chopped", "1 tablespoon olive oil", "1 onion, finely chopped", "4 cloves garlic, minced", "1 pound firm tofu, drained", "1/2 cup soy milk", "1/4 teaspoon Dijon mustard", "3/4 teaspoon salt", "1/4 teaspoon ground nutmeg", "1/2 teaspoon ground red pepper", "black pepper to taste", "1 tablespoon dried parsley", "1/8 cup Parmesan flavor soy cheese"], "urlnum": "25320"}, {"title": "Eggplant Parmesan II", "instr": "Preheat oven to 350 degrees F (175 degrees C).\nDip eggplant slices in egg, then in bread crumbs. Place in a single layer on a baking sheet. Bake in preheated oven for 5 minutes on each side.\nIn a 9x13 inch baking dish spread spaghetti sauce to cover the bottom. Place a layer of eggplant slices in the sauce. Sprinkle with mozzarella and Parmesan cheeses. Repeat with remaining ingredients, ending with the cheeses. Sprinkle basil on top.\nBake in preheated oven for 35 minutes, or until golden brown.\n", "time": 60, "ingred": ["3 eggplant, peeled and thinly sliced", "2 eggs, beaten", "4 cups Italian seasoned bread crumbs", "6 cups spaghetti sauce, divided", "1 (16 ounce) package mozzarella cheese, shredded and divided", "1/2 cup grated Parmesan cheese, divided", "1/2 teaspoon dried basil"], "urlnum": "25321"}]}