{"recipe": [{"title": "Tofu Quiche with Broccoli", "time": 65, "ingred": ["1 (9 inch) unbaked 9 inch pie crust", "1 pound broccoli, chopped", "1 tablespoon olive oil", "1 onion, finely chopped", "4 cloves garlic, minced", "1 pound firm tofu, drained", "1/2 cup soy milk", "1/4 teaspoon Dijon mustard", "3/4 teaspoon salt", "1/4 teaspoon ground nutmeg", "1/2 teaspoon ground red pepper", "black pepper to taste", "1 tablespoon dried parsley", "1/8 cup Parmesan flavor soy cheese"], "instr": "Preheat oven to 400 degrees F (200 degrees C). Bake pie crust in preheated oven for 10 to 12 minutes.\nPlace broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nHeat oil in a large skillet over medium-high heat. Saute onion and garlic until golden. Stir in the cooked broccoli and heat through.\nIn a blender, combine tofu, soy milk, mustard, salt, nutmeg, ground red pepper, black pepper, parsley and Parmesan soy cheese; process until smooth. In a large bowl combine tofu mixture with broccoli mixture. Pour into pie crust.\nBake in preheated oven until quiche is set, 35 to 40 minutes. Allow to stand for at least 5 minutes before cutting.\n", "urlnum": "25320"}, {"title": "Eggplant Parmesan II", "time": 60, "ingred": ["3 eggplant, peeled and thinly sliced", "2 eggs, beaten", "4 cups Italian seasoned bread crumbs", "6 cups spaghetti sauce, divided", "1 (16 ounce) package mozzarella cheese, shredded and divided", "1/2 cup grated Parmesan cheese, divided", "1/2 teaspoon dried basil"], "instr": "Preheat oven to 350 degrees F (175 degrees C).\nDip eggplant slices in egg, then in bread crumbs. Place in a single layer on a baking sheet. Bake in preheated oven for 5 minutes on each side.\nIn a 9x13 inch baking dish spread spaghetti sauce to cover the bottom. Place a layer of eggplant slices in the sauce. Sprinkle with mozzarella and Parmesan cheeses. Repeat with remaining ingredients, ending with the cheeses. Sprinkle basil on top.\nBake in preheated oven for 35 minutes, or until golden brown.\n", "urlnum": "25321"}, {"title": "Baked Shells in Sauce", "time": 40, "ingred": ["1/2 cup seashell pasta", "1 cup tomato sauce", "1/2 cup mushrooms, diced", "1/4 cup crumbled firm silken tofu", "1/4 cup shredded mozzarella cheese", "2 tablespoons grated Parmesan cheese"], "instr": "Bring a pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nPreheat oven to 400 degrees F (200 degrees C).\nIn a medium bowl combine tomato sauce, mushrooms and tofu. Stir in cooked pasta. In a separate, small bowl combine mozzarella and Parmesan cheeses.\nIn a small casserole dish layer pasta mixture and cheeses.\nBake in preheated oven for 30 minutes, or until lightly browned.\n", "urlnum": "25322"}, {"title": "Creamy Asparagus Pasta", "time": 30, "ingred": ["1 pound fresh asparagus, trimmed and cut into 2 inch pieces", "2 tablespoons butter", "1 clove garlic, minced", "1 pint light cream", "1 pound linguine pasta", "1 lemon, juiced"], "instr": "Bring a pot of water to a boil. Boil asparagus for 3 to 4 minutes; drain.\nIn a large saucepan melt butter over medium heat. Saute garlic and asparagus for 3 to 4 minutes. Stir in the cream and simmer for 10 minutes.\nMeanwhile, bring a large pot of water to a boil. Add linguine and cook for 8 to 10 minutes or until al dente; drain and transfer to a serving dish.\nStir lemon juice into asparagus mixture; pour mixture over pasta.\n", "urlnum": "25323"}, {"title": "Potato Dumplings", "time": 50, "ingred": ["2 large potatoes, peeled and chopped", "1 cup self-rising flour", "1 egg", "8 large seasoned croutons"], "instr": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender, about 15 minutes. Drain and mash.\nIn a medium bowl combine 2 cups mashed potatoes with flour and egg. Using about 1/4 to 1/2 cup of mixture each, shape into dumplings. Press a crouton into the center of each and seal dough around it.\nDrop dumplings into simmering soup or broth, cover and cook 20 minutes. Do not remove lid while dumplings are cooking.\n", "urlnum": "25324"}, {"title": "The Best Veggie Sandwich", "time": 25, "ingred": ["4 English muffins, split and toasted", "1 avocado, mashed", "1 cup alfalfa sprouts", "1 small tomato, chopped", "1 small sweet onion, chopped", "4 tablespoons Ranch-style salad dressing", "4 tablespoons toasted sesame seeds", "1 cup shredded smoked Cheddar cheese"], "instr": "Preheat oven to broil.\nPlace each muffin open-faced on a cookie sheet. Spread each half with mashed avocado; place halves close together. Distributing ingredients evenly, cover each half with sprouts, tomatoes, onion, dressing, sesame seeds and cheese.\nPlace under broiler for about 5 minutes, or until cheese is melted and bubbly.\n", "urlnum": "25325"}, {"title": "Faux Meat Balls", "time": 40, "ingred": ["6 eggs, beaten", "1 1/4 cups Italian-style dry bread crumbs", "1 tablespoon grated Parmesan cheese", "2 teaspoons dried parsley", "1 clove garlic, minced", "1/4 teaspoon pepper", "1/4 teaspoon salt"], "instr": "Preheat oven to 325 degrees F (165 degrees C).\nIn a medium bowl combine eggs, bread crumbs, Parmesan cheese, parsley, garlic, salt and pepper. Mixture should be moist and sticky, but should hold together when formed into balls.\nBake in preheated oven for 30 minutes.\n", "urlnum": "25326"}, {"title": "Yummy Vegan Chocolate Pudding", "time": 210, "ingred": ["2 tablespoons cornstarch", "1 cup soy milk", "1 cup soy creamer", "1/2 cup white sugar", "3 tablespoons egg replacer (dry)", "3 ounces semisweet chocolate, chopped", "2 teaspoons vanilla extract"], "instr": "In a medium saucepan combine cornstarch, soy milk and soy creamer; stir to dissolve cornstarch. Place on medium heat and stir in sugar. Cook, whisking frequently, until mixture comes to a low boil; remove from heat.\nIn a small bowl whisk egg replacer with 1/4 cup of hot milk mixture; return to pan with remaining milk mixture. Cook over medium heat for 3 to 4 minutes, until thick, but not boiling.\nPlace the chocolate in a medium bowl and pour in the hot milk mixture. Let stand for 30 seconds, then stir until melted and smooth. Cool for 10 to 15 minutes, then stir in vanilla.\nPour into ramekins or custard cups. Cover with plastic wrap and let cool at room temperature. Refrigerate for 3 hours, or overnight before serving.\n", "urlnum": "25327"}, {"title": "Seasoned Rice", "time": 30, "ingred": ["1 cup Basmati rice", "3 2/3 cups water, divided", "2 tablespoons soy margarine", "2 tablespoons nutritional yeast", "1/2 teaspoon garlic powder", "1 1/2 teaspoons dried basil", "salt to taste"], "instr": "In a saucepan bring 3 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes, or until rice is cooked and all liquid is absorbed.\nMelt margarine in a large saucepan over medium heat. Stir in remaining 2/3 cup water, nutritional yeast, garlic powder, basil and salt; heat for 5 minutes. Stir in cooked rice and cook until heated through, about 2 minutes.\n", "urlnum": "25328"}, {"title": "Broccoli Pizza Pie", "time": 45, "ingred": ["2 pounds potatoes, peeled", "1 pound broccoli, chopped", "2/3 cup shredded Monterey Jack cheese", "1/2 lemon, juiced", "2 teaspoons minced garlic", "1 tablespoon chopped fresh basil", "3/4 teaspoon dried oregano", "1/2 tablespoon dried parsley", "salt and pepper to taste", "2 (10 ounce) packages refrigerated pizza crust doughs", "1 (14 ounce) jar pizza sauce"], "instr": "Preheat oven to 400 degrees F (200 degrees C).\nBring a pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes; drain. When cool enough to handle, slice potatoes.\nMeanwhile, place broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes; drain.\nIn a large bowl combine potatoes, broccoli, cheese, lemon juice, garlic, basil, oregano and parsley. On a pizza pan or baking sheet, roll out 1 pizza dough. Top with potato mixture; season with salt and pepper. Cover with second pizza dough; with moistened fingers, seal edges of dough together.\nBake in preheated oven for 20 minutes, or until golden brown. Serve with warmed pizza sauce.\n", "urlnum": "25329"}, {"title": "Vegan Chili", "time": 40, "ingred": ["1 (12 ounce) package vegetarian burger crumbles", "1 (15 ounce) can tomato sauce", "1 cup water", "1 small onion, chopped", "3 cloves garlic, minced", "1 tablespoon vegetarian Worcestershire sauce", "1 teaspoon liquid smoke flavoring", "2 teaspoons chili powder", "1/8 teaspoon black pepper", "1 teaspoon dry mustard", "1 teaspoon salt", "1/8 teaspoon red pepper flakes"], "instr": "In a large pot combine crumbles, tomato sauce, water, onion, garlic, Worcestershire sauce, liquid smoke, chili powder, black pepper, mustard, salt and pepper flakes. Cook on low heat for 30 minutes, or until heated through.\n", "urlnum": "25330"}, {"title": "American-Style Red Beans and Rice", "time": 35, "ingred": ["1 tablespoon olive oil", "1 (15 ounce) can kidney beans", "1 1/2 cups tomato sauce", "4 1/2 cups water, divided", "1/2 teaspoon dried oregano", "1/2 teaspoon dried basil", "1 pinch dried thyme", "salt and pepper to taste", "5 teaspoons adobo seasoning, divided", "2 cups uncooked white rice"], "instr": "In a large saucepan combine olive oil, kidney beans, tomato sauce, 1/2 cup water, oregano, basil, thyme, salt, pepper and 2 teaspoons adobo. Simmer on low heat.\nMeanwhile, bring 4 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes, or until rice is cooked and all liquid is absorbed. Stir in remaining 3 teaspoons adobo. Serve beans over the rice.\n", "urlnum": "25331"}, {"title": "Vegetable Pasta Casserole", "time": 55, "ingred": ["1 (16 ounce) package penne pasta", "2 cups chopped broccoli", "1 cup sliced mushrooms", "1 cup chopped green bell pepper", "1 tablespoon butter", "1 onion, chopped", "1 clove garlic, minced", "1/4 cup all-purpose flour", "4 cups nonfat milk", "1/2 cup grated Parmesan cheese", "salt and pepper to taste", "5 tablespoons chopped fresh basil, divided", "1/3 cup dry bread crumbs", "2 tablespoons grated Parmesan cheese", "1 butter flavored cooking spray"], "instr": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes. Stir in broccoli, mushrooms and green pepper, and cook 6 to 8 minutes more, or until pasta is al dente; drain.\nMeanwhile, melt butter in a medium saucepan over medium-high heat. Saute onions and garlic for 1 to 2 minutes. Stir in flour and milk; cook 5 minutes, or until mixture coats the back of a spoon. Remove from heat and stir in 1/2 cup Parmesan cheese, salt and pepper.\nIn a 9x13 inch baking dish combine pasta, vegetables, milk mixture and 4 tablespoons basil. Sprinkle with bread crumbs, 2 tablespoons Parmesan cheese, and remaining 1 tablespoon basil. Coat with butter flavored cooking spray.\nBake in preheated oven for 30 minutes, or until golden brown.\n", "urlnum": "25332"}, {"title": "Vegan Black Bean Soup", "time": 45, "ingred": ["1 tablespoon olive oil", "1 large onion, chopped", "1 stalk celery, chopped", "2 carrots, chopped", "4 cloves garlic, chopped", "2 tablespoons chili powder", "1 tablespoon ground cumin", "1 pinch black pepper", "4 cups vegetable broth", "4 (15 ounce) cans black beans", "1 (15 ounce) can whole kernel corn", "1 (14.5 ounce) can crushed tomatoes"], "instr": "Heat oil in a large pot over medium-high heat. Saute onion, celery, carrots and garlic for 5 minutes. Season with chili powder, cumin, and black pepper; cook for 1 minute. Stir in vegetable broth, 2 cans of beans, and corn. Bring to a boil.\nMeanwhile, in a food processor or blender, process remaining 2 cans beans and tomatoes until smooth. Stir into boiling soup mixture, reduce heat to medium, and simmer for 15 minutes.\n", "urlnum": "25333"}, {"title": "Layered Taco Dip", "time": 15, "ingred": ["2 (8 ounce) packages cream cheese, softened", "1 (16 ounce) package small curd cottage cheese", "1 (1 ounce) package taco seasoning mix", "1 teaspoon lemon juice", "2 bunches green onions, chopped", "1 (2 ounce) can diced black olives, drained", "1 tomato, chopped", "2 cups shredded lettuce", "2 cups shredded Cheddar cheese"], "instr": "In a medium bowl combine cream cheese, cottage cheese, taco seasoning and lemon juice.\nIn a glass bowl or on a serving platter, layer cheese mixture, green onions, black olives, tomatoes, lettuce and cheese.\n", "urlnum": "25334"}, {"title": "Vegan Fajitas", "time": 70, "ingred": ["1/4 cup olive oil", "1/4 cup red wine vinegar", "1 teaspoon dried oregano", "1 teaspoon chili powder", "garlic salt to taste", "salt and pepper to taste", "1 teaspoon white sugar", "2 small zucchini, julienned", "2 medium small yellow squash, julienned", "1 large onion, sliced", "1 green bell pepper, cut into thin strips", "1 red bell pepper, cut into thin strips", "2 tablespoons olive oil", "1 (8.75 ounce) can whole kernel corn, drained", "1 (15 ounce) can black beans, drained"], "instr": "In a large bowl combine olive oil, vinegar, oregano, chili powder, garlic salt, salt, pepper and sugar. To the marinade add the zucchini, yellow squash, onion, green pepper and red pepper. Marinate vegetables in the refrigerator for at least 30 minutes, but not more than 24 hours.\nHeat oil in a large skillet over medium-high heat. Drain the vegetables and saute until tender, about 10 to 15 minutes. Stir in the corn and beans; increase the heat to high for 5 minutes, to brown vegetables.\n", "urlnum": "25335"}, {"title": "Fettuccini with Salsa Cruda and Feta", "time": 20, "ingred": ["1 pound fresh fettuccine pasta", "5 ripe tomatoes, chopped", "1/2 small red onion, chopped", "1 cup chopped fresh basil", "1/2 cup pitted kalamata olives, chopped", "freshly ground black pepper to taste", "2 tablespoons extra virgin olive oil", "1 cup crumbled feta cheese"], "instr": "Bring a large pot of lightly salted water to a boil. Add fettuccini and cook for 8 to 10 minutes or until al dente; drain.\nIn a medium bowl combine tomatoes, onion, basil, olives and black pepper.\nToss the fettuccini with olive oil. Serve pasta topped with tomato mixture and feta cheese.\n", "urlnum": "25336"}, {"title": "Parmesan and Broccoli Stuffed Potatoes", "time": 55, "ingred": ["4 large baking potatoes", "1 small head broccoli, cut into florets", "salt and pepper to taste", "3 tablespoons roasted garlic and parmesan cheese sauce (such as Ragu®)"], "instr": "Wash potatoes and pierce with a fork. Microwave on high for 15 minutes, or until done.\nPlace broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nPreheat oven to 350 degrees F (175 degrees C).\nSlice the tops off of the potatoes, and scoop the flesh into a large bowl with the broccoli. Season with salt and pepper to taste. Stir in cheese sauce and mash mixture until desired consistency is reached, adding more sauce if desired. Spoon mixture back into the skins, and place on a baking sheet.\nBake in preheated oven for 30 minutes.\n", "urlnum": "25337"}, {"title": "Agedashi-esque Tofu", "time": 15, "ingred": ["1 (12 ounce) package extra firm tofu", "3 tablespoons cornstarch", "oil for frying", "2 green onions, chopped", "2 tablespoons hoisin sauce"], "instr": "Cut tofu into 12 cubes. Place cornstarch on a plate or in a shallow bowl and dredge tofu in it, coating thoroughly.\nHeat enough oil so that tofu will be half-way submerged. Fry tofu in hot oil for 3 to 5 minutes on each side, or until crispy. Drain on paper towels.\nSprinkle green onions over tofu and drizzle with hoisin sauce. Serve immediately.\n", "urlnum": "25338"}, {"title": "Bold Vegan Chili", "time": 260, "ingred": ["1 (12 ounce) package vegetarian burger crumbles", "3 (15.25 ounce) cans kidney beans", "1 large red onion, chopped", "4 stalks celery, diced", "2 red bell peppers, chopped", "4 bay leaves", "2 tablespoons hot chili powder", "3 tablespoons molasses", "1 cube vegetable bouillon", "1 tablespoon chopped fresh cilantro", "1 teaspoon hot pepper sauce", "salt and pepper to taste", "1 cup water", "3 tablespoons all-purpose flour", "1 cup hot water"], "instr": "In a slow cooker combine vegetarian crumbles, kidney beans, onion, celery, bell pepper, bay leaves, chili powder, molasses, bouillon, cilantro, hot sauce, salt, pepper and 1 cup water. Cook on high for 3 hours.\nDissolve flour in 1 cup hot water. Pour into chili and cook 1 more hour.\n", "urlnum": "25339"}, {"title": "Vegetable Biryani", "time": 30, "ingred": ["1 cup Basmati rice", "1 1/4 tablespoons vegetable oil", "1/2 teaspoon cumin seeds", "1/2 teaspoon whole cloves", "1 onion, chopped", "3 cups water", "1 1/2 teaspoons salt, or to taste", "2 tablespoons garam masala", "chili powder to taste", "1 cup frozen mixed vegetables", "1 tablespoon butter"], "instr": "Rinse and soak rice for 30 minutes; drain.\nHeat oil in a large saucepan over medium heat. Saute cumin seeds and cloves for less than 1 minute. Saute the onion, stirring constantly, until brown. Stir in rice and fry for about 1 minute, stirring. Stir in the water, salt, garam masala, chili powder and vegetables. Bring to a boil, then reduce heat, cover and simmer for 20 minutes, or until all water is absorbed. Fluff with a fork and stir in butter before serving.\n", "urlnum": "25340"}, {"title": "Babaci's Potato Pierogi", "time": 90, "ingred": ["12 Yukon Gold potatoes, peeled and quartered", "3 eggs", "3 tablespoons cream cheese, divided", "3 teaspoons milk, divided", "2 cups all-purpose flour, divided", "2 1/2 (8 ounce) containers cottage cheese", "salt to taste", "2 tablespoons butter", "oil for frying"], "instr": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain and cool.\nMeanwhile, prepare dough by combining 1 egg, 1 tablespoon cream cheese, 1 teaspoon milk and 1/2 cup flour. Once all the flour has been worked in, add another 1/2 cup flour, 1 tablespoon cream cheese and 1 teaspoon milk. When the dough is well blended, add 1 egg, 1 tablespoon cream cheese and another 1/2 cup flour; mix well. Finally, add the remaining egg, 1 teaspoon milk and 1/2 cup flour. If dough is too dry, add a little more milk; if too wet, add more flour.\nOn a well floured surface, roll out 1/4 of the dough to 1/4 inch thickness. Using a glass, muffin cutter, or any rounded surface, cut out circles of dough. Flour both sides of the circle and set aside in a single layer on wax paper. Repeat process with remaining dough.\nMash the potatoes with the cottage cheese, salt and butter. Place a spoonful of the filling slightly below the center of a circle of dough. Fold the dough over and seal edges with fingertips. Use enough filling so that you have to stretch the dough over it, but not so much that it squeezes out when sealed.\nBring a large pot of salted water to a boil. Drop in pierogis, a few at a time. Cook for 1 to 2 minutes, or until they float to the top; drain.\nHeat oil in a large skillet over medium-high heat. Fry boiled pierogis in hot oil until crispy.\n", "urlnum": "25341"}, {"title": "Chinese Peppered Green Beans", "time": 13, "ingred": ["2 tablespoons green peppercorns, drained", "1 cup coarsely chopped cilantro", "1 tablespoon olive oil", "1 pound Chinese yardlong beans", "4 cloves garlic, finely chopped", "2 teaspoons brown sugar", "1 small red chile pepper, seeded and chopped fine", "2 tablespoons water"], "instr": "In a small bowl, using the bottom of a glass or jar, crush the peppercorns into a coarse pulp. Stir in the cilantro.\nHeat oil in a large wok or skillet over medium-high heat. Stir in beans, garlic, brown sugar, chile pepper, peppercorns and cilantro. Stir-fry for 45 seconds. Pour in the water and cover to steam for about 2 minutes. Serve immediately.\n", "urlnum": "25342"}, {"title": "Jamaican Beans and Rice Dish", "time": 155, "ingred": ["1 1/4 cups dry kidney beans", "1 cup coconut milk", "1 sprig fresh thyme", "1 teaspoon minced garlic", "1/8 cup chopped green onions", "1 hot red chile pepper, sliced", "2 1/4 cups uncooked brown rice"], "instr": "Combine beans and coconut milk in a large saucepan; cook for 2 hours on low heat.\nStir in thyme, garlic, onions and 3 slices chile pepper; simmer for 7 minutes. Stir in rice and bring to a boil. Reduce heat, cover and simmer for 25 minutes, or until all liquid is absorbed and rice is tender.\n", "urlnum": "25343"}, {"title": "Dolmathes", "time": 90, "ingred": ["1 cup olive oil, divided", "1 1/2 pounds onions, chopped", "1 3/4 cups uncooked white rice", "2 lemons, juiced", "2 tablespoons chopped fresh dill", "1/2 cup chopped fresh parsley", "2 tablespoons pine nuts", "1 (8 ounce) jar grape leaves, drained and rinsed"], "instr": "Preheat oven to 375 degrees F (190 degrees C).\nHeat 2 tablespoons oil in a large saucepan over medium heat. Saute onions until tender. Stir in rice and brown slightly. Add 3 1/2 cups water, and half of the lemon juice. Reduce heat, cover and simmer for 20 minutes, or until all liquid is absorbed and rice is tender. Stir in dill, parsley and pine nuts.\nRemove stems from grape leaves and place 1 tablespoon of rice mixture in the center. Fold in the sides and roll tightly. Place, folded side down, in a baking dish and cover with remaining olive oil, lemon juice and enough water to cover 1/2 of the dolmathas.\nCover with aluminum foil and bake in preheated oven for 45 minutes.\n", "urlnum": "25344"}, {"title": "Tofu Lasagna", "time": 55, "ingred": ["1/2 (12 ounce) package uncooked lasagna noodles", "1 (12 ounce) package firm tofu, crumbled", "2 eggs", "1/4 teaspoon salt", "1/4 teaspoon black pepper", "1/4 teaspoon ground nutmeg", "2 tablespoons milk", "1 cup spaghetti sauce", "1 tablespoon dried parsley", "2 cups shredded mozzarella cheese, divided", "1/2 cup grated Parmesan cheese"], "instr": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add lasagna and cook for 8 to 10 minutes or until al dente; drain.\nIn a medium bowl combine tofu, eggs, salt, pepper, nutmeg, milk, spaghetti sauce, parsley and 1 cup of mozzarella cheese. Spread a layer in the bottom of a 9x13 inch baking dish.\nLayer lasagna noodles with the sauce mixture, ending with sauce. Sprinkle with remaining mozzarella and Parmesan cheese.\nBake in preheated oven for 25 to 35 minutes.\n", "urlnum": "25345"}, {"title": "Coconut Rice", "time": 30, "ingred": ["2 1/2 cups Basmati rice", "4 (10 ounce) cans coconut milk", "1 pinch salt"], "instr": "In a large saucepan over high heat, combine rice, coconut milk and salt; bring to a boil.\nReduce heat, cover and simmer for 20 to 25 minutes, or until liquid is absorbed and rice is tender.\n", "urlnum": "25346"}, {"title": "Eggplant, Zucchini and Sweet Red Pepper Stew", "time": 80, "ingred": ["1 eggplant, cut into 1 inch cubes", "1/4 cup olive oil", "1 cup chopped onion", "5 cloves garlic, chopped", "1/2 cup Basmati rice", "1 zucchini, cut into large chunks", "1 large red bell pepper, chopped", "3 fresh tomatoes, diced", "1 cup Marsala wine", "1 1/2 cups water", "1/2 teaspoon salt, or to taste", "1/4 teaspoon red pepper flakes", "1/4 cup chopped fresh basil", "1/4 cup chopped fresh parsley", "1 sprig fresh rosemary, chopped"], "instr": "Place eggplant in a colander and sprinkle with salt.\nHeat olive oil in a Dutch oven or large pot. Rinse eggplant and pat dry. Saute until slightly browned. Stir in onion and saute until transparent. Stir in garlic and saute for 2 to 3 minutes.\nStir in rice, zucchini, red bell pepper, tomatoes, wine, water, salt and red pepper flakes. Cook over medium-high heat until mixture reaches a low boil. Reduce heat and simmer for 45 minutes, or until vegetables are tender.\nRemove from heat and stir in basil, parsley and rosemary.\n", "urlnum": "25347"}, {"title": "Italian Wheat Rolls", "time": 80, "ingred": ["1/2 cup olive oil", "1/4 cup white sugar", "1 tablespoon salt", "2 cups boiling water", "2 (.25 ounce) packages active dry yeast", "1/3 cup warm water (110 degrees F/45 degrees C)", "2 eggs", "2 cups whole wheat flour", "4 cups bread flour"], "instr": "In a small bowl, combine olive oil, white sugar and salt. Add boiling water and stir to dissolve sugar; let cool to lukewarm.\nIn a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nWhen sugar and water mixture has cooled, add yeast mixture, eggs, whole wheat flour and 2 cups bread flour. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\nDivide the dough into twenty four equal size pieces and form into rounds. Place the rounds on lightly greased baking sheets. Cover the rolls with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until golden brown, about 15 to 20 minutes.\n", "urlnum": "25348"}, {"title": "Molasses Mistake Cornbread", "time": 30, "ingred": ["2/3 cup cornmeal", "3/4 cup all-purpose flour", "1 tablespoon baking powder", "1 teaspoon salt", "1 egg, beaten", "1 cup milk", "2 tablespoons molasses"], "instr": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 8x8 inch baking pan.\nIn a large bowl, stir together cornmeal, flour, baking powder and salt. In a separate bowl, stir together egg, milk and molasses. Stir egg mixture into flour mixture; mix until blended. Pour batter into prepared pan.\nBake in preheated oven for 15 to 20 minutes, until golden brown and a toothpick inserted into center of pan comes out clean.\n", "urlnum": "25349"}]}